Repository: vladbogo/test-translation
Catalog: chi.xlf
Languages: chi

# ER_NO
source: "NO"
chi: "不"

# ER_YES
source: "YES"
chi: "是的"

# ER_CANT_CREATE_FILE
source: "Can't create file '%-.200s' (errno: %M)"
chi: "无法创建文件'%-.200s'（错误号码：%M）"

# ER_CANT_CREATE_TABLE
source: "Can't create table %`s.%`s (errno: %M)"
chi: "无法创建表%`s.%`s（错误号码：%M）"

# ER_CANT_CREATE_DB
source: "Can't create database '%-.192s' (errno: %M)"
chi: "无法创建数据库'%-.192s'（错误号码：%M）"

# ER_DB_CREATE_EXISTS
source: "Can't create database '%-.192s'; database exists"
chi: "无法创建数据库'%-.192s';已经存在"

# ER_DB_DROP_EXISTS
source: "Can't drop database '%-.192s'; database doesn't exist"
chi: "无法删除数据库'%-.192s';数据库不存在"

# ER_DB_DROP_DELETE
source: "Error dropping database (can't delete '%-.192s', errno: %M)"
chi: "删除数据库错误（无法删除'%-.192s'，错误号码：%M）"

# ER_DB_DROP_RMDIR
source: "Error dropping database (can't rmdir '%-.192s', errno: %M)"
chi: "删除数据库错误（无法rmdir '%-.192s'，错误号码：%M）"

# ER_CANT_DELETE_FILE
source: "Error on delete of '%-.192s' (errno: %M)"
chi: "删除'%-.192s'出错（错误号码：%M）"

# ER_CANT_FIND_SYSTEM_REC
source: "Can't read record in system table"
chi: "无法在系统表中读取记录"

# ER_CANT_GET_STAT
source: "Can't get status of '%-.200s' (errno: %M)"
chi: "无法获得'%-.200s'的状态（错误号码：%M）"

# ER_CANT_GET_WD
source: "Can't get working directory (errno: %M)"
chi: "无法获取工作目录（错误号码：%M）"

# ER_CANT_LOCK
source: "Can't lock file (errno: %M)"
chi: "无法锁定文件（错误号码：%M）"

# ER_CANT_OPEN_FILE
source: "Can't open file: '%-.200s' (errno: %M)"
chi: "无法打开文件：'%-.200s'（错误号码：%M）"

# ER_FILE_NOT_FOUND
source: "Can't find file: '%-.200s' (errno: %M)"
chi: "找不到文件：'%-.200s'（错误号码：%M）"

# ER_CANT_READ_DIR
source: "Can't read dir of '%-.192s' (errno: %M)"
chi: "无法读取'%-.192s'的文件夹（错误号码：%M）"

# ER_CANT_SET_WD
source: "Can't change dir to '%-.192s' (errno: %M)"
chi: "无法将dir更改为'%-.192s'（错误号码：%M）"

# ER_CHECKREAD
source: "Record has changed since last read in table '%-.192s'"
chi: "这个表自上次读后数据有变化'%-.192s'"

# ER_DISK_FULL
source: "Disk full (%s); waiting for someone to free some space... (errno: %M)"
chi: "磁盘已满(%s);等待释放一些空间...（错误号码：%M）"

# ER_DUP_KEY 23000
source: "Can't write; duplicate key in table '%-.192s'"
chi: "不能写;表'%-.192s'中有重复索引"

# ER_ERROR_ON_CLOSE
source: "Error on close of '%-.192s' (errno: %M)"
chi: "'%-.192s'关闭时出错（错误号码：%M）"

# ER_ERROR_ON_READ
source: "Error reading file '%-.200s' (errno: %M)"
chi: "读取文件'%-.200s'错误（错误号码：%M）"

# ER_ERROR_ON_RENAME
source: "Error on rename of '%-.210s' to '%-.210s' (errno: %M)"
chi: "重命名'%-.210s'到'%-.210s'错误（错误号码：%M）"

# ER_ERROR_ON_WRITE
source: "Error writing file '%-.200s' (errno: %M)"
chi: "写文件'%-.200s'错误（错误号码：%M）"

# ER_FILE_USED
source: "'%-.192s' is locked against change"
chi: "'%-.192s'被锁定，不能改变"

# ER_FILSORT_ABORT
source: "Sort aborted"
chi: "排序中止"

# ER_FORM_NOT_FOUND
source: "View '%-.192s' doesn't exist for '%-.192s'"
chi: "视图'%-.192s'不存在'%-.192s'"

# ER_GET_ERRNO
source: "Got error %M from storage engine %s"
chi: "错误 %M, 来自存储引擎 %s"

# ER_ILLEGAL_HA
source: "Storage engine %s of the table %`s.%`s doesn't have this option"
chi: "存储引擎%s %`s.%`s 表没有该选项"

# ER_KEY_NOT_FOUND
source: "Can't find record in '%-.192s'"
chi: "无法在'%-.192s'中找到记录"

# ER_NOT_FORM_FILE
source: "Incorrect information in file: '%-.200s'"
chi: "文件中的信息不正确：'%-.200s'"

# ER_NOT_KEYFILE
source: "Index for table '%-.200s' is corrupt; try to repair it"
chi: "表'%-.200s'的索引损坏;试着修复"

# ER_OLD_KEYFILE
source: "Old key file for table '%-.192s'; repair it!"
chi: "表'%-.192s'的老索引文件损坏; 修复!"

# ER_OPEN_AS_READONLY
source: "Table '%-.192s' is read only"
chi: "表'%-.192s'只可读"

# ER_OUTOFMEMORY HY001 S1001
source: "Out of memory; restart server and try again (needed %d bytes)"
chi: "内存不足; 重启后重试(需要 %d bytes)"

# ER_OUT_OF_SORTMEMORY HY001 S1001
source: "Out of sort memory, consider increasing server sort buffer size"
chi: "排序内存不足，可以考虑增加实例排序缓存量"

# ER_UNEXPECTED_EOF
source: "Unexpected EOF found when reading file '%-.192s' (errno: %M)"
chi: "阅读文件'%-.192s'时出现意外的EOF（错误号码：%M）"

# ER_CON_COUNT_ERROR 08004
source: "Too many connections"
chi: "太多连接"

# ER_OUT_OF_RESOURCES
source: "Out of memory."
chi: "内存不足."

# ER_BAD_HOST_ERROR 08S01
source: "Can't get hostname for your address"
chi: "不能从你的地址获取主机名称"

# ER_HANDSHAKE_ERROR 08S01
source: "Bad handshake"
chi: "坏握手"

# ER_DBACCESS_DENIED_ERROR 42000
source: "Access denied for user '%s'@'%s' to database '%-.192s'"
chi: "用户'%s'@'%s'无权访问数据库'%-.192s'"

# ER_ACCESS_DENIED_ERROR 28000
source: "Access denied for user '%s'@'%s' (using password: %s)"
chi: "'%s'@'%s' 用户无权访问 (使用密码: %s)"

# ER_NO_DB_ERROR 3D000
source: "No database selected"
chi: "没有选择数据库"

# ER_UNKNOWN_COM_ERROR 08S01
source: "Unknown command"
chi: "未知的命令"

# ER_BAD_NULL_ERROR 23000
source: "Column '%-.192s' cannot be null"
chi: "列'%-.192s'不能为NULL"

# ER_BAD_DB_ERROR 42000
source: "Unknown database '%-.192s'"
chi: "未知数据库'%-.192s'"

# ER_TABLE_EXISTS_ERROR 42S01
source: "Table '%-.192s' already exists"
chi: "表'%-.192s'已经存在"

# ER_BAD_TABLE_ERROR 42S02
source: "Unknown table '%-.100T'"
chi: "未知表'%-.100T'"

# ER_NON_UNIQ_ERROR 23000
source: "Column '%-.192s' in %-.192s is ambiguous"
chi: "列名 '%-.192s' 在 %-.192s 定义模糊"

# ER_SERVER_SHUTDOWN 08S01
source: "Server shutdown in progress"
chi: "服务器正在关闭"

# ER_BAD_FIELD_ERROR 42S22 S0022
source: "Unknown column '%-.192s' in '%-.192s'"
chi: "未知列'%-.192s'在'%-.192s'"

# ER_WRONG_FIELD_WITH_GROUP 42000 S1009
source: "'%-.192s' isn't in GROUP BY"
chi: "'%-.192s' 不在 GROUP BY"

# ER_WRONG_GROUP_FIELD 42000 S1009
source: "Can't group on '%-.192s'"
chi: "不能在'%-.192s'上分组"

# ER_WRONG_SUM_SELECT 42000 S1009
source: "Statement has sum functions and columns in same statement"
chi: "语句在同一语句里有求和函数和列"

# ER_WRONG_VALUE_COUNT 21S01
source: "Column count doesn't match value count"
chi: "列数与值数不匹配"

# ER_TOO_LONG_IDENT 42000 S1009
source: "Identifier name '%-.100T' is too long"
chi: "标识符'%-.100T'太长"

# ER_DUP_FIELDNAME 42S21 S1009
source: "Duplicate column name '%-.192s'"
chi: "列名重复 '%-.192s'"

# ER_DUP_KEYNAME 42000 S1009
source: "Duplicate key name '%-.192s'"
chi: "索引名重复 '%-.192s'"

# ER_DUP_ENTRY 23000 S1009
source: "Duplicate entry '%-.192T' for key %d"
chi: "重复条目'%-.192T'在索引%d"

# ER_WRONG_FIELD_SPEC 42000 S1009
source: "Incorrect column specifier for column '%-.192s'"
chi: "列的说明符不对 '%-.192s'"

# ER_PARSE_ERROR 42000 s1009
source: "%s near '%-.80T' at line %d"
chi: "%s 附近'%-.80T'在第%d行"

# ER_EMPTY_QUERY 42000
source: "Query was empty"
chi: "查询为空"

# ER_NONUNIQ_TABLE 42000 S1009
source: "Not unique table/alias: '%-.192s'"
chi: "表或别名不唯一:'%-.192s'"

# ER_INVALID_DEFAULT 42000 S1009
source: "Invalid default value for '%-.192s'"
chi: "'%-.192s'的默认值无效"

# ER_MULTIPLE_PRI_KEY 42000 S1009
source: "Multiple primary key defined"
chi: "定义了多个主键"

# ER_TOO_MANY_KEYS 42000 S1009
source: "Too many keys specified; max %d keys allowed"
chi: "定义的索引太多; 最多允许%d 个索引"

# ER_TOO_MANY_KEY_PARTS 42000 S1009
source: "Too many key parts specified; max %d parts allowed"
chi: "指定的索引部分过多; 最多允许%d个部分"

# ER_TOO_LONG_KEY 42000 S1009
source: "Specified key was too long; max key length is %d bytes"
chi: "指定索引太长; 最大索引长度是 %d字节"

# ER_KEY_COLUMN_DOES_NOT_EXIST 42000 S1009
source: "Key column '%-.192s' doesn't exist in table"
chi: "索引列'%-.192s'不在表里"

# ER_BLOB_USED_AS_KEY 42000 S1009
source: "BLOB column %`s can't be used in key specification in the %s table"
chi: "索引里不能含有BLOB列%`s表%s"

# ER_TOO_BIG_FIELDLENGTH 42000 S1009
source: "Column length too big for column '%-.192s' (max = %lu); use BLOB or TEXT instead"
chi: "数据太长超过列容量 '%-.192s' (最长 = %lu); 用 BLOB 或 TEXT 替代"

# ER_WRONG_AUTO_KEY 42000 S1009
source: "Incorrect table definition; there can be only one auto column and it must be defined as a key"
chi: "表定义不正确；只能有一个自动列，并且必须将其定义为索引"

# ER_BINLOG_CANT_DELETE_GTID_DOMAIN
source: "Could not delete gtid domain. Reason: %s."
chi: "无法删除gtid域. 原因: %s."

# ER_NORMAL_SHUTDOWN
source: "%s (initiated by: %s): Normal shutdown"
chi: "%s（%s）:正常关闭"

# ER_GOT_SIGNAL
source: "%s: Got signal %d. Aborting!\n"
chi: "%s: 收到信号 %d. 强行中止!\n"

# ER_SHUTDOWN_COMPLETE
source: "%s: Shutdown complete\n"
chi: "%s：关闭完成\n"

# ER_FORCING_CLOSE 08S01
source: "%s: Forcing close of thread %ld user: '%-.48s'\n"
chi: "%s: 强行关闭线程 %ld 用户: '%-.48s'\n"

# ER_IPSOCK_ERROR 08S01
source: "Can't create IP socket"
chi: "无法创建IP插口"

# ER_NO_SUCH_INDEX 42S12 S1009
source: "Table '%-.192s' has no index like the one used in CREATE INDEX; recreate the table"
chi: "表 '%-.192s' 没有像 CREATE INDEX 中使用的索引；重新创建表"

# ER_WRONG_FIELD_TERMINATORS 42000 S1009
source: "Field separator argument is not what is expected; check the manual"
chi: "字段分隔符参数不合预期；查看文档"

# ER_BLOBS_AND_NO_TERMINATED 42000 S1009
source: "You can't use fixed rowlength with BLOBs; please use 'fields terminated by'"
chi: "您不能对 BLOB 使用固定的行长度；请使用 'fields terminated by'"

# ER_TEXTFILE_NOT_READABLE
source: "The file '%-.128s' must be in the database directory or be readable by all"
chi: "文件'%-.128s'必须位于数据库目录中，或所有人都可以读取"

# ER_FILE_EXISTS_ERROR
source: "File '%-.200s' already exists"
chi: "文件'%-.200s'已经存在"

# ER_LOAD_INFO
source: "Records: %ld Deleted: %ld Skipped: %ld Warnings: %ld"
chi: "记录：%ld删除：%ld跳过：%ld警告：%ld"

# ER_ALTER_INFO
source: "Records: %ld Duplicates: %ld"
chi: "记录: %ld 重复: %ld"

# ER_WRONG_SUB_KEY
source: "Incorrect prefix key; the used key part isn't a string, the used length is longer than the key part, or the storage engine doesn't support unique prefix keys"
chi: "前缀索引不正确；使用的索引部分不是字符串，使用的长度比索引部分长，或者存储引擎不支持独特前缀索引"

# ER_CANT_REMOVE_ALL_FIELDS 42000
source: "You can't delete all columns with ALTER TABLE; use DROP TABLE instead"
chi: "您不能使用 ALTER TABLE 删除所有列；改用 DROP TABLE"

# ER_CANT_DROP_FIELD_OR_KEY 42000
source: "Can't DROP %s %`-.192s; check that it exists"
chi: "不能 DROP %s %`-.192s; 检查它是否存在"

# ER_INSERT_INFO
source: "Records: %ld Duplicates: %ld Warnings: %ld"
chi: "记录: %ld 重复: %ld 警告: %ld"

# ER_UPDATE_TABLE_USED
source: "Table '%-.192s' is specified twice, both as a target for '%s' and as a separate source for data"
chi: "表 '%-.192s' 被指定了两次, 即作为 '%s' 的目标，又作为数据的独立源"

# ER_NO_SUCH_THREAD
source: "Unknown thread id: %lu"
chi: "未知线程ID：%lu"

# ER_KILL_DENIED_ERROR
source: "You are not owner of thread %lld"
chi: "你不是线程%lld的所有者"

# ER_NO_TABLES_USED
source: "No tables used"
chi: "没有使用表"

# ER_TOO_BIG_SET
source: "Too many strings for column %-.192s and SET"
chi: "列 %-.192s 和SET的字符串过多"

# ER_NO_UNIQUE_LOGFILE
source: "Can't generate a unique log-filename %-.200s.(1-999)\n"
chi: "无法生成唯一的log-filename%-.200s.(1-999)\ n"

# ER_TABLE_NOT_LOCKED_FOR_WRITE
source: "Table '%-.192s' was locked with a READ lock and can't be updated"
chi: "表 '%-.192s' 有 READ 锁，无法更新"

# ER_TABLE_NOT_LOCKED
source: "Table '%-.192s' was not locked with LOCK TABLES"
chi: "表 '%-.192s' 未使用 LOCK TABLES 锁定"

# ER_UNUSED_17
source: "You should never see it"
chi: "你永远不应该看到它"

# ER_WRONG_DB_NAME 42000
source: "Incorrect database name '%-.100T'"
chi: "数据库名称不正确'%-.100T'"

# ER_WRONG_TABLE_NAME 42000
source: "Incorrect table name '%-.100s'"
chi: "表名不正确'%-.100s'"

# ER_TOO_BIG_SELECT 42000
source: "The SELECT would examine more than MAX_JOIN_SIZE rows; check your WHERE and use SET SQL_BIG_SELECTS=1 or SET MAX_JOIN_SIZE=# if the SELECT is okay"
chi: "SELECT 将检查超过 MAX_JOIN_SIZE 行；检查您的 WHERE 并使用 SET SQL_BIG_SELECTS=1 或 SET MAX_JOIN_SIZE=# 如果 SELECT 没问题"

# ER_UNKNOWN_ERROR
source: "Unknown error"
chi: "未知错误"

# ER_UNKNOWN_PROCEDURE 42000
source: "Unknown procedure '%-.192s'"
chi: "未知存储过程 '%-.192s'"

# ER_WRONG_PARAMCOUNT_TO_PROCEDURE 42000
source: "Incorrect parameter count to procedure '%-.192s'"
chi: "存储过程 '%-.192s' 需要的参数和提供的参数不吻合"

# ER_WRONG_PARAMETERS_TO_PROCEDURE
source: "Incorrect parameters to procedure '%-.192s'"
chi: "存储过程 '%-.192s' 的参数不对"

# ER_UNKNOWN_TABLE 42S02
source: "Unknown table '%-.192s' in %-.32s"
chi: "未知表名 '%-.192s' 在 %-.32s"

# ER_FIELD_SPECIFIED_TWICE 42000
source: "Column '%-.192s' specified twice"
chi: "列 '%-.192s' 被指定了两次"

# ER_INVALID_GROUP_FUNC_USE
source: "Invalid use of group function"
chi: "组函数使用无效"

# ER_UNSUPPORTED_EXTENSION 42000
source: "Table '%-.192s' uses an extension that doesn't exist in this MariaDB version"
chi: "表'%-.192s'使用此MariaDB版本不存在的扩展"

# ER_TABLE_MUST_HAVE_COLUMNS 42000
source: "A table must have at least 1 column"
chi: "表必须至少有1列"

# ER_RECORD_FILE_FULL
source: "The table '%-.192s' is full"
chi: "表'%-.192s'已满"

# ER_UNKNOWN_CHARACTER_SET 42000
source: "Unknown character set: '%-.64s'"
chi: "未知字符集：'%-.64s'"

# ER_TOO_MANY_TABLES
source: "Too many tables; MariaDB can only use %d tables in a join"
chi: "表太多; MariaDB 只能在join中使用 %d 个表"

# ER_TOO_MANY_FIELDS
source: "Too many columns"
chi: "太多列"

# ER_TOO_BIG_ROWSIZE 42000
source: "Row size too large. The maximum row size for the used table type, not counting BLOBs, is %ld. This includes storage overhead, check the manual. You have to change some columns to TEXT or BLOBs"
chi: "行尺寸太大. 不包括BLOB，表的最大的行大小是 %ld. 这包括存储开销，请查看文档。您必须将某些列更改为 TEXT 或 BLOB"

# ER_STACK_OVERRUN
source: "Thread stack overrun: Used: %ld of a %ld stack. Use 'mariadbd --thread_stack=#' to specify a bigger stack if needed"
chi: "线程栈溢出: 已使用了: %ld 堆栈 %ld. 使用 'mariadbd --thread_stack=#' 指定更大的堆栈"

# ER_WRONG_OUTER_JOIN 42000
source: "Cross dependency found in OUTER JOIN; examine your ON conditions"
chi: "在 OUTER JOIN 中发现交叉依赖；检查您的 ON 条件"

# ER_NULL_COLUMN_IN_INDEX 42000
source: "Table handler doesn't support NULL in given index. Please change column '%-.192s' to be NOT NULL or use another handler"
chi: "表处理程序不支持给定索引中的 NULL. 请将列 '%-.192s' 改为 NOT NULL 或使用其他处理程序"

# ER_CANT_FIND_UDF
source: "Can't load function '%-.192s'"
chi: "无法加载函数'%-.192s'"

# ER_CANT_INITIALIZE_UDF
source: "Can't initialize function '%-.192s'; %-.80s"
chi: "无法初始化函数 '%-.192s'; %-.80s"

# ER_UDF_NO_PATHS
source: "No paths allowed for shared library"
chi: "共享库不允许使用路径"

# ER_UDF_EXISTS
source: "Function '%-.192s' already exists"
chi: "函数 '%-.192s' 已经存在"

# ER_CANT_OPEN_LIBRARY
source: "Can't open shared library '%-.192s' (errno: %d, %-.128s)"
chi: "不能打开共享库 '%-.192s' (错误号码: %d, %-.128s)"

# ER_CANT_FIND_DL_ENTRY
source: "Can't find symbol '%-.128s' in library"
chi: "在库中找不到符号 '%-.128s'"

# ER_FUNCTION_NOT_DEFINED
source: "Function '%-.192s' is not defined"
chi: "未定义函数 '%-.192s'"

# ER_HOST_IS_BLOCKED
source: "Host '%-.64s' is blocked because of many connection errors; unblock with 'mariadb-admin flush-hosts'"
chi: "主机 '%-.64s' 由于许多连接错误而被阻止；使用 'mariadb-admin flush-hosts' 解除阻塞"

# ER_HOST_NOT_PRIVILEGED
source: "Host '%-.64s' is not allowed to connect to this MariaDB server"
chi: "Host'%-.64s'不允许连接到此MariaDB服务器"

# ER_PASSWORD_ANONYMOUS_USER 42000
source: "You are using MariaDB as an anonymous user and anonymous users are not allowed to modify user settings"
chi: "您正在以匿名用户身份使用 MariaDB，匿名用户不能修改用户设置"

# ER_PASSWORD_NOT_ALLOWED 42000
source: "You must have privileges to update tables in the mysql database to be able to change passwords for others"
chi: "您必须具有更新 MariaDB 数据库中的表的权限才能更改其他人的密码"

# ER_PASSWORD_NO_MATCH 28000
source: "Can't find any matching row in the user table"
chi: "在用户表中找不到任何匹配的行"

# ER_UPDATE_INFO
source: "Rows matched: %ld Changed: %ld Warnings: %ld"
chi: "匹配行：%ld已更改：%ld警告：%ld"

# ER_CANT_CREATE_THREAD
source: "Can't create a new thread (errno %M); if you are not out of available memory, you can consult the manual for a possible OS-dependent bug"
chi: "无法创建新线程 (错误号码 %M); 如果您没有用完剩余内存，您可以查阅文档以了解可能与操作系统相关的错误"

# ER_WRONG_VALUE_COUNT_ON_ROW 21S01
source: "Column count doesn't match value count at row %lu"
chi: "列计数与行%lu的值计数不匹配"

# ER_CANT_REOPEN_TABLE
source: "Can't reopen table: '%-.192s'"
chi: "无法重新打开表：'%-.192s'"

# ER_INVALID_USE_OF_NULL 22004
source: "Invalid use of NULL value"
chi: "无效使用 NULL 值"

# ER_REGEXP_ERROR 42000
source: "Regex error '%s'"
chi: "正则表达错误 '%s'"

# ER_MIX_OF_GROUP_FUNC_AND_FIELDS 42000
source: "Mixing of GROUP columns (MIN(),MAX(),COUNT(),...) with no GROUP columns is illegal if there is no GROUP BY clause"
chi: "如果没有 GROUP BY 子句，不能混合没有 GROUP 列的 GROUP 列 (MIN(),MAX(),COUNT(),...)"

# ER_NONEXISTING_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s'"
chi: "用户 '%-.48s' 来自主机 '%-.64s'没有此类授权"

# ER_TABLEACCESS_DENIED_ERROR 42000
source: "%-.100T command denied to user '%s'@'%s' for table '%-.192s'"
chi: "%-.100T 命令的权限拒绝用户 '%s'@'%s' 用在表 '%-.192s'"

# ER_COLUMNACCESS_DENIED_ERROR 42000
source: "%-.32s command denied to user '%s'@'%s' for column '%-.192s' in table '%-.192s'"
chi: "%-.32s 命令的权限拒绝用户 '%s'@'%s' 用在列 '%-.192s' 在表 '%-.192s'"

# ER_ILLEGAL_GRANT_FOR_TABLE 42000
source: "Illegal GRANT/REVOKE command; please consult the manual to see which privileges can be used"
chi: "非法的 GRANT/REVOKE 命令；请查阅文档查看可以使用哪些权限"

# ER_GRANT_WRONG_HOST_OR_USER 42000
source: "The host or user argument to GRANT is too long"
chi: "GRANT 语句的主机或用户参数太长"

# ER_NO_SUCH_TABLE 42S02
source: "Table '%-.192s.%-.192s' doesn't exist"
chi: "表 '%-.192s.%-.192s' 不存在"

# ER_NONEXISTING_TABLE_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s' on table '%-.192s'"
chi: "没有为用户 '%-.48s' 来自主机 '%-.64s' 在表 '%-.192s' 上授权"

# ER_NOT_ALLOWED_COMMAND 42000
source: "The used command is not allowed with this MariaDB version"
chi: "本 MariaDB 版本不允许使用这个命令"

# ER_SYNTAX_ERROR 42000
source: "You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use"
chi: "您的 SQL 语法有错误；请查看相关文档"

# ER_DELAYED_CANT_CHANGE_LOCK
source: "Delayed insert thread couldn't get requested lock for table %-.192s"
chi: "延迟插入线程无法获得 %-.192s 的请求锁定"

# ER_TOO_MANY_DELAYED_THREADS
source: "Too many delayed threads in use"
chi: "使用中的延迟线程太多"

# ER_ABORTING_CONNECTION 08S01
source: "Aborted connection %ld to db: '%-.192s' user: '%-.48s' (%-.64s)"
chi: "终止连线 %ld 数据库: '%-.192s' 用户: '%-.48s' (%-.64s)"

# ER_NET_PACKET_TOO_LARGE 08S01
source: "Got a packet bigger than 'max_allowed_packet' bytes"
chi: "收到的数据包大于 'max_allowed_packet' 字节"

# ER_NET_READ_ERROR_FROM_PIPE 08S01
source: "Got a read error from the connection pipe"
chi: "连接管道读取错误"

# ER_NET_FCNTL_ERROR 08S01
source: "Got an error from fcntl()"
chi: "fcntl（）的错误"

# ER_NET_PACKETS_OUT_OF_ORDER 08S01
source: "Got packets out of order"
chi: "数据包乱序"

# ER_NET_UNCOMPRESS_ERROR 08S01
source: "Couldn't uncompress communication packet"
chi: "无法解压缩通信数据包"

# ER_NET_READ_ERROR 08S01
source: "Got an error reading communication packets"
chi: "读取通信数据包出错"

# ER_NET_READ_INTERRUPTED 08S01
source: "Got timeout reading communication packets"
chi: "读取通信包超时"

# ER_NET_ERROR_ON_WRITE 08S01
source: "Got an error writing communication packets"
chi: "写入通信包时出错"

# ER_NET_WRITE_INTERRUPTED 08S01
source: "Got timeout writing communication packets"
chi: "写入通信包超时"

# ER_TOO_LONG_STRING 42000
source: "Result string is longer than 'max_allowed_packet' bytes"
chi: "结果字符串长于'max_allowed_packet'字节"

# ER_TABLE_CANT_HANDLE_BLOB 42000
source: "Storage engine %s doesn't support BLOB/TEXT columns"
chi: "存储引擎%s不支持blob / text列"

# ER_TABLE_CANT_HANDLE_AUTO_INCREMENT 42000
source: "Storage engine %s doesn't support AUTO_INCREMENT columns"
chi: "存储引擎%s不支持auto_increment列"

# ER_DELAYED_INSERT_TABLE_LOCKED
source: "INSERT DELAYED can't be used with table '%-.192s' because it is locked with LOCK TABLES"
chi: "INSERT DELAYED 不能用在表 '%-.192s' 因为它被LOCK TABLES 锁定"

# ER_WRONG_COLUMN_NAME 42000
source: "Incorrect column name '%-.100s'"
chi: "错误列名 '%-.100s'"

# ER_WRONG_KEY_COLUMN 42000
source: "The storage engine %s can't index column %`s"
chi: "存储引擎 %s 不能给 %`s 列建索引"

# ER_WRONG_MRG_TABLE
source: "Unable to open underlying table which is differently defined or of non-MyISAM type or doesn't exist"
chi: "无法打开定义不同或非 MyISAM 类型或不存在的表"

# ER_DUP_UNIQUE 23000
source: "Can't write, because of unique constraint, to table '%-.192s'"
chi: "因为表'%-.192s' 唯一约束，无法写入"

# ER_BLOB_KEY_WITHOUT_LENGTH 42000
source: "BLOB/TEXT column '%-.192s' used in key specification without a key length"
chi: "BLOB/TEXT 列 '%-.192s' 在没有索引长度的索引规范中使用"

# ER_PRIMARY_CANT_HAVE_NULL 42000
source: "All parts of a PRIMARY KEY must be NOT NULL; if you need NULL in a key, use UNIQUE instead"
chi: "PRIMARY KEY 的所有部分都不能为NULL；如果您需要在键中使用 NULL，请改用 UNIQUE"

# ER_TOO_MANY_ROWS 42000
source: "Result consisted of more than one row"
chi: "结果多于一行"

# ER_REQUIRES_PRIMARY_KEY 42000
source: "This table type requires a primary key"
chi: "此表类型需要主索引"

# ER_NO_RAID_COMPILED
source: "This version of MariaDB is not compiled with RAID support"
chi: "这个版本的 MariaDB 编译时不支持 RAID"

# ER_UPDATE_WITHOUT_KEY_IN_SAFE_MODE
source: "You are using safe update mode and you tried to update a table without a WHERE that uses a KEY column"
chi: "您正在使用安全更新模式，同时您尝试更新时没有使用含有 KEY 列的 WHERE 语句"

# ER_KEY_DOES_NOT_EXISTS 42000 S1009
source: "Key '%-.192s' doesn't exist in table '%-.192s'"
chi: "索引 '%-.192s' 在表 '%-.192s' 里不存在"

# ER_CHECK_NO_SUCH_TABLE 42000
source: "Can't open table"
chi: "无法打开表"

# ER_CHECK_NOT_IMPLEMENTED 42000
source: "The storage engine for the table doesn't support %s"
chi: "该表的存储引擎不支持%s"

# ER_CANT_DO_THIS_DURING_AN_TRANSACTION 25000
source: "You are not allowed to execute this command in a transaction"
chi: "不允许在事务中执行此命令"

# ER_ERROR_DURING_COMMIT
source: "Got error %M during COMMIT"
chi: "COMMIT时发生错误 %M "

# ER_ERROR_DURING_ROLLBACK
source: "Got error %M during ROLLBACK"
chi: "回滚时出错%M"

# ER_ERROR_DURING_FLUSH_LOGS
source: "Got error %M during FLUSH_LOGS"
chi: "flush_logs时出错%M"

# ER_ERROR_DURING_CHECKPOINT
source: "Got error %M during CHECKPOINT"
chi: "CHECKPOINT时出错%M "

# ER_NEW_ABORTING_CONNECTION 08S01
source: "Aborted connection %lld to db: '%-.192s' user: '%-.48s' host: '%-.64s' (%-.64s)"
chi: "终止的连接 %lld 到数据库: '%-.192s' 用户: '%-.48s' 主机: '%-.64s' (%-.64s)"

# ER_UNUSED_10
source: "You should never see it"
chi: "你应当永远看不到这个"

# ER_FLUSH_MASTER_BINLOG_CLOSED
source: "Binlog closed, cannot RESET MASTER"
chi: "Binlog 已关闭, 不能 RESET MASTER"

# ER_INDEX_REBUILD
source: "Failed rebuilding the index of dumped table '%-.192s'"
chi: "重建 dumped table '%-.192s' 的索引失败"

# ER_MASTER
source: "Error from master: '%-.64s'"
chi: "Master错误：'%-.64s'"

# ER_MASTER_NET_READ 08S01
source: "Net error reading from master"
chi: "读master时有网络错误"

# ER_MASTER_NET_WRITE 08S01
source: "Net error writing to master"
chi: "写master时有网络错误"

# ER_FT_MATCHING_KEY_NOT_FOUND
source: "Can't find FULLTEXT index matching the column list"
chi: "找不到与列列表匹配的全文索引"

# ER_LOCK_OR_ACTIVE_TRANSACTION
source: "Can't execute the given command because you have active locked tables or an active transaction"
chi: "无法执行给定的命令，因为表上有锁或有活动事务"

# ER_UNKNOWN_SYSTEM_VARIABLE
source: "Unknown system variable '%-.*s'"
chi: "未知系统变量 '%-.*s'"

# ER_CRASHED_ON_USAGE
source: "Table '%-.192s' is marked as crashed and should be repaired"
chi: "表'%-.192s'标记为崩溃，应该修复"

# ER_CRASHED_ON_REPAIR
source: "Table '%-.192s' is marked as crashed and last (automatic?) repair failed"
chi: "表 '%-.192s' 被标记为崩溃，上一次的修复（自动？）失败"

# ER_WARNING_NOT_COMPLETE_ROLLBACK
source: "Some non-transactional changed tables couldn't be rolled back"
chi: "某些非事务性更改的表无法回滚"

# ER_TRANS_CACHE_FULL
source: "Multi-statement transaction required more than 'max_binlog_cache_size' bytes of storage; increase this mariadbd variable and try again"
chi: "多语句事务需要超过 'max_binlog_cache_size' 字节的存储空间；增加这个 mariadbd 变量后再试一次"

# ER_SLAVE_MUST_STOP
source: "This operation cannot be performed as you have a running slave '%2$*1$s'; run STOP SLAVE '%2$*1$s' first"
chi: "这个操作不能执行，因为你有个正在运行的 slave '%2$*1$s'; 先运行 STOP SLAVE '%2$*1$s' 后再试"

# ER_SLAVE_NOT_RUNNING
source: "This operation requires a running slave; configure slave and do START SLAVE"
chi: "这个操作需要一个正在运行的slave；配置从机并执行 START SLAVE"

# ER_BAD_SLAVE
source: "The server is not configured as slave; fix in config file or with CHANGE MASTER TO"
chi: "服务器未配置为从站;修复配置文件或使用CHANGE MASTER TO"

# ER_MASTER_INFO
source: "Could not initialize master info structure for '%.*s'; more error messages can be found in the MariaDB error log"
chi: "无法初始化'%.*s'的master info structure;MariaDB错误日志中可以找到更多错误消息"

# ER_SLAVE_THREAD
source: "Could not create slave thread; check system resources"
chi: "无法创建slave线程;检查系统资源"
