Repository: vladbogo/test-translation
Catalog: chi.xlf
Languages: chi

# ER_JSON_BAD_CHR
source: "Broken JSON string in argument %d to function '%s' at position %d"
chi: "坏JSON，参数%d 函数'%s' 位置%d"

# ER_JSON_NOT_JSON_CHR
source: "Character disallowed in JSON in argument %d to function '%s' at position %d"
chi: "变量%d出现禁止字符，函数'%s'在%d处"

# ER_JSON_EOS
source: "Unexpected end of JSON text in argument %d to function '%s'"
chi: "JSON文本中的意外结尾，参数%d 函数'%s'"

# ER_JSON_SYNTAX
source: "Syntax error in JSON text in argument %d to function '%s' at position %d"
chi: "JSON文本语法错误 参数%d 函数'%s' 位置%d"

# ER_JSON_ESCAPING
source: "Incorrect escaping in JSON text in argument %d to function '%s' at position %d"
chi: "JSON文本中逸出不正确 参数%d 函数'%s' 位置%d"

# ER_JSON_DEPTH
source: "Limit of %d on JSON nested strucures depth is reached in argument %d to function '%s' at position %d"
chi: "超过JSON嵌套深度的%d限制 参数%d 函数'%s' 位置%d的"

# ER_JSON_PATH_EOS
source: "Unexpected end of JSON path in argument %d to function '%s'"
chi: "JSON文本路径错误 参数%d 函数'%s'"

# ER_JSON_PATH_SYNTAX
source: "Syntax error in JSON path in argument %d to function '%s' at position %d"
chi: "JSON路径语法错误 参数%d 函数'%s' 位置%d"

# ER_JSON_PATH_DEPTH
source: "Limit of %d on JSON path depth is reached in argument %d to function '%s' at position %d"
chi: "JSON路径深度上限达到：%d 参数%d 函数'%s' 位置%d"

# ER_JSON_PATH_NO_WILDCARD
source: "Wildcards or range in JSON path not allowed in argument %d to function '%s'"
chi: "JSON路径中的通配符不允许 参数%d 函数'%s'"

# ER_JSON_PATH_ARRAY
source: "JSON path should end with an array identifier in argument %d to function '%s'"
chi: "JSON路径应当以排列为终 参数%d 函数'%s'"

# ER_JSON_ONE_OR_ALL
source: "Argument 2 to function '%s' must be "one" or "all"."
chi: "函数'%s'的第二个参数必须是'一个'或'全部'"

# ER_UNSUPPORTED_COMPRESSED_TABLE
source: "InnoDB refuses to write tables with ROW_FORMAT=COMPRESSED or KEY_BLOCK_SIZE."
chi: "CREATE TEMPORARY TABLE 不允许用ROW_FORMAT=COMPRESSED或KEY_BLOCK_SIZE"

# ER_GEOJSON_INCORRECT
source: "Incorrect GeoJSON format specified for st_geomfromgeojson function."
chi: "为st_geomfromgeojson函数指定了不正确的GeoJSON格式。"

# ER_GEOJSON_TOO_FEW_POINTS
source: "Incorrect GeoJSON format - too few points for linestring specified."
chi: "Geojson格式不正确 - Linestring指定的太少点。"

# ER_GEOJSON_NOT_CLOSED
source: "Incorrect GeoJSON format - polygon not closed."
chi: "Geojson格式不正确 - 多边形未关闭。"

# ER_JSON_PATH_EMPTY
source: "Path expression '$' is not allowed in argument %d to function '%s'."
chi: "path表达式'$'不允许在参数%d中允许运行'%s'。"

# ER_SLAVE_SAME_ID
source: "A slave with the same server_uuid/server_id as this slave has connected to the master"
chi: "与此从站相同的server_uuId / server_id的从站已连接到主设备"

# ER_FLASHBACK_NOT_SUPPORTED
source: "Flashback does not support %s %s"
chi: "闪回不支持%s%s"

# ER_KEYS_OUT_OF_ORDER
source: "Keys are out order during bulk load"
chi: "钥匙在散装负载期间出现订单"

# ER_OVERLAPPING_KEYS
source: "Bulk load rows overlap existing rows"
chi: "批量负载行重叠现有行"

# ER_REQUIRE_ROW_BINLOG_FORMAT
source: "Can't execute updates on master with binlog_format != ROW."
chi: "binlog_format != ROW时无法在master上执行更新"

# ER_ISOLATION_MODE_NOT_SUPPORTED
source: "MyRocks supports only READ COMMITTED and REPEATABLE READ isolation levels. Please change from current isolation level %s"
chi: "MyRocks仅支持读取承诺和可重复读取隔离级别。请从当前隔离级别的%s改变"

# ER_ON_DUPLICATE_DISABLED
source: "When unique checking is disabled in MyRocks, INSERT,UPDATE,LOAD statements with clauses that update or replace the key (i.e. INSERT ON DUPLICATE KEY UPDATE, REPLACE) are not allowed. Query: %s"
chi: "当在MyRocks禁用唯一检查时，INSERT，UPDATE, LOAD，使用Clauses更新或替换索引的子句（即，在重复的重复键更新，替换）中，不允许使用。查询：%s"

# ER_UPDATES_WITH_CONSISTENT_SNAPSHOT
source: "Can't execute updates when you started a transaction with START TRANSACTION WITH CONSISTENT [ROCKSDB] SNAPSHOT."
chi: "START TRANSACTION WITH CONSISTENT [ROCKSDB] SNAPSHOT时，无法执行更新。"

# ER_ROLLBACK_ONLY
source: "This transaction was rolled back and cannot be committed. Only supported operation is to roll it back, so all pending changes will be discarded. Please restart another transaction."
chi: "此交易回滚并无法承诺。只支持支持的操作是滚动，因此将丢弃所有待处理的更改。请重新启动其他事务。"

# ER_ROLLBACK_TO_SAVEPOINT
source: "MyRocks currently does not support ROLLBACK TO SAVEPOINT if modifying rows."
chi: "如果修改行，MyRocks目前不支持保存点的回滚。"

# ER_ISOLATION_LEVEL_WITH_CONSISTENT_SNAPSHOT
source: "Only REPEATABLE READ isolation level is supported for START TRANSACTION WITH CONSISTENT SNAPSHOT in RocksDB Storage Engine."
chi: "在RockSDB存储引擎中，START TRANSACTION WITH CONSISTENT SNAPSHOT 只支持REPEATABLE READ隔离"

# ER_UNSUPPORTED_COLLATION
source: "Unsupported collation on string indexed column %s.%s Use binary collation (%s)."
chi: "字符串索引列%s的不受支持的归类。%s使用二进制校构(%s)。"

# ER_METADATA_INCONSISTENCY
source: "Table '%s' does not exist, but metadata information exists inside MyRocks. This is a sign of data inconsistency. Please check if '%s.frm' exists, and try to restore it if it does not exist."
chi: "表'%s'不存在，但MyRocks内存存在元数据信息。这是数据不一致的标志。请检查是否存在'%s.frm'，并尝试恢复如果它不存在。"

# ER_CF_DIFFERENT
source: "Column family ('%s') flag (%d) is different from an existing flag (%d). Assign a new CF flag, or do not change existing CF flag."
chi: "列族（'%s'）标志（%d）与现有标志（%d）不同。分配新的CF标志，或者不要更改现有的CF标志。"

# ER_RDB_TTL_DURATION_FORMAT
source: "TTL duration (%s) in MyRocks must be an unsigned non-null 64-bit integer."
chi: "Myrocks中的TTL持续时间(%s)必须是无符号非空64位整数。"

# ER_RDB_STATUS_GENERAL
source: "Status error %d received from RocksDB: %s"
chi: "状态误差%d从RockSDB收到：%s"

# ER_RDB_STATUS_MSG
source: "%s, Status error %d received from RocksDB: %s"
chi: "%s，状态误差%d从rocksdb收到：%s"

# ER_RDB_TTL_UNSUPPORTED
source: "TTL support is currently disabled when table has a hidden PK."
chi: "当表有隐藏的PK时，目前禁用TTL支持。"

# ER_RDB_TTL_COL_FORMAT
source: "TTL column (%s) in MyRocks must be an unsigned non-null 64-bit integer, exist inside the table, and have an accompanying ttl duration."
chi: "Myrocks中的TTL列(%s)必须是一个无符号的非空64位整数，存在于表内，并具有伴随的TTL持续时间。"

# ER_PER_INDEX_CF_DEPRECATED
source: "The per-index column family option has been deprecated"
chi: "已弃用每个索引列族选项"

# ER_KEY_CREATE_DURING_ALTER
source: "MyRocks failed creating new key definitions during alter."
chi: "MyRocks在Alter期间创建新的索引定义失败。"

# ER_SK_POPULATE_DURING_ALTER
source: "MyRocks failed populating secondary key during alter."
chi: "MyRocks在Alter期间失败填充次要索引。"

# ER_SUM_FUNC_WITH_WINDOW_FUNC_AS_ARG
source: "Window functions can not be used as arguments to group functions."
chi: "窗口函数不能用作组函数的参数。"

# ER_NET_OK_PACKET_TOO_LARGE
source: "OK packet too large"
chi: "好的包太大了"

# ER_GEOJSON_EMPTY_COORDINATES
source: "Incorrect GeoJSON format - empty 'coordinates' array."
chi: "Geojson格式不正确 - 空的'coordinates'阵列。"

# ER_MYROCKS_CANT_NOPAD_COLLATION
source: "MyRocks doesn't currently support collations with \"No pad\" attribute."
chi: "MyRocks目前不支持与“No Pad \”属性的归类。"

# ER_ILLEGAL_PARAMETER_DATA_TYPES2_FOR_OPERATION
source: "Illegal parameter data types %s and %s for operation '%s'"
chi: "非法参数数据类型%s和%s为操作'%s'"

# ER_ILLEGAL_PARAMETER_DATA_TYPE_FOR_OPERATION
source: "Illegal parameter data type %s for operation '%s'"
chi: "非法参数数据类型%s用于操作'%s'"

# ER_WRONG_PARAMCOUNT_TO_CURSOR 42000
source: "Incorrect parameter count to cursor '%-.192s'"
chi: "对Cursor的参数计数不正确'%-.192s'"

# ER_UNKNOWN_STRUCTURED_VARIABLE
source: "Unknown structured system variable or ROW routine variable '%-.*s'"
chi: "未知的结构系统变量或行程变量'%-.*s'"

# ER_ROW_VARIABLE_DOES_NOT_HAVE_FIELD
source: "Row variable '%-.192s' does not have a field '%-.192s'"
chi: "行变量'%-.192s'没有字段'%-.192s'"

# ER_END_IDENTIFIER_DOES_NOT_MATCH
source: "END identifier '%-.192s' does not match '%-.192s'"
chi: "结束标识符'%-.192s'不匹配'%-.192s'"

# ER_SEQUENCE_RUN_OUT
source: "Sequence '%-.64s.%-.64s' has run out"
chi: "序列'%-.64s。%-.64s'已经用完了"

# ER_SEQUENCE_INVALID_DATA
source: "Sequence '%-.64s.%-.64s' has out of range value for options"
chi: "序列'%-.64s。%-.64s的值冲突"

# ER_SEQUENCE_INVALID_TABLE_STRUCTURE
source: "Sequence '%-.64s.%-.64s' table structure is invalid (%s)"
chi: "序列'%-.64s。%-.64s'表结构无效(%s)"

# ER_SEQUENCE_ACCESS_ERROR
source: "Sequence '%-.64s.%-.64s' access error"
chi: "序列'%-.64s。%-.64s的访问错误"

# ER_NOT_SEQUENCE 42S02
source: "'%-.64s.%-.64s' is not a SEQUENCE"
chi: "'%-.64s。%-.64s'不是序列"

# ER_NOT_SEQUENCE2 42S02
source: "'%-.192s' is not a SEQUENCE"
chi: "'%-.192s'不是序列"

# ER_UNKNOWN_SEQUENCES 42S02
source: "Unknown SEQUENCE: '%-.300s'"
chi: "未知序列：'%-.300s'"

# ER_UNKNOWN_VIEW 42S02
source: "Unknown VIEW: '%-.300s'"
chi: "未知视图：'%-.300s'"

# ER_WRONG_INSERT_INTO_SEQUENCE
source: "Wrong INSERT into a SEQUENCE. One can only do single table INSERT into a sequence object (like with mariadb-dump). If you want to change the SEQUENCE, use ALTER SEQUENCE instead."
chi: "错误插入序列。人们只能将单表插入到序列对象（与mariadb-dump）中进行。如果要更改序列，请使用更改序列。"

# ER_SP_STACK_TRACE
source: "At line %u in %s"
chi: "在%u中以%s"

# ER_PACKAGE_ROUTINE_IN_SPEC_NOT_DEFINED_IN_BODY
source: "Subroutine '%-.192s' is declared in the package specification but is not defined in the package body"
chi: "在包规范中声明子程序'%-.192s'，但未在包主体中定义"

# ER_PACKAGE_ROUTINE_FORWARD_DECLARATION_NOT_DEFINED
source: "Subroutine '%-.192s' has a forward declaration but is not defined"
chi: "子程序'%-.192s'具有前向声明但未定义"

# ER_COMPRESSED_COLUMN_USED_AS_KEY
source: "Compressed column '%-.192s' can't be used in key specification"
chi: "压缩列'%-.192s'不能用于索引规范"

# ER_UNKNOWN_COMPRESSION_METHOD
source: "Unknown compression method: %s"
chi: "未知压缩方法：%s"

# ER_WRONG_NUMBER_OF_VALUES_IN_TVC
source: "The used table value constructor has a different number of values"
chi: "使用的表值构造函数具有不同数量的值"

# ER_FIELD_REFERENCE_IN_TVC
source: "Field reference '%-.192s' can't be used in table value constructor"
chi: "字段参考'%-.192s'不能用于表值构造函数"

# ER_WRONG_TYPE_FOR_PERCENTILE_FUNC
source: "Numeric datatype is required for %s function"
chi: "%s函数需要数字数据类型"

# ER_ARGUMENT_NOT_CONSTANT
source: "Argument to the %s function is not a constant for a partition"
chi: "%s函数的参数不是分区的常量"

# ER_ARGUMENT_OUT_OF_RANGE
source: "Argument to the %s function does not belong to the range [0,1]"
chi: "%s函数的参数不属于范围[0,1]"

# ER_WRONG_TYPE_OF_ARGUMENT
source: "%s function only accepts arguments that can be converted to numerical types"
chi: "%s函数仅接受可以转换为数字类型的参数"

# ER_NOT_AGGREGATE_FUNCTION
source: "Aggregate specific instruction (FETCH GROUP NEXT ROW) used in a wrong context"
chi: "在错误的上下文中使用的聚合特定指令（fetch组下一行）"

# ER_INVALID_AGGREGATE_FUNCTION
source: "Aggregate specific instruction(FETCH GROUP NEXT ROW) missing from the aggregate function"
chi: "聚合函数丢失的聚合特定指令（fetch组下一行）"

# ER_INVALID_VALUE_TO_LIMIT
source: "Limit only accepts integer values"
chi: "限制仅接受整数值"

# ER_INVISIBLE_NOT_NULL_WITHOUT_DEFAULT
source: "Invisible column %`s must have a default value"
chi: "隐形列%`s必须具有默认值"

# ER_UPDATE_INFO_WITH_SYSTEM_VERSIONING
source: "Rows matched: %ld Changed: %ld Inserted: %ld Warnings: %ld"
chi: "匹配的行：%ld已更改：%ld插入：%ld警告：%ld"

# ER_VERS_FIELD_WRONG_TYPE
source: "%`s must be of type %s for system-versioned table %`s"
chi: "%`s必须为系统版本为表%s的类型%`s"

# ER_VERS_ENGINE_UNSUPPORTED
source: "Transaction-precise system versioning for %`s is not supported"
chi: "Transaction-Precise系统版本控制%`s不受支持"

# ER_UNUSED_23
source: "You should never see it"
chi: "你永远不应该看到它"

# ER_PARTITION_WRONG_TYPE
source: "Wrong partitioning type, expected type: %`s"
chi: "错误的分区类型，预期类型：%`s"

# WARN_VERS_PART_FULL
source: "Versioned table %`s.%`s: last HISTORY partition (%`s) is out of %s, need more HISTORY partitions"
chi: "版本化表%`s.%`s：partition%`s已满，添加更多历史分区(out of %s)"

# WARN_VERS_PARAMETERS
source: "Maybe missing parameters: %s"
chi: "也许缺少参数：%s"

# ER_VERS_DROP_PARTITION_INTERVAL
source: "Can only drop oldest partitions when rotating by INTERVAL"
chi: "只能在旋转间隔时丢弃最旧的分区"

# ER_UNUSED_25
source: "You should never see it"
chi: "你永远不应该看到它"

# WARN_VERS_PART_NON_HISTORICAL
source: "Partition %`s contains non-historical data"
chi: "分区%`s包含非历史数据"

# ER_VERS_ALTER_NOT_ALLOWED
source: "Not allowed for system-versioned %`s.%`s. Change @@system_versioning_alter_history to proceed with ALTER."
chi: "系统版本为%`s.%`s不允许。更改@@system_versioning_alter_history用ALTER。"

# ER_VERS_ALTER_ENGINE_PROHIBITED
source: "Not allowed for system-versioned %`s.%`s. Change to/from native system versioning engine is not supported."
chi: "不允许系统版本为%`s.%`s。不支持更改返回/来自本机系统版本传输引擎。"

# ER_VERS_RANGE_PROHIBITED
source: "SYSTEM_TIME range selector is not allowed"
chi: "不允许使用SYSTEM_TIME范围选择器"

# ER_CONFLICTING_FOR_SYSTEM_TIME
source: "Conflicting FOR SYSTEM_TIME clauses in WITH RECURSIVE"
chi: "与递归的System_time子句相冲突"

# ER_VERS_TABLE_MUST_HAVE_COLUMNS
source: "Table %`s must have at least one versioned column"
chi: "表%`s必须至少有一个版本后的列"

# ER_VERS_NOT_VERSIONED
source: "Table %`s is not system-versioned"
chi: "表%`s不是系统版本的"

# ER_MISSING
source: "Wrong parameters for %`s: missing '%s'"
chi: "%`s的错误参数：缺少'%s'"

# ER_VERS_PERIOD_COLUMNS
source: "PERIOD FOR SYSTEM_TIME must use columns %`s and %`s"
chi: "system_time的时期必须使用列%`s和%`s"

# ER_PART_WRONG_VALUE
source: "Wrong parameters for partitioned %`s: wrong value for '%s'"
chi: "用于分区%`s的错误参数：'%s'的错误值"

# ER_VERS_WRONG_PARTS
source: "Wrong partitions for %`s: must have at least one HISTORY and exactly one last CURRENT"
chi: "%`s的错误分区：必须至少有一个HISTORY，只能有一个CURRENT"

# ER_VERS_NO_TRX_ID
source: "TRX_ID %llu not found in `mysql.transaction_registry`"
chi: "TRX_ID%llu在`mysql.transaction_registry`中找不到"

# ER_VERS_ALTER_SYSTEM_FIELD
source: "Can not change system versioning field %`s"
chi: "无法更改系统版本配置字段%`s"

# ER_DROP_VERSIONING_SYSTEM_TIME_PARTITION
source: "Can not DROP SYSTEM VERSIONING for table %`s partitioned BY SYSTEM_TIME"
chi: "无法删除由SYSTEM_TIME分区的表%`s的系统版本"

# ER_VERS_DB_NOT_SUPPORTED
source: "System-versioned tables in the %`s database are not supported"
chi: "不支持%`s数据库中的系统版本化表"

# ER_VERS_TRT_IS_DISABLED
source: "Transaction registry is disabled"
chi: "事务注册表已禁用"

# ER_VERS_DUPLICATE_ROW_START_END
source: "Duplicate ROW %s column %`s"
chi: "重复行%s列%`s"

# ER_VERS_ALREADY_VERSIONED
source: "Table %`s is already system-versioned"
chi: "表%`s已经是系统版本的"

# ER_UNUSED_24
source: "You should never see it"
chi: "你永远不应该看到它"

# ER_VERS_NOT_SUPPORTED
source: "System-versioned tables do not support %s"
chi: "系统版本的表不支持%s"

# ER_VERS_TRX_PART_HISTORIC_ROW_NOT_SUPPORTED
source: "Transaction-precise system-versioned tables do not support partitioning by ROW START or ROW END"
chi: "事务 - 精确的系统 - 版本的表不支持按行开始或行末端分区"

# ER_INDEX_FILE_FULL
source: "The index file for table '%-.192s' is full"
chi: "表'%-.192s'的索引文件已满"

# ER_UPDATED_COLUMN_ONLY_ONCE
source: "The column %`s.%`s cannot be changed more than once in a single UPDATE statement"
chi: "列%`s.%`s在单个更新语句中不能更换一次"

# ER_EMPTY_ROW_IN_TVC
source: "Row with no elements is not allowed in table value constructor in this context"
chi: "在此上下文中，表值构造函数不允许在没有元素的行"

# ER_VERS_QUERY_IN_PARTITION
source: "SYSTEM_TIME partitions in table %`s does not support historical query"
chi: "表%`s的SYSTEM_TIME分区不支持历史查询"

# ER_KEY_DOESNT_SUPPORT
source: "%s index %`s does not support this operation"
chi: "%s索引%`s不支持此操作"

# ER_ALTER_OPERATION_TABLE_OPTIONS_NEED_REBUILD
source: "Changing table options requires the table to be rebuilt"
chi: "更改表选项需要将要重建的表格重建"

# ER_BACKUP_LOCK_IS_ACTIVE
source: "Can't execute the command as you have a BACKUP STAGE active"
chi: "由于您在运行BACKUP STAGE，无法执行命令"

# ER_BACKUP_NOT_RUNNING
source: "You must start backup with \"BACKUP STAGE START\""
chi: "您必须启动备份“备份阶段开始”"

# ER_BACKUP_WRONG_STAGE
source: "Backup stage '%s' is same or before current backup stage '%s'"
chi: "备份阶段'%s'相同或在当前备份阶段'%s'之前"

# ER_BACKUP_STAGE_FAILED
source: "Backup stage '%s' failed"
chi: "备份阶段'%s'失败"

# ER_BACKUP_UNKNOWN_STAGE
source: "Unknown backup stage: '%s'. Stage should be one of START, FLUSH, BLOCK_DDL, BLOCK_COMMIT or END"
chi: "未知备份阶段：'%s'。阶段应该是START，FLUSH，BLOCK_DDL，BLOCK_COMIT或END之一"

# ER_USER_IS_BLOCKED
source: "User is blocked because of too many credential errors; unblock with 'FLUSH PRIVILEGES'"
chi: "由于凭证错误太多，用户被阻止;用'FLUSH PRIVILEGES'解锁"

# ER_ACCOUNT_HAS_BEEN_LOCKED
source: "Access denied, this account is locked"
chi: "访问拒绝，此帐户已锁定"

# ER_PERIOD_TEMPORARY_NOT_ALLOWED
source: "Application-time period table cannot be temporary"
chi: "应用程序时间段表不能临时"

# ER_PERIOD_TYPES_MISMATCH
source: "Fields of PERIOD FOR %`s have different types"
chi: "%`s的期间的字段有不同的类型"

# ER_MORE_THAN_ONE_PERIOD
source: "Cannot specify more than one application-time period"
chi: "无法指定多个应用程序时间段"

# ER_PERIOD_FIELD_WRONG_ATTRIBUTES
source: "Period field %`s cannot be %s"
chi: "期间字段%`s不能是%s"

# ER_PERIOD_NOT_FOUND
source: "Period %`s is not found in table"
chi: "期间%`s未在表中找到"

# ER_PERIOD_COLUMNS_UPDATED
source: "Column %`s used in period %`s specified in update SET list"
chi: "列%`s在更新集列表中指定的周期%`s中使用"

# ER_PERIOD_CONSTRAINT_DROP
source: "Can't DROP CONSTRAINT `%s`. Use DROP PERIOD `%s` for this"
chi: "无法DROP CONSTRAINT `%s`。使用DROP PERIOD `%s`"

# ER_TOO_LONG_KEYPART 42000 S1009
source: "Specified key part was too long; max key part length is %u bytes"
chi: "指定的索引部分太长；最大索引部分长度为 %u 个字节"
