Repository: vladbogo/test-translation
Catalog: chi.xlf
Languages: chi

# ER_WRONG_PARAMETERS_TO_NATIVE_FCT 42000
source: "Incorrect parameters in the call to native function '%-.192s'"
chi: "对本机函数'%-.192s'呼叫中的参数不正确"

# ER_WRONG_PARAMETERS_TO_STORED_FCT 42000
source: "Incorrect parameters in the call to stored function '%-.192s'"
chi: "呼叫中的参数不正确为存储函数'%-.192s'"

# ER_NATIVE_FCT_NAME_COLLISION
source: "This function '%-.192s' has the same name as a native function"
chi: "此功能'%-.192s'具有与本机函数相同的名称"

# ER_DUP_ENTRY_WITH_KEY_NAME 23000 S1009
source: "Duplicate entry '%-.64T' for key '%-.192s'"
chi: "重复条目'%-.64T'键'%-.192s'"

# ER_BINLOG_PURGE_EMFILE
source: "Too many files opened, please execute the command again"
chi: "打开太多文件，请再次执行命令"

# ER_EVENT_CANNOT_CREATE_IN_THE_PAST
source: "Event execution time is in the past and ON COMPLETION NOT PRESERVE is set. The event was dropped immediately after creation"
chi: "事件执行时间在过去，并ON COMPLETION NOT PRESERVE。创建后，事件立即丢弃"

# ER_EVENT_CANNOT_ALTER_IN_THE_PAST
source: "Event execution time is in the past and ON COMPLETION NOT PRESERVE is set. The event was not changed. Specify a time in the future"
chi: "事件执行时间在过去，并ON COMPLETION NOT PRESERVE。事件没有改变。指定将来的时间"

# ER_SLAVE_INCIDENT
source: "The incident %s occurred on the master. Message: %-.64s"
chi: "事件%s发生在master上。消息：%-.64s"

# ER_NO_PARTITION_FOR_GIVEN_VALUE_SILENT
source: "Table has no partition for some existing values"
chi: "表对某些现有值没有分区"

# ER_BINLOG_UNSAFE_STATEMENT
source: "Unsafe statement written to the binary log using statement format since BINLOG_FORMAT = STATEMENT. %s"
chi: "自从BINLOG_FORMAT =STATEMENT以来，使用语句格式写入二进制日志的不安全语句。%s."

# ER_SLAVE_FATAL_ERROR
source: "Fatal error: %s"
chi: "致命错误：%s"

# ER_SLAVE_RELAY_LOG_READ_FAILURE
source: "Relay log read failure: %s"
chi: "relay日志读取失败：%s"

# ER_SLAVE_RELAY_LOG_WRITE_FAILURE
source: "Relay log write failure: %s"
chi: "relay日志写入失败：%s"

# ER_SLAVE_CREATE_EVENT_FAILURE
source: "Failed to create %s"
chi: "无法创建%s"

# ER_SLAVE_MASTER_COM_FAILURE
source: "Master command %s failed: %s"
chi: "Master命令%s失败：%s"

# ER_BINLOG_LOGGING_IMPOSSIBLE
source: "Binary logging not possible. Message: %s"
chi: "二进制记录不可能。消息：%s"

# ER_VIEW_NO_CREATION_CTX
source: "View %`s.%`s has no creation context"
chi: "View%`s.%`s没有创建上下文"

# ER_VIEW_INVALID_CREATION_CTX
source: "Creation context of view %`s.%`s is invalid"
chi: "Creation View%`s.%`s的上下文无效"

# ER_SR_INVALID_CREATION_CTX
source: "Creation context of stored routine %`s.%`s is invalid"
chi: "存储例程%`s.%`s的创建上下文无效"

# ER_TRG_CORRUPTED_FILE
source: "Corrupted TRG file for table %`s.%`s"
chi: "表的trg文件损坏了。%`s.%`s"

# ER_TRG_NO_CREATION_CTX
source: "Triggers for table %`s.%`s have no creation context"
chi: "表%`s.%`s的触发器没有创建上下文"

# ER_TRG_INVALID_CREATION_CTX
source: "Trigger creation context of table %`s.%`s is invalid"
chi: "触发表%`s.%`s的创建上下文无效"

# ER_EVENT_INVALID_CREATION_CTX
source: "Creation context of event %`s.%`s is invalid"
chi: "事件%`s.%`s的创建上下文无效"

# ER_TRG_CANT_OPEN_TABLE
source: "Cannot open table for trigger %`s.%`s"
chi: "无法打开触发%`s.%`s的表"

# ER_CANT_CREATE_SROUTINE
source: "Cannot create stored routine %`s. Check warnings"
chi: "无法创建存储过程%`s。检查警告"

# ER_UNUSED_11
source: "You should never see it"
chi: "你永远不应该看到它"

# ER_NO_FORMAT_DESCRIPTION_EVENT_BEFORE_BINLOG_STATEMENT
source: "The BINLOG statement of type %s was not preceded by a format description BINLOG statement"
chi: "类型%s的Binlog语句未在格式描述binlog语句之前"

# ER_SLAVE_CORRUPT_EVENT
source: "Corrupted replication event was detected"
chi: "检测到损坏的复制事件"

# ER_LOAD_DATA_INVALID_COLUMN
source: "Invalid column reference (%-.64s) in LOAD DATA"
chi: "LOAD DATA中的列引用（%-.64s）无效"

# ER_LOG_PURGE_NO_FILE
source: "Being purged log %s was not found"
chi: "未找到清除的log%s"

# ER_XA_RBTIMEOUT XA106
source: "XA_RBTIMEOUT: Transaction branch was rolled back: took too long"
chi: "XA_RBTIMEOUT：交易分支回滚：花了太久了"

# ER_XA_RBDEADLOCK XA102
source: "XA_RBDEADLOCK: Transaction branch was rolled back: deadlock was detected"
chi: "XA_RBDEADLOCK：交易分支回滚：检测到死锁"

# ER_NEED_REPREPARE
source: "Prepared statement needs to be re-prepared"
chi: "prepared statement需要重新准备"

# ER_DELAYED_NOT_SUPPORTED
source: "DELAYED option not supported for table '%-.192s'"
chi: "表'%-.192s'不支持延迟选项"

# ER_PLUGIN_DELETE_BUILTIN
source: "Built-in plugins cannot be deleted"
chi: "内置插件无法删除"

# WARN_PLUGIN_BUSY
source: "Plugin is busy and will be uninstalled on shutdown"
chi: "插件很忙，将在关机时卸载"

# ER_VARIABLE_IS_READONLY
source: "%s variable '%s' is read-only. Use SET %s to assign the value"
chi: "%s变量'%s'是只读的。使用set%s付值"

# ER_WARN_ENGINE_TRANSACTION_ROLLBACK
source: "Storage engine %s does not support rollback for this statement. Transaction rolled back and must be restarted"
chi: "存储引擎%s不支持此语句的回滚。交易回滚并必须重新启动"

# ER_SLAVE_HEARTBEAT_FAILURE
source: "Unexpected master's heartbeat data: %s"
chi: "意外的master心跳数据：%s"

# ER_SLAVE_HEARTBEAT_VALUE_OUT_OF_RANGE
source: "The requested value for the heartbeat period is either negative or exceeds the maximum allowed (%u seconds)"
chi: "心跳周期的请求值是负的或超过允许的最大值（%u秒）"

# ER_UNUSED_14
source: "You should never see it"
chi: "你永远不应该看到它"

# ER_CONFLICT_FN_PARSE_ERROR
source: "Error in parsing conflict function. Message: %-.64s"
chi: "解析冲突功能时出错。消息：%-.64s"

# ER_EXCEPTIONS_WRITE_ERROR
source: "Write to exceptions table failed. Message: %-.128s""
chi: "写入异常表失败。消息：%-.128s"

# ER_TOO_LONG_TABLE_COMMENT
source: "Comment for table '%-.64s' is too long (max = %u)"
chi: "表格备注'%-.64s'太长（max =%u）"

# ER_TOO_LONG_FIELD_COMMENT
source: "Comment for field '%-.64s' is too long (max = %u)"
chi: "字段'%-.64s'太长（max =%u）"

# ER_FUNC_INEXISTENT_NAME_COLLISION 42000
source: "FUNCTION %s does not exist. Check the 'Function Name Parsing and Resolution' section in the Reference Manual"
chi: "FUNCTION %s不存在。在参考手册中查看“函数名称解析”部分"

# ER_DATABASE_NAME
source: "Database"
chi: "数据库"

# ER_TABLE_NAME
source: "Table"
chi: "表"

# ER_PARTITION_NAME
source: "Partition"
chi: "分区"

# ER_SUBPARTITION_NAME
source: "Subpartition"
chi: "下分区"

# ER_TEMPORARY_NAME
source: "Temporary"
chi: "暂时的"

# ER_RENAMED_NAME
source: "Renamed"
chi: "重命名"

# ER_TOO_MANY_CONCURRENT_TRXS
source: "Too many active concurrent transactions"
chi: "“太多并发交易"

# WARN_NON_ASCII_SEPARATOR_NOT_IMPLEMENTED
source: "Non-ASCII separator arguments are not fully supported"
chi: "非ASCII分隔符参数不完全支持"

# ER_DEBUG_SYNC_TIMEOUT
source: "debug sync point wait timed out"
chi: "调试同步点等待超时"

# ER_DEBUG_SYNC_HIT_LIMIT
source: "debug sync point hit limit reached"
chi: "调试同步点限制达到"

# ER_DUP_SIGNAL_SET 42000
source: "Duplicate condition information item '%s'"
chi: "重复条件信息项'%s'"

# ER_SIGNAL_WARN 01000
source: "Unhandled user-defined warning condition"
chi: "未处理用户定义的警告条件"

# ER_SIGNAL_NOT_FOUND 02000
source: "Unhandled user-defined not found condition"
chi: "未找到的用户定义未找到条件"

# ER_SIGNAL_EXCEPTION HY000
source: "Unhandled user-defined exception condition"
chi: "未处理用户定义的异常条件"

# ER_RESIGNAL_WITHOUT_ACTIVE_HANDLER 0K000
source: "RESIGNAL when handler not active"
chi: "RESIGNAL处理程序不活跃"

# ER_SIGNAL_BAD_CONDITION_TYPE
source: "SIGNAL/RESIGNAL can only use a CONDITION defined with SQLSTATE"
chi: "SIGNAL/RESIGNAL只能使用SQLState定义的条件"

# WARN_COND_ITEM_TRUNCATED
source: "Data truncated for condition item '%s'"
chi: "数据被截断为条件项目'%s'"

# ER_COND_ITEM_TOO_LONG
source: "Data too long for condition item '%s'"
chi: "条件项目'%s'的数据太长"

# ER_UNKNOWN_LOCALE
source: "Unknown locale: '%-.64s'"
chi: "未知区域设置：'%-.64s'"

# ER_SLAVE_IGNORE_SERVER_IDS
source: "The requested server id %d clashes with the slave startup option --replicate-same-server-id"
chi: "请求的服务器ID%d与SLAVE启动选项--replicate-same-server-id冲突"

# ER_QUERY_CACHE_DISABLED
source: "Query cache is disabled; set query_cache_type to ON or DEMAND to enable it"
chi: "查询缓存已禁用;将query_cache_type设置为ON或DEMAND启用它"

# ER_SAME_NAME_PARTITION_FIELD
source: "Duplicate partition field name '%-.192s'"
chi: "重复分区字段名称'%-.192s'"

# ER_PARTITION_COLUMN_LIST_ERROR
source: "Inconsistency in usage of column lists for partitioning"
chi: "分区用的列和列表使用不一致"

# ER_WRONG_TYPE_COLUMN_VALUE_ERROR
source: "Partition column values of incorrect type"
chi: "不正确类型的分区列值"

# ER_TOO_MANY_PARTITION_FUNC_FIELDS_ERROR
source: "Too many fields in '%-.192s'"
chi: "'%-.192s'中的太多字段"

# ER_MAXVALUE_IN_VALUES_IN
source: "Cannot use MAXVALUE as value in VALUES IN"
chi: "不能在VALUES IN使用MAXVALUE"

# ER_TOO_MANY_VALUES_ERROR
source: "Cannot have more than one value for this type of %-.64s partitioning"
chi: "这种类型不能有多个值%-.64s 分区"

# ER_ROW_SINGLE_PARTITION_FIELD_ERROR
source: "Row expressions in VALUES IN only allowed for multi-field column partitioning"
chi: "仅允许的多字段列分区的VALUES IN的行表达式"

# ER_FIELD_TYPE_NOT_ALLOWED_AS_PARTITION_FIELD
source: "Field '%-.192s' is of a not allowed type for this type of partitioning"
chi: "字段'%-.192s'类型不允许为此类型的分区类型"

# ER_PARTITION_FIELDS_TOO_LONG
source: "The total length of the partitioning fields is too large"
chi: "分区字段的总长度太大"

# ER_BINLOG_ROW_ENGINE_AND_STMT_ENGINE
source: "Cannot execute statement: impossible to write to binary log since both row-incapable engines and statement-incapable engines are involved"
chi: "无法执行语句：由于引擎不能支持行和语句，因此无法写入二进制日志"

# ER_BINLOG_ROW_MODE_AND_STMT_ENGINE
source: "Cannot execute statement: impossible to write to binary log since BINLOG_FORMAT = ROW and at least one table uses a storage engine limited to statement-based logging"
chi: "无法执行语句：由于BINLOG_FORMAT =ROW和至少一个表使用存储引擎限制为基于语句的日志记录，因此无法写入二进制日志"

# ER_BINLOG_UNSAFE_AND_STMT_ENGINE
source: "Cannot execute statement: impossible to write to binary log since statement is unsafe, storage engine is limited to statement-based logging, and BINLOG_FORMAT = MIXED. %s"
chi: "无法执行语句：由于语句不安全，无法写入二进制日志，存储引擎仅限于基于语句的日志记录，而BINLOG_FORMAT = MIXED。%s."

# ER_BINLOG_ROW_INJECTION_AND_STMT_ENGINE
source: "Cannot execute statement: impossible to write to binary log since statement is in row format and at least one table uses a storage engine limited to statement-based logging"
chi: "无法执行语句：由于语句以行格式，至少一个表使用基于语句的日志记录的存储引擎，因此无法写入二进制日志。"

# ER_BINLOG_STMT_MODE_AND_ROW_ENGINE
source: "Cannot execute statement: impossible to write to binary log since BINLOG_FORMAT = STATEMENT and at least one table uses a storage engine limited to row-based logging.%s"
chi: "无法执行语句：由于BINLOG_FORMAT = STATEMENT，并且至少一个表使用存储引擎限制为基于行的日志记录，因此无法写入二进制日志。%s"

# ER_BINLOG_ROW_INJECTION_AND_STMT_MODE
source: "Cannot execute statement: impossible to write to binary log since statement is in row format and BINLOG_FORMAT = STATEMENT"
chi: "无法执行语句：由于语句的正常格式和BINLOG_FORMAT = STATEMENT，因此无法写入二进制日志"

# ER_BINLOG_MULTIPLE_ENGINES_AND_SELF_LOGGING_ENGINE
source: "Cannot execute statement: impossible to write to binary log since more than one engine is involved and at least one engine is self-logging"
chi: "无法执行语句：由于涉及多个引擎并且至少有一个引擎是自记录的，因此无法写入二进制日志。"

# ER_BINLOG_UNSAFE_LIMIT
source: "The statement is unsafe because it uses a LIMIT clause. This is unsafe because the set of rows included cannot be predicted"
chi: "该语句不安全，因为它使用限制子句。这不安全，因为所包含的一组行无法预测"

# ER_BINLOG_UNSAFE_INSERT_DELAYED
source: "The statement is unsafe because it uses INSERT DELAYED. This is unsafe because the times when rows are inserted cannot be predicted"
chi: "该声明不安全，因为它使用插入延迟。这是不安全的，因为无法预测插入行的时间"

# ER_BINLOG_UNSAFE_SYSTEM_TABLE
source: "The statement is unsafe because it uses the general log, slow query log, or performance_schema table(s). This is unsafe because system tables may differ on slaves"
chi: "该声明不安全，因为它使用常规日志，慢查询日志或performance_schema表。这是不安全的，因为系统表可能在slave上不同"

# ER_BINLOG_UNSAFE_AUTOINC_COLUMNS
source: "Statement is unsafe because it invokes a trigger or a stored function that inserts into an AUTO_INCREMENT column. Inserted values cannot be logged correctly"
chi: "语句不安全，因为它调用了插入AUTO_INCREMENT列的触发器或存储函数。插入的值无法正确记录"

# ER_BINLOG_UNSAFE_UDF
source: "Statement is unsafe because it uses a UDF which may not return the same value on the slave"
chi: "语句不安全，因为它使用了一个可能在从设备上返回相同值的UDF"

# ER_BINLOG_UNSAFE_SYSTEM_VARIABLE
source: "Statement is unsafe because it uses a system variable that may have a different value on the slave"
chi: "语句不安全，因为它使用的系统变量可能在从站上具有不同的值"

# ER_BINLOG_UNSAFE_SYSTEM_FUNCTION
source: "Statement is unsafe because it uses a system function that may return a different value on the slave"
chi: "语句不安全，因为它使用系统函数可能在从站上返回不同的值"

# ER_BINLOG_UNSAFE_NONTRANS_AFTER_TRANS
source: "Statement is unsafe because it accesses a non-transactional table after accessing a transactional table within the same transaction"
chi: "语句不安全，因为它在访问同一事务中访问事务表后访问非事务性表"

# ER_MESSAGE_AND_STATEMENT
source: "%s Statement: %s"
chi: "%s语句：%s"

# ER_SLAVE_CONVERSION_FAILED
source: "Column %d of table '%-.192s.%-.192s' cannot be converted from type '%-.50s' to type '%-.50s'"
chi: "列%d表'%-.192s.%-.192s'无法从'%-.50s'类型为'%-.50s'"

# ER_SLAVE_CANT_CREATE_CONVERSION
source: "Can't create conversion table for table '%-.192s.%-.192s'"
chi: "无法为表创建转换表'%-.192s.%-.192s'"

# ER_INSIDE_TRANSACTION_PREVENTS_SWITCH_BINLOG_FORMAT
source: "Cannot modify @@session.binlog_format inside a transaction"
chi: "无法在事务中修改@@session.binlog_format"

# ER_PATH_LENGTH
source: "The path specified for %.64T is too long"
chi: "指定%.64T的路径太长了"

# ER_WARN_DEPRECATED_SYNTAX_NO_REPLACEMENT
source: "'%s' is deprecated and will be removed in a future release"
chi: "'%s'被弃用，将在将来的版本中删除"

# ER_WRONG_NATIVE_TABLE_STRUCTURE
source: "Native table '%-.64s'.'%-.64s' has the wrong structure"
chi: "本机表'%-.64s'。'%-.64s'具有错误的结构"

# ER_WRONG_PERFSCHEMA_USAGE
source: "Invalid performance_schema usage"
chi: "performance_schema使用无效"

# ER_WARN_I_S_SKIPPED_TABLE
source: "Table '%s'.'%s' was skipped since its definition is being modified by concurrent DDL statement"
chi: "表'%s'.'%s'由于并发DDL语句正在修改其定义，因此跳过"

# ER_INSIDE_TRANSACTION_PREVENTS_SWITCH_BINLOG_DIRECT
source: "Cannot modify @@session.binlog_direct_non_transactional_updates inside a transaction"
chi: "无法在交易事务中修改@@session.binlog_direct_non_transactional_updates"

# ER_STORED_FUNCTION_PREVENTS_SWITCH_BINLOG_DIRECT
source: "Cannot change the binlog direct flag inside a stored function or trigger"
chi: "无法在存储的函数或触发器内更改Binlog Direct标志"

# ER_SPATIAL_MUST_HAVE_GEOM_COL 42000
source: "A SPATIAL index may only contain a geometrical type column"
chi: "空间索引可以仅包含几何类型列"

# ER_TOO_LONG_INDEX_COMMENT
source: "Comment for index '%-.64s' is too long (max = %lu)"
chi: "索引评论'%-.64s'太长（max =%lu）"

# ER_LOCK_ABORTED
source: "Wait on a lock was aborted due to a pending exclusive lock"
chi: "由于待处理的独家锁，等待锁被中止"

# ER_DATA_OUT_OF_RANGE 22003
source: "%s value is out of range in '%s'"
chi: "%s值超出'%s'范围"

# ER_WRONG_SPVAR_TYPE_IN_LIMIT
source: "A variable of a non-integer based type in LIMIT clause"
chi: "基于非整数类型的基于LIMIT子句的变量"

# ER_BINLOG_UNSAFE_MULTIPLE_ENGINES_AND_SELF_LOGGING_ENGINE
source: "Mixing self-logging and non-self-logging engines in a statement is unsafe"
chi: "混合声明中的自记录和非自动记录引擎是不安全的"

# ER_BINLOG_UNSAFE_MIXED_STATEMENT
source: "Statement accesses nontransactional table as well as transactional or temporary table, and writes to any of them"
chi: "语句访问非致突变表以及事务性或临时表，并写入其中任何一个"

# ER_INSIDE_TRANSACTION_PREVENTS_SWITCH_SQL_LOG_BIN
source: "Cannot modify @@session.sql_log_bin inside a transaction"
chi: "无法修改事务中的@@sessient.sql_log_bin"

# ER_STORED_FUNCTION_PREVENTS_SWITCH_SQL_LOG_BIN
source: "Cannot change the sql_log_bin inside a stored function or trigger"
chi: "无法在存储的函数或触发器内更改SQL_LOG_BIN"

# ER_FAILED_READ_FROM_PAR_FILE
source: "Failed to read from the .par file"
chi: "无法从.par文件中读取"

# ER_VALUES_IS_NOT_INT_TYPE_ERROR
source: "VALUES value for partition '%-.64s' must have type INT"
chi: "分区的值'%-.64s'必须具有类型INT"

# ER_ACCESS_DENIED_NO_PASSWORD_ERROR 28000
source: "Access denied for user '%s'@'%s'"
chi: "拒绝用户'%s'@'%s'"

# ER_SET_PASSWORD_AUTH_PLUGIN
source: "SET PASSWORD is ignored for users authenticating via %s plugin"
chi: "通过%s插件验证的用户忽略SET PASSWORD"

# ER_GRANT_PLUGIN_USER_EXISTS
source: "GRANT with IDENTIFIED WITH is illegal because the user %-.*s already exists"
chi: "由于用户%-.*s已经存在，GRANT IDENTIFIED WITH授权是非法的"

# ER_TRUNCATE_ILLEGAL_FK 42000
source: "Cannot truncate a table referenced in a foreign key constraint (%.192s)"
chi: "无法截断外键约束中引用的表（%.192s）"

# ER_PLUGIN_IS_PERMANENT
source: "Plugin '%s' is force_plus_permanent and can not be unloaded"
chi: "插件'%s'是force_plus_permanent，无法卸载"

# ER_SLAVE_HEARTBEAT_VALUE_OUT_OF_RANGE_MIN
source: "The requested value for the heartbeat period is less than 1 millisecond. The value is reset to 0, meaning that heartbeating will effectively be disabled"
chi: "心跳期的要求值小于1毫秒。该值重置为0，这意味着心跳将有效地禁用"

# ER_SLAVE_HEARTBEAT_VALUE_OUT_OF_RANGE_MAX
source: "The requested value for the heartbeat period exceeds the value of `slave_net_timeout' seconds. A sensible value for the period should be less than the timeout"
chi: "心跳期的请求值超出了“slave_net_timeout”秒的值。该期间的明智价值应小于超时"

# ER_STMT_CACHE_FULL
source: "Multi-row statements required more than 'max_binlog_stmt_cache_size' bytes of storage."
chi: "需要多行语句超过“max_binlog_stmt_cache_size”字节的存储;增加这个mariadbd变量，然后重试"

# ER_MULTI_UPDATE_KEY_CONFLICT
source: "Primary key/partition key update is not allowed since the table is updated both as '%-.192s' and '%-.192s'"
chi: "由于表格被更新为'%-.192s'和'%-.192s'，因此不允许允许主键/分区索引更新。"

# ER_TABLE_NEEDS_REBUILD
source: "Table rebuild required. Please do \"ALTER TABLE %`s FORCE\" or dump/reload to fix it!"
chi: "表需重建。请做ALTER TABLE %`s FORCE”或转储/重新加载以修复它！"

# WARN_OPTION_BELOW_LIMIT
source: "The value of '%s' should be no less than the value of '%s'"
chi: "'%s'的值应该不小于'%s'的值"

# ER_INDEX_COLUMN_TOO_LONG
source: "Index column size too large. The maximum column size is %lu bytes"
chi: "索引列太大。最大列大小为%lu字节"

# ER_ERROR_IN_TRIGGER_BODY
source: "Trigger '%-.64s' has an error in its body: '%-.256s'"
chi: "触发器'%-.64s'内存在错误：'%-.256s'"

# ER_ERROR_IN_UNKNOWN_TRIGGER_BODY
source: "Unknown trigger has an error in its body: '%-.256s'"
chi: "未知触发器内存在错误：'%-.256s'"

# ER_INDEX_CORRUPT
source: "Index %s is corrupted"
chi: "索引%s已损坏"

# ER_UNDO_RECORD_TOO_BIG
source: "Undo log record is too big"
chi: "撤消日志记录太大"

# ER_BINLOG_UNSAFE_INSERT_IGNORE_SELECT
source: "INSERT IGNORE... SELECT is unsafe because the order in which rows are retrieved by the SELECT determines which (if any) rows are ignored. This order cannot be predicted and may differ on master and the slave"
chi: "INSERT IGNORE...SELECT不安全，因为选择由select检索行的顺序确定哪个（如果有）行被忽略。无法预测此顺序，并且在master和slave方面可能有所不同"

# ER_BINLOG_UNSAFE_INSERT_SELECT_UPDATE
source: "INSERT... SELECT... ON DUPLICATE KEY UPDATE is unsafe because the order in which rows are retrieved by the SELECT determines which (if any) rows are updated. This order cannot be predicted and may differ on master and the slave"
chi: "INSERT... SELECT... ON DUPLICATE KEY UPDATE是不安全的，因为SELECT检索行的顺序确定哪个（如果有的话）是更新的。无法预测此顺序，并且在master和slave方面可能有所不同"

# ER_BINLOG_UNSAFE_REPLACE_SELECT
source: "REPLACE... SELECT is unsafe because the order in which rows are retrieved by the SELECT determines which (if any) rows are replaced. This order cannot be predicted and may differ on master and the slave"
chi: "REPLACE... SELECT 不安全，因为选择由select检索行的顺序确定哪个（如果有）行被替换。无法预测此顺序，并且在master和slave方面可能有所不同"

# ER_BINLOG_UNSAFE_CREATE_IGNORE_SELECT
source: "CREATE... IGNORE SELECT is unsafe because the order in which rows are retrieved by the SELECT determines which (if any) rows are ignored. This order cannot be predicted and may differ on master and the slave"
chi: "CREATE... IGNORE SELECT是不安全，因为选择由SELECT检索行的顺序确定哪个（如果有）行被忽略。无法预测此顺序，并且在master和slave方面可能有所不同"

# ER_BINLOG_UNSAFE_CREATE_REPLACE_SELECT
source: "CREATE... REPLACE SELECT is unsafe because the order in which rows are retrieved by the SELECT determines which (if any) rows are replaced. This order cannot be predicted and may differ on master and the slave"
chi: "CREATE... REPLACE SELECT不安全，因为选择由SELECT检索行的顺序确定哪个（如果有）是替换哪个（如果有的话）。无法预测此顺序，并且在master和slave方面可能有所不同"

# ER_BINLOG_UNSAFE_UPDATE_IGNORE
source: "UPDATE IGNORE is unsafe because the order in which rows are updated determines which (if any) rows are ignored. This order cannot be predicted and may differ on master and the slave"
chi: "UPDATE IGNORE不安全，因为更新行的顺序确定了哪个（如果有）行被忽略。无法预测此顺序，并且在master和slave方面可能有所不同"

# ER_UNUSED_15
source: "You should never see it"
chi: "你永远不应该看到它"

# ER_UNUSED_16
source: "You should never see it"
chi: "你永远不应该看到它"

# ER_BINLOG_UNSAFE_WRITE_AUTOINC_SELECT
source: "Statements writing to a table with an auto-increment column after selecting from another table are unsafe because the order in which rows are retrieved determines what (if any) rows will be written. This order cannot be predicted and may differ on master and the slave"
chi: "从另一个表选择后，使用自动增量列的表格写入的语句是不安全的，因为检索行的顺序确定将写入哪些（如果有）行。无法预测此顺序，并且在主站和slave方面可能有所不同"

# ER_BINLOG_UNSAFE_CREATE_SELECT_AUTOINC
source: "CREATE TABLE... SELECT... on a table with an auto-increment column is unsafe because the order in which rows are retrieved by the SELECT determines which (if any) rows are inserted. This order cannot be predicted and may differ on master and the slave"
chi: "创建表...在具有自动增量列的表上选择...不安全，因为选择的顺序是由select检索行的顺序，确定插入哪个（如果有）行。无法预测此订单，并且在主站和slave方面可能有所不同"

# ER_BINLOG_UNSAFE_INSERT_TWO_KEYS
source: "INSERT... ON DUPLICATE KEY UPDATE on a table with more than one UNIQUE KEY is unsafe"
chi: "在具有多个唯一键的表上INSERT... ON DUPLICATE KEY UPDATE的重复索引更新是不安全的"

# ER_UNUSED_28
source: "You should never see it"
chi: "你永远不应该看到它"

# ER_VERS_NOT_ALLOWED
source: "Not allowed for system-versioned table %`s.%`s"
chi: "系统版本的表%`s.%`s不允许"

# ER_BINLOG_UNSAFE_AUTOINC_NOT_FIRST
source: "INSERT into autoincrement field which is not the first part in the composed primary key is unsafe"
chi: "插入AutoIncrement字段，该字段不是组成的主键中的第一部分是不安全的"

# ER_CANNOT_LOAD_FROM_TABLE_V2
source: "Cannot load from %s.%s. The table is probably corrupted"
chi: "不能从加载%s.%s。表可能损坏了"

# ER_MASTER_DELAY_VALUE_OUT_OF_RANGE
source: "The requested value %lu for the master delay exceeds the maximum %lu"
chi: "主延迟的所需值%lu超过最大%lu"

# ER_ONLY_FD_AND_RBR_EVENTS_ALLOWED_IN_BINLOG_STATEMENT
source: "Only Format_description_log_event and row events are allowed in BINLOG statements (but %s was provided)"
chi: "在Binlog语句中只允许Format_Description_Log_Event和行事件（但是提供了%s）"

# ER_PARTITION_EXCHANGE_DIFFERENT_OPTION
source: "Non matching attribute '%-.64s' between partition and table"
chi: "分区和表之间的非匹配属性'%-.64s'"

# ER_PARTITION_EXCHANGE_PART_TABLE
source: "Table to exchange with partition is partitioned: '%-.64s'"
chi: "用分区交换的表是分区：'%-.64s'"

# ER_PARTITION_EXCHANGE_TEMP_TABLE
source: "Table to exchange with partition is temporary: '%-.64s'"
chi: "与分区交换的表是临时的：'%-.64s'"

# ER_PARTITION_INSTEAD_OF_SUBPARTITION
source: "Subpartitioned table, use subpartition instead of partition"
chi: "子分区表，使用子分区代替分区"

# ER_UNKNOWN_PARTITION
source: "Unknown partition '%-.64s' in table '%-.64s'"
chi: "未知分区'%-.64s'在表'%-.64s'"

# ER_TABLES_DIFFERENT_METADATA
source: "Tables have different definitions"
chi: "表有不同的定义"

# ER_ROW_DOES_NOT_MATCH_PARTITION
source: "Found a row that does not match the partition"
chi: "找到了与分区不匹配的行"

# ER_BINLOG_CACHE_SIZE_GREATER_THAN_MAX
source: "Option binlog_cache_size (%lu) is greater than max_binlog_cache_size (%lu); setting binlog_cache_size equal to max_binlog_cache_size"
chi: "选项binlog_cache_size（%lu）大于max_binlog_cache_size（%lu）;设置binlog_cache_size等于max_binlog_cache_size"

# ER_WARN_INDEX_NOT_APPLICABLE
source: "Cannot use %-.64s access on index '%-.64s' due to type or collation conversion on field '%-.64s'"
chi: "不能使用%-.64s在索引'%-.64s'上的访问，由于字段'%-.64s”的类型或排序规则转换"

# ER_PARTITION_EXCHANGE_FOREIGN_KEY
source: "Table to exchange with partition has foreign key references: '%-.64s'"
chi: "与分区交换的表具有外键参考：'%-.64s'"

# ER_NO_SUCH_KEY_VALUE
source: "Key value '%-.192s' was not found in table '%-.192s.%-.192s'"
chi: "键值'%-.192s'在表'%-.192s%-.192s'不存在"

# ER_VALUE_TOO_LONG
source: "Too long value for '%s'"
chi: "'%s'的价值太长了"

# ER_NETWORK_READ_EVENT_CHECKSUM_FAILURE
source: "Replication event checksum verification failed while reading from network"
chi: "从网络读取时，复制事件校验和验证失败"
