Repository: vladbogo/test-translation
Catalog: chi.xlf
Languages: chi

# ER_TOO_MANY_USER_CONNECTIONS 42000
source: "User %-.64s already has more than 'max_user_connections' active connections"
chi: "用户%-.64s已经拥有超过“max_user_conections”的活连接"

# ER_SET_CONSTANTS_ONLY
source: "You may only use constant expressions in this statement"
chi: "您只能在此语句中使用常量表达式"

# ER_LOCK_WAIT_TIMEOUT
source: "Lock wait timeout exceeded; try restarting transaction"
chi: "锁等待超时;尝试重新启动事务"

# ER_LOCK_TABLE_FULL
source: "The total number of locks exceeds the lock table size"
chi: "锁的总数超过锁定表大小"

# ER_READ_ONLY_TRANSACTION 25000
source: "Update locks cannot be acquired during a READ UNCOMMITTED transaction"
chi: "在READ UNCOMMITTED事务期间无法获取更新锁定"

# ER_DROP_DB_WITH_READ_LOCK
source: "DROP DATABASE not allowed while thread is holding global read lock"
chi: "线程持有全局读锁时，不允许删除数据库"

# ER_CREATE_DB_WITH_READ_LOCK
source: "CREATE DATABASE not allowed while thread is holding global read lock"
chi: "线程持有全局读锁时，不允许创建数据库"

# ER_WRONG_ARGUMENTS
source: "Incorrect arguments to %s"
chi: "%s的参数不正确"

# ER_NO_PERMISSION_TO_CREATE_USER 42000
source: "'%s'@'%s' is not allowed to create new users"
chi: "'%s'@'%s'不允许创建新用户"

# ER_UNION_TABLES_IN_DIFFERENT_DIR
source: "Incorrect table definition; all MERGE tables must be in the same database"
chi: "表定义不正确;所有合并表必须在同一数据库中"

# ER_LOCK_DEADLOCK 40001
source: "Deadlock found when trying to get lock; try restarting transaction"
chi: "试图锁定时发现僵局;尝试重新启动事务"

# ER_TABLE_CANT_HANDLE_FT
source: "The storage engine %s doesn't support FULLTEXT indexes"
chi: "存储引擎%s不支持fulltext索引"

# ER_CANNOT_ADD_FOREIGN
source: "Cannot add foreign key constraint for `%s`"
chi: "不能为`%s`添加外键约束"

# ER_NO_REFERENCED_ROW 23000
source: "Cannot add or update a child row: a foreign key constraint fails"
chi: "无法添加或更新子行：外键约束失败"

# ER_ROW_IS_REFERENCED 23000
source: "Cannot delete or update a parent row: a foreign key constraint fails"
chi: "无法删除或更新父行：外键约束失败"

# ER_CONNECT_TO_MASTER 08S01
source: "Error connecting to master: %-.128s"
chi: "连接master时出错：%-.128s"

# ER_QUERY_ON_MASTER
source: "Error running query on master: %-.128s"
chi: "在Master上运行查询时出错：%-.128s"

# ER_ERROR_WHEN_EXECUTING_COMMAND
source: "Error when executing command %s: %-.128s"
chi: "执行命令%s时出错：%-.128s"

# ER_WRONG_USAGE
source: "Incorrect usage of %s and %s"
chi: "%s和%s使用不正确"

# ER_WRONG_NUMBER_OF_COLUMNS_IN_SELECT 21000
source: "The used SELECT statements have a different number of columns"
chi: "使用的SELECT语句具有不同数量的列"

# ER_CANT_UPDATE_WITH_READLOCK
source: "Can't execute the query because you have a conflicting read lock"
chi: "无法执行查询，因为您有冲突的读锁"

# ER_MIXING_NOT_ALLOWED
source: "Mixing of transactional and non-transactional tables is disabled"
chi: "事务和非事务表的混合被禁用"

# ER_DUP_ARGUMENT
source: "Option '%s' used twice in statement"
chi: "选项'%s'在语句中使用两次"

# ER_USER_LIMIT_REACHED 42000
source: "User '%-.64s' has exceeded the '%s' resource (current value: %ld)"
chi: "用户'%-.64s'已超过'%s'资源（当前值：%ld）"

# ER_SPECIFIC_ACCESS_DENIED_ERROR 42000
source: "Access denied; you need (at least one of) the %-.128s privilege(s) for this operation"
chi: "拒绝访问;您需要（至少一个）%-.128s特权用于此操作"

# ER_LOCAL_VARIABLE
source: "Variable '%-.64s' is a SESSION variable and can't be used with SET GLOBAL"
chi: "变量'%-.64s'是一个SESSION变量，不能与Set Global一起使用"

# ER_GLOBAL_VARIABLE
source: "Variable '%-.64s' is a GLOBAL variable and should be set with SET GLOBAL"
chi: "变量'%-.64s'是全局变量，应该用SET GLOBAL设置"

# ER_NO_DEFAULT 42000
source: "Variable '%-.64s' doesn't have a default value"
chi: "变量'%-.64s'没有默认值"

# ER_WRONG_VALUE_FOR_VAR 42000
source: "Variable '%-.64s' can't be set to the value of '%-.200T'"
chi: "变量'%-.64s'无法设置为'%-.200T'的值"

# ER_WRONG_TYPE_FOR_VAR 42000
source: "Incorrect argument type to variable '%-.64s'"
chi: "变量'%-.64s'的参数类型不正确"

# ER_VAR_CANT_BE_READ
source: "Variable '%-.64s' can only be set, not read"
chi: "变量'%-.64s'只能设置，不能读"

# ER_CANT_USE_OPTION_HERE 42000
source: "Incorrect usage/placement of '%s'"
chi: "'%s'的使用/放置不正确"

# ER_NOT_SUPPORTED_YET 42000
source: "This version of MariaDB doesn't yet support '%s'"
chi: "此版本的MariaDB尚未支持'%s'"

# ER_MASTER_FATAL_ERROR_READING_BINLOG
source: "Got fatal error %d from master when reading data from binary log: '%-.320s'"
chi: "从二进制日志读取数据时，从master遇到致命错误%d：'%-.320s'"

# ER_SLAVE_IGNORED_TABLE
source: "Slave SQL thread ignored the query because of replicate-*-table rules"
chi: "由于复制replicate-*-table规则，Slave SQL线程忽略了查询"

# ER_INCORRECT_GLOBAL_LOCAL_VAR
source: "Variable '%-.192s' is a %s variable"
chi: "变量'%-.192s'是一个%s变量"

# ER_WRONG_FK_DEF 42000
source: "Incorrect foreign key definition for '%-.192s': %s"
chi: "'%-.192s'的外键定义不正确：%s"

# ER_KEY_REF_DO_NOT_MATCH_TABLE_REF
source: "Key reference and table reference don't match"
chi: "索引参考和表参考不匹配"

# ER_OPERAND_COLUMNS 21000
source: "Operand should contain %d column(s)"
chi: "操作数应包含%d列"

# ER_SUBQUERY_NO_1_ROW 21000
source: "Subquery returns more than 1 row"
chi: "子查询返回超过1行"

# ER_UNKNOWN_STMT_HANDLER
source: "Unknown prepared statement handler (%.*s) given to %s"
chi: "未知prepared statement处理程序(%.*s)给予%s"

# ER_CORRUPT_HELP_DB
source: "Help database is corrupt or does not exist"
chi: "帮助数据库已损坏或不存在"

# ER_CYCLIC_REFERENCE
source: "Cyclic reference on subqueries"
chi: "亚查询的死环参考"

# ER_AUTO_CONVERT
source: "Converting column '%s' from %s to %s"
chi: "将列'%s'从%s转换为%s"

# ER_ILLEGAL_REFERENCE 42S22
source: "Reference '%-.64s' not supported (%s)"
chi: "参考'%-.64s'不支持(%s)"

# ER_DERIVED_MUST_HAVE_ALIAS 42000
source: "Every derived table must have its own alias"
chi: "每个派生的表必须有自己的别名"

# ER_SELECT_REDUCED 01000
source: "Select %u was reduced during optimization"
chi: "SELECT %u在优化期间被减"

# ER_TABLENAME_NOT_ALLOWED_HERE 42000
source: "Table '%-.192s' from one of the SELECTs cannot be used in %-.32s"
chi: "表'%-.192s'从其中一个SELECT中不能用于%-.32s"

# ER_NOT_SUPPORTED_AUTH_MODE 08004
source: "Client does not support authentication protocol requested by server; consider upgrading MariaDB client"
chi: "客户端不支持服务器请求的身份验证协议;考虑升级MariaDB客户端"

# ER_SPATIAL_CANT_HAVE_NULL 42000
source: "All parts of a SPATIAL index must be NOT NULL"
chi: "SPATIAL索引的所有部分必须不为null"

# ER_COLLATION_CHARSET_MISMATCH 42000
source: "COLLATION '%s' is not valid for CHARACTER SET '%s'"
chi: "COLLATION'%s'无效地用于字符集'%s'"

# ER_SLAVE_WAS_RUNNING
source: "Slave is already running"
chi: "Slave已经在运行"

# ER_SLAVE_WAS_NOT_RUNNING
source: "Slave already has been stopped"
chi: "slave已经停止了"

# ER_TOO_BIG_FOR_UNCOMPRESS
source: "Uncompressed data size too large; the maximum size is %d (probably, length of uncompressed data was corrupted)"
chi: "未压缩的数据量太大;最大量为%d（可能未压缩数据的长度已损坏）"

# ER_ZLIB_Z_MEM_ERROR
source: "ZLIB: Not enough memory"
chi: "ZLIB：内存不足"

# ER_ZLIB_Z_BUF_ERROR
source: "ZLIB: Not enough room in the output buffer (probably, length of uncompressed data was corrupted)"
chi: "ZLIB：输出缓冲区中没有足够的空间（可能未压缩数据的长度已损坏）"

# ER_ZLIB_Z_DATA_ERROR
source: "ZLIB: Input data corrupted"
chi: "ZLIB：输入数据已损坏"

# ER_CUT_VALUE_GROUP_CONCAT
source: "Row %u was cut by %s)"
chi: "group_concat（）削减了行%u. %s"

# ER_WARN_TOO_FEW_RECORDS 01000
source: "Row %lu doesn't contain data for all columns"
chi: "行%lu不包含所有列的数据"

# ER_WARN_TOO_MANY_RECORDS 01000
source: "Row %lu was truncated; it contained more data than there were input columns"
chi: "行%lu被截断;它包含的数据比输入列更多"

# ER_WARN_NULL_TO_NOTNULL 22004
source: "Column set to default value; NULL supplied to NOT NULL column '%s' at row %lu"
chi: "列设置为默认值; NULL在行'%s'中提供给了NOT NULL列%lu"

# ER_WARN_DATA_OUT_OF_RANGE 22003
source: "Out of range value for column '%s' at row %lu"
chi: "列'%s'行%lu的值超出范围"

# WARN_DATA_TRUNCATED 01000
source: "Data truncated for column '%s' at row %lu"
chi: "数据被截断，在列'%s', 行%lu"

# ER_WARN_USING_OTHER_HANDLER
source: "Using storage engine %s for table '%s'"
chi: "使用存储引擎%s 表格'%s'"

# ER_CANT_AGGREGATE_2COLLATIONS
source: "Illegal mix of collations (%s,%s) and (%s,%s) for operation '%s'"
chi: "非法混合collations（%s，%s）和（%s，%s），用于操作'%s'"

# ER_DROP_USER
source: "Cannot drop one or more of the requested users"
chi: "无法删除一个或多个请求的用户"

# ER_REVOKE_GRANTS
source: "Can't revoke all privileges for one or more of the requested users"
chi: "无法为一个或多个请求的用户撤消所有权限"

# ER_CANT_AGGREGATE_3COLLATIONS
source: "Illegal mix of collations (%s,%s), (%s,%s), (%s,%s) for operation '%s'"
chi: "非法混合collations（%s，%s）,（%s，%s）和（%s，%s），用于操作'%s'"

# ER_CANT_AGGREGATE_NCOLLATIONS
source: "Illegal mix of collations for operation '%s'"
chi: "非法混合collations操作'%s'"

# ER_VARIABLE_IS_NOT_STRUCT
source: "Variable '%-.64s' is not a variable component (can't be used as XXXX.variable_name)"
chi: "变量'%-.64s'不是可变组件（不能用作xxxx.variable_name）"

# ER_UNKNOWN_COLLATION
source: "Unknown collation: '%-.64s'"
chi: "未知的collation：'%-.64s'"

# ER_SLAVE_IGNORED_SSL_PARAMS
source: "SSL parameters in CHANGE MASTER are ignored because this MariaDB slave was compiled without SSL support; they can be used later if MariaDB slave with SSL is started"
chi: "CHANGE MASTER中的SSL参数被忽略，因为此MariaDB从站未在没有SSL支持的情况下编译;如果启动了SSL的MariaDB从站，则可以使用它们"

# ER_SERVER_IS_IN_SECURE_AUTH_MODE
source: "Server is running in --secure-auth mode, but '%s'@'%s' has a password in the old format; please change the password to the new format"
chi: "服务器在--secure-auth模式下运行，但'%s'@'%s'具有旧格式的密码;请将密码更改为新格式"

# ER_WARN_FIELD_RESOLVED
source: "Field or reference '%-.192s%s%-.192s%s%-.192s' of SELECT #%d was resolved in SELECT #%d"
chi: "列或参考'%-.192s%s%-.192s%s%-.192s' 在SELECT #%d 中, 在SELECT #%d中得到解决"

# ER_BAD_SLAVE_UNTIL_COND
source: "Incorrect parameter or combination of parameters for START SLAVE UNTIL"
chi: "START SLAVE UNTIL的参数或参数的组合不正确"

# ER_MISSING_SKIP_SLAVE
source: "It is recommended to use --skip-slave-start when doing step-by-step replication with START SLAVE UNTIL; otherwise, you will get problems if you get an unexpected slave's mariadbd restart"
chi: "START SLAVE UNTIL进行逐步复制时建议使用--skip-slave-start;否则，如果有意外的Slave的mariadbd重启，可能有问题"

# ER_UNTIL_COND_IGNORED
source: "SQL thread is not to be started so UNTIL options are ignored"
chi: "不能启动SQL线程所以UNTIL选项被忽略"

# ER_WRONG_NAME_FOR_INDEX 42000
source: "Incorrect index name '%-.100s'"
chi: "索引名称'%-.100s'不正确"

# ER_WRONG_NAME_FOR_CATALOG 42000
source: "Incorrect catalog name '%-.100s'"
chi: "目录名称'%-.100s'不正确"

# ER_WARN_QC_RESIZE
source: "Query cache failed to set size %llu; new query cache size is %lu"
chi: "设置查询缓存值%llu失败;新查询缓存值为%lu"

# ER_BAD_FT_COLUMN
source: "Column '%-.192s' cannot be part of FULLTEXT index"
chi: "列'%-.192s'不能成为全文索引的一部分"

# ER_UNKNOWN_KEY_CACHE
source: "Unknown key cache '%-.100s'"
chi: "未知索引缓存'%-.100s'"

# ER_WARN_HOSTNAME_WONT_WORK
source: "MariaDB is started in --skip-name-resolve mode; you must restart it without this switch for this grant to work"
chi: "MariaDB以-skip-name-resolve模式启动;想用grant，您必须重新启动，不用这个选项"

# ER_UNKNOWN_STORAGE_ENGINE 42000
source: "Unknown storage engine '%s'"
chi: "未知的存储引擎'%s'"

# ER_WARN_DEPRECATED_SYNTAX
source: "'%s' is deprecated and will be removed in a future release. Please use %s instead"
chi: "弃用'%s'，将在将来的版本中删除。请使用%s"

# ER_NON_UPDATABLE_TABLE
source: "The target table %-.100s of the %s is not updatable"
chi: "目标表%-.100s多个%s不可更新"

# ER_FEATURE_DISABLED
source: "The '%s' feature is disabled; you need MariaDB built with '%s' to have it working"
chi: "'%s'功能被禁用;您需要MariaDB以'%s'构建以使其工作"

# ER_OPTION_PREVENTS_STATEMENT
source: "The MariaDB server is running with the %s option so it cannot execute this statement"
chi: "MariaDB服务器使用%s选项运行，因此无法执行此语句"

# ER_DUPLICATED_VALUE_IN_TYPE
source: "Column '%-.100s' has duplicated value '%-.64s' in %s"
chi: "列'%-.100s'有重复的值'%-.64s'在%s"

# ER_TRUNCATED_WRONG_VALUE 22007
source: "Truncated incorrect %-.32T value: '%-.128T'"
chi: "截断的不正确%-.32T值：'%-.128T'"

# ER_TOO_MUCH_AUTO_TIMESTAMP_COLS
source: "Incorrect table definition; there can be only one TIMESTAMP column with CURRENT_TIMESTAMP in DEFAULT or ON UPDATE clause"
chi: "表定义不正确;默认或ON UPDATE中只能有一个带有CURRENT_TIMESTAMP的TIMESTAMP列"

# ER_INVALID_ON_UPDATE
source: "Invalid ON UPDATE clause for '%-.192s' column"
chi: "在'%-.192s'列的ON UPDATE子句上无效"

# ER_UNSUPPORTED_PS
source: "This command is not supported in the prepared statement protocol yet"
chi: "尚未在prepared statement协议中支持此命令"

# ER_GET_ERRMSG
source: "Got error %d '%-.200s' from %s"
chi: "出错%d '%-.200s'来自%s"

# ER_GET_TEMPORARY_ERRMSG
source: "Got temporary error %d '%-.200s' from %s"
chi: "出临时错误%d '%-.200s'来自%s"

# ER_UNKNOWN_TIME_ZONE
source: "Unknown or incorrect time zone: '%-.64s'"
chi: "未知或不正确的时区：'%-.64s'"

# ER_WARN_INVALID_TIMESTAMP
source: "Invalid TIMESTAMP value in column '%s' at row %lu"
chi: "无效TIMESTAMP值：列'%s' 行'%lu'"

# ER_INVALID_CHARACTER_STRING
source: "Invalid %s character string: '%.64T'"
chi: "无效的%s字符串：'%.64T'"

# ER_WARN_ALLOWED_PACKET_OVERFLOWED
source: "Result of %s() was larger than max_allowed_packet (%ld) - truncated"
chi: "%s（）的结果大于max_allowed_packet（%ld） - 截断"

# ER_CONFLICTING_DECLARATIONS
source: "Conflicting declarations: '%s%s' and '%s%s'"
chi: "矛盾语句：'%s%s'和'%s%s'"

# ER_SP_NO_RECURSIVE_CREATE 2F003
source: "Can't create a %s from within another stored routine"
chi: "无法从另一个存储过程中创建%s"

# ER_SP_ALREADY_EXISTS 42000
source: "%s %s already exists"
chi: "%s%s已经存在"

# ER_SP_DOES_NOT_EXIST 42000
source: "%s %s does not exist"
chi: "%s%s不存在"

# ER_SP_DROP_FAILED
source: "Failed to DROP %s %s"
chi: "未能DROP%s%s"

# ER_SP_STORE_FAILED
source: "Failed to CREATE %s %s"
chi: "无法创建%s%s"

# ER_SP_LILABEL_MISMATCH 42000
source: "%s with no matching label: %s"
chi: "%s，没有匹配标签：%s"

# ER_SP_LABEL_REDEFINE 42000
source: "Redefining label %s"
chi: "重新定义标签%s"

# ER_SP_LABEL_MISMATCH 42000
source: "End-label %s without match"
chi: "没有匹配的最终标签%s"

# ER_SP_UNINIT_VAR 01000
source: "Referring to uninitialized variable %s"
chi: "参考未初始化的变量%s"

# ER_SP_BADSELECT 0A000
source: "PROCEDURE %s can't return a result set in the given context"
chi: "PROCEDURE%s不能返回给定上下文中的结果集"

# ER_SP_BADRETURN 42000
source: "RETURN is only allowed in a FUNCTION"
chi: "RETURN仅允许在函数中"

# ER_SP_BADSTATEMENT 0A000
source: "%s is not allowed in stored procedures"
chi: "%s不允许在存储过程中"

# ER_UPDATE_LOG_DEPRECATED_IGNORED 42000
source: "The update log is deprecated and replaced by the binary log; SET SQL_LOG_UPDATE has been ignored. This option will be removed in MariaDB 5.6"
chi: "更新日志被弃用并由二进制日志替换;SET SQL_LOG_UPDATE已被忽略。此选项将在MariaDB 5.6中删除"

# ER_UPDATE_LOG_DEPRECATED_TRANSLATED 42000
source: "The update log is deprecated and replaced by the binary log; SET SQL_LOG_UPDATE has been translated to SET SQL_LOG_BIN. This option will be removed in MariaDB 5.6"
chi: "更新日志被弃用并由二进制日志替换;SET SQL_LOG_UPDATE已被转换为设置SQL_LOG_BIN。此选项将在MariaDB 5.6中删除"

# ER_QUERY_INTERRUPTED 70100
source: "Query execution was interrupted"
chi: "查询执行中断"

# ER_SP_WRONG_NO_OF_ARGS 42000
source: "Incorrect number of arguments for %s %s; expected %u, got %u"
chi: "%s%s的参数数量不正确;预期%u，得到%u"

# ER_SP_COND_MISMATCH 42000
source: "Undefined CONDITION: %s"
chi: "未定义的CONDITION：%s"

# ER_SP_NORETURN 42000
source: "No RETURN found in FUNCTION %s"
chi: "FUNCTION%s中没有RETURN"

# ER_SP_NORETURNEND 2F005
source: "FUNCTION %s ended without RETURN"
chi: "FUNCTION%s结束但无RETURN"

# ER_SP_BAD_CURSOR_QUERY 42000
source: "Cursor statement must be a SELECT"
chi: "Cursor语句必须是选择"

# ER_SP_BAD_CURSOR_SELECT 42000
source: "Cursor SELECT must not have INTO"
chi: "Cursor SELECT不能有INTO"

# ER_SP_CURSOR_MISMATCH 42000
source: "Undefined CURSOR: %s"
chi: "未定义的CURSOR：%s"

# ER_SP_CURSOR_ALREADY_OPEN 24000
source: "Cursor is already open"
chi: "Cursor已经打开"

# ER_SP_CURSOR_NOT_OPEN 24000
source: "Cursor is not open"
chi: "Cursor未打开"

# ER_SP_UNDECLARED_VAR 42000
source: "Undeclared variable: %s"
chi: "未定义的变量：%s"

# ER_SP_WRONG_NO_OF_FETCH_ARGS
source: "Incorrect number of FETCH variables"
chi: "FETCH变量数不正确"

# ER_SP_FETCH_NO_DATA 02000
source: "No data - zero rows fetched, selected, or processed"
chi: "没有数据 - 零行被选择或处理"

# ER_SP_DUP_PARAM 42000
source: "Duplicate parameter: %s"
chi: "重复参数：%s"

# ER_SP_DUP_VAR 42000
source: "Duplicate variable: %s"
chi: "重复变量：%s"

# ER_SP_DUP_COND 42000
source: "Duplicate condition: %s"
chi: "重复条件：%s"

# ER_SP_DUP_CURS 42000
source: "Duplicate cursor: %s"
chi: "重复Cursor：%s"

# ER_SP_CANT_ALTER
source: "Failed to ALTER %s %s"
chi: "未能ALTER %s%s"

# ER_SP_SUBSELECT_NYI 0A000
source: "Subquery value not supported"
chi: "不支持子查询值"

# ER_STMT_NOT_ALLOWED_IN_SF_OR_TRG 0A000
source: "%s is not allowed in stored function or trigger"
chi: "在存储的函数或触发中不允许%s"

# ER_SP_VARCOND_AFTER_CURSHNDLR 42000
source: "Variable or condition declaration after cursor or handler declaration"
chi: "变量或条件声明在cursor或处理程序定义之后"

# ER_SP_CURSOR_AFTER_HANDLER 42000
source: "Cursor declaration after handler declaration"
chi: "处理程序声明后的cursor声明"

# ER_SP_CASE_NOT_FOUND 20000
source: "Case not found for CASE statement"
chi: "未能在CASE语句找到Case"

# ER_FPARSER_TOO_BIG_FILE
source: "Configuration file '%-.192s' is too big"
chi: "配置文件'%-.192s'太大了"

# ER_FPARSER_BAD_HEADER
source: "Malformed file type header in file '%-.192s'"
chi: "文件'%-.192s'中的文件类型格式有问题"

# ER_FPARSER_EOF_IN_COMMENT
source: "Unexpected end of file while parsing comment '%-.200s'"
chi: "解析评论'%-.200s'时意外碰到EOF"

# ER_FPARSER_ERROR_IN_PARAMETER
source: "Error while parsing parameter '%-.192s' (line: '%-.192s')"
chi: "解析参数'%-.192s'时出错（行：'%-.192s'）"

# ER_FPARSER_EOF_IN_UNKNOWN_PARAMETER
source: "Unexpected end of file while skipping unknown parameter '%-.192s'"
chi: "跳过未知参数'%-.192s'时意外碰到EOF"

# ER_VIEW_NO_EXPLAIN
source: "ANALYZE/EXPLAIN/SHOW can not be issued; lacking privileges for underlying table"
chi: "ANALYZE/EXPLAIN/SHOW无法进行;缺乏底层表的特权"

# ER_FRM_UNKNOWN_TYPE
source: "File '%-.192s' has unknown type '%-.64s' in its header"
chi: "文件'%-.192s'在其标题中有未知的'%-.64s'"

# ER_WRONG_OBJECT
source: "'%-.192s.%-.192s' is not of type '%s'"
chi: "'%-.192s.%-.192s'不是'%s'类"

# ER_NONUPDATEABLE_COLUMN
source: "Column '%-.192s' is not updatable"
chi: "列'%-.192s'不可更新"

# ER_VIEW_SELECT_DERIVED
source: "View's SELECT contains a subquery in the FROM clause"
chi: "View的Select的FROM包含子查询"

# ER_VIEW_SELECT_CLAUSE
source: "View's SELECT contains a '%s' clause"
chi: "View的Select包含“%s”子句"

# ER_VIEW_SELECT_VARIABLE
source: "View's SELECT contains a variable or parameter"
chi: "View的选择包含变量或参数"

# ER_VIEW_SELECT_TMPTABLE
source: "View's SELECT refers to a temporary table '%-.192s'"
chi: "View的SELECT指的是临时表'%-.192s'"

# ER_VIEW_WRONG_LIST
source: "View's SELECT and view's field list have different column counts"
chi: "View的选择和VIEW的字段列表具有不同的列计数"

# ER_WARN_VIEW_MERGE
source: "View merge algorithm can't be used here for now (assumed undefined algorithm)"
chi: "View合并算法目前不能使用（假设未定义的算法）"

# ER_WARN_VIEW_WITHOUT_KEY
source: "View being updated does not have complete key of underlying table in it"
chi: "更新的视图没有底层表的完整键"

# ER_VIEW_INVALID
source: "View '%-.192s.%-.192s' references invalid table(s) or column(s) or function(s) or definer/invoker of view lack rights to use them"
chi: "View'%-.192s.%-.192s'引用无效的表、列、函数、或者函数或View缺乏使用权"

# ER_SP_NO_DROP_SP
source: "Can't drop or alter a %s from within another stored routine"
chi: "无法从另一个存储的例程中删除或更改%s"

# ER_SP_GOTO_IN_HNDLR
source: "GOTO is not allowed in a stored procedure handler"
chi: "在存储过程处理程序中不允许GOTO"

# ER_TRG_ALREADY_EXISTS
source: "Trigger '%s' already exists"
chi: "触发'%s'已经存在"

# ER_TRG_DOES_NOT_EXIST
source: "Trigger does not exist"
chi: "触发不存在"

# ER_TRG_ON_VIEW_OR_TEMP_TABLE
source: "Trigger's '%-.192s' is a view, temporary table or sequence"
chi: "触发器的'%-.192s'是视图或临时表"

# ER_TRG_CANT_CHANGE_ROW
source: "Updating of %s row is not allowed in %strigger"
chi: "更新%s行在%s触发器中不允许"

# ER_TRG_NO_SUCH_ROW_IN_TRG
source: "There is no %s row in %s trigger"
chi: "没有%s行，触发%s"

# ER_NO_DEFAULT_FOR_FIELD
source: "Field '%-.192s' doesn't have a default value"
chi: "字段'%-.192s'没有默认值"

# ER_DIVISION_BY_ZERO 22012
source: "Division by 0"
chi: "除0错误"

# ER_TRUNCATED_WRONG_VALUE_FOR_FIELD 22007
source: "Incorrect %-.32s value: '%-.128T' for column `%.192s`.`%.192s`.`%.192s` at row %lu"
chi: "不正确的%-.32s值：'%-.128T'用于列`%.192s`%.192s`%.192s`在%lu行"

# ER_ILLEGAL_VALUE_FOR_TYPE 22007
source: "Illegal %s '%-.192T' value found during parsing"
chi: "在解析期间发现的非法%s '%-.192T'值"

# ER_VIEW_NONUPD_CHECK
source: "CHECK OPTION on non-updatable view %`-.192s.%`-.192s"
chi: "在不可更新的视图%`-.192s.%`-.192s上CHECK OPTION"

# ER_VIEW_CHECK_FAILED 44000
source: "CHECK OPTION failed %`-.192s.%`-.192s"
chi: "CHECK OPTION失败%`-.192s.%`-.192s"

# ER_PROCACCESS_DENIED_ERROR 42000
source: "%-.32s command denied to user '%s'@'%s' for routine '%-.192s'"
chi: "%-.32s命令被拒绝。用户为'%s'@'%s' 例程'%-.192s'"

# ER_RELAY_LOG_FAIL
source: "Failed purging old relay logs: %s"
chi: "清除旧继relay日志失败：%s"

# ER_PASSWD_LENGTH
source: "Password hash should be a %d-digit hexadecimal number"
chi: "密码哈希应该是一个%d-digit十六进制数"

# ER_UNKNOWN_TARGET_BINLOG
source: "Target log not found in binlog index"
chi: "在Binlog索引中找不到目标日志"

# ER_IO_ERR_LOG_INDEX_READ
source: "I/O error reading log index file"
chi: "读取日志索引文件时I/O错误"

# ER_BINLOG_PURGE_PROHIBITED
source: "Server configuration does not permit binlog purge"
chi: "服务器配置不允许Binlog清除"

# ER_FSEEK_FAIL
source: "Failed on fseek()"
chi: "fseek（）失败"

# ER_BINLOG_PURGE_FATAL_ERR
source: "Fatal error during log purge"
chi: "日志清除期间的致命错误"

# ER_LOG_IN_USE
source: "A purgeable log is in use, will not purge"
chi: "日志在用，不会清除"

# ER_LOG_PURGE_UNKNOWN_ERR
source: "Unknown error during log purge"
chi: "日志清除期间未知错误"

# ER_RELAY_LOG_INIT
source: "Failed initializing relay log position: %s"
chi: "初始化relay日志失败。位置：%s"

# ER_NO_BINARY_LOGGING
source: "You are not using binary logging"
chi: "您不使用二进制日志记录"

# ER_RESERVED_SYNTAX
source: "The '%-.64s' syntax is reserved for purposes internal to the MariaDB server"
chi: "'%-.64s'语法保留用于MariaDB服务器内部"

# ER_WSAS_FAILED
source: "WSAStartup Failed"
chi: "WSAStartup失败了"

# ER_DIFF_GROUPS_PROC
source: "Can't handle procedures with different groups yet"
chi: "无法处理具有不同组的过程"

# ER_NO_GROUP_FOR_PROC
source: "Select must have a group with this procedure"
chi: "SELECT必须具有此过程的组"

# ER_ORDER_WITH_PROC
source: "Can't use ORDER clause with this procedure"
chi: "无法在次存储过程使用ORDER子句"

# ER_LOGGING_PROHIBIT_CHANGING_OF
source: "Binary logging and replication forbid changing the global server %s"
chi: "二进制日志记录和复制禁止更改全局服务器%s"

# ER_NO_FILE_MAPPING
source: "Can't map file: %-.200s, errno: %M"
chi: "无法映射文件：%-.200s，错误号码：%M"

# ER_WRONG_MAGIC
source: "Wrong magic in %-.64s"
chi: "魔法错误%-.64s"

# ER_PS_MANY_PARAM
source: "Prepared statement contains too many placeholders"
chi: "Prepared statement包含太多占位符"

# ER_KEY_PART_0
source: "Key part '%-.192s' length cannot be 0"
chi: "索引部分'%-.192s'长度不能为0"

# ER_VIEW_CHECKSUM
source: "View text checksum failed"
chi: "查看文本checksum失败"

# ER_VIEW_MULTIUPDATE
source: "Can not modify more than one base table through a join view '%-.192s.%-.192s'"
chi: "无法通过JOIN视图'%-.192s.%-.192s'修改多个基础表。"

# ER_VIEW_NO_INSERT_FIELD_LIST
source: "Can not insert into join view '%-.192s.%-.192s' without fields list"
chi: "无法写入JOIN视图'%-.192s.%-.192s'没有字段列表"

# ER_VIEW_DELETE_MERGE_VIEW
source: "Can not delete from join view '%-.192s.%-.192s'"
chi: "无法从JOIN视图'%-.192s.%-.192s'删除"

# ER_CANNOT_USER
source: "Operation %s failed for %.256s"
chi: "操作%s失败%.256s"

# ER_XAER_NOTA XAE04
source: "XAER_NOTA: Unknown XID"
chi: "XAER_NOTA：未知的XID"

# ER_XAER_INVAL XAE05
source: "XAER_INVAL: Invalid arguments (or unsupported command)"
chi: "XAER_INVAL：无效的参数（或不支持的命令）"

# ER_XAER_RMFAIL XAE07
source: "XAER_RMFAIL: The command cannot be executed when global transaction is in the %.64s state"
chi: "XAER_RMFAIL：当全局事务处于%.64s状态时，无法执行该命令"

# ER_XAER_OUTSIDE XAE09
source: "XAER_OUTSIDE: Some work is done outside global transaction"
chi: "XAER_OUTSIDE：一些工作是在全局交易之外完成的"

# ER_XAER_RMERR XAE03
source: "XAER_RMERR: Fatal error occurred in the transaction branch - check your data for consistency"
chi: "XAER_RMERR：事务分支中发生致命错误 - 检查您的数据以获得一致性"

# ER_XA_RBROLLBACK XA100
source: "XA_RBROLLBACK: Transaction branch was rolled back"
chi: "XA_RBROLBACK：交易分支回滚"
