Repository: vladbogo/test-translation
Catalog: chi.xlf
Languages: chi

# ER_UNKNOWN_OPTION
source: "Unknown option '%-.64s'"
chi: "未知选项'%-.64s'"

# ER_BAD_OPTION_VALUE
source: "Incorrect value '%-.64T' for option '%-.64s'"
chi: "值不正确'%-.64T'选项'%-.64s'"

# ER_UNUSED_6
source: "You should never see it"
chi: "你永远不应该看到它"

# ER_UNUSED_7
source: "You should never see it"
chi: "你永远不应该看到它"

# ER_UNUSED_8
source: "You should never see it"
chi: "你永远不应该看到它"

# ER_DATA_OVERFLOW 22003
source: "Got overflow when converting '%-.128s' to %-.32s. Value truncated"
chi: "转换'%-.128s'到%-.32s时溢出。值截断"

# ER_DATA_TRUNCATED 22003
source: "Truncated value '%-.128s' when converting to %-.32s"
chi: "转换'%-.128s'到%-.32s时值截断"

# ER_BAD_DATA 22007
source: "Encountered illegal value '%-.128s' when converting to %-.32s"
chi: "非法值'%-.128s'，在转换%-.32s时遇到"

# ER_DYN_COL_WRONG_FORMAT
source: "Encountered illegal format of dynamic column string"
chi: "遇到非法格式的动态列字符串"

# ER_DYN_COL_IMPLEMENTATION_LIMIT
source: "Dynamic column implementation limit reached"
chi: "达到动态列实现限制"

# ER_DYN_COL_DATA 22007
source: "Illegal value used as argument of dynamic column function"
chi: "非法值用作动态列函数的参数"

# ER_DYN_COL_WRONG_CHARSET
source: "Dynamic column contains unknown character set"
chi: "动态列包含未知字符集"

# ER_ILLEGAL_SUBQUERY_OPTIMIZER_SWITCHES
source: "At least one of the 'in_to_exists' or 'materialization' optimizer_switch flags must be 'on'"
chi: "“in_to_exists”或'materialization'optimizer_switch标志中的至少一个必须是'开启'"

# ER_QUERY_CACHE_IS_DISABLED
source: "Query cache is disabled (resize or similar command in progress); repeat this command later"
chi: "查询缓存已禁用（调整大小或类似命令正在进行中）;稍后重复此命令"

# ER_QUERY_CACHE_IS_GLOBALY_DISABLED
source: "Query cache is globally disabled and you can't enable it only for this session"
chi: "查询缓存全局禁用，您无法为此会话启用它"

# ER_VIEW_ORDERBY_IGNORED
source: "View '%-.192s'.'%-.192s' ORDER BY clause ignored because there is other ORDER BY clause already"
chi: "查看'%-.192s'.'%-.192s's ORDER BY子句被忽略，因为还有其他ORDER BY子句"

# ER_CONNECTION_KILLED 70100
source: "Connection was killed"
chi: "连接被杀死"

# ER_UNUSED_12
source: "You should never see it"
chi: "你永远不应该看到它"

# ER_INSIDE_TRANSACTION_PREVENTS_SWITCH_SKIP_REPLICATION
source: "Cannot modify @@session.skip_replication inside a transaction"
chi: "无法修改事务中的@@session.skip_replication"

# ER_STORED_FUNCTION_PREVENTS_SWITCH_SKIP_REPLICATION
source: "Cannot modify @@session.skip_replication inside a stored function or trigger"
chi: "无法修改存储函数或触发器内的@@session.skip_replication"

# ER_QUERY_EXCEEDED_ROWS_EXAMINED_LIMIT
source: "Query execution was interrupted. The query examined at least %llu rows, which exceeds LIMIT ROWS EXAMINED (%llu). The query result may be incomplete"
chi: "查询执行被中断。查询检查至少%llu行，超过限制行（%llu）。查询结果可能是不完整的"

# ER_NO_SUCH_TABLE_IN_ENGINE 42S02
source: "Table '%-.192s.%-.192s' doesn't exist in engine"
chi: "表'%-.192s.%-.192s'在引擎中不存在"

# ER_TARGET_NOT_EXPLAINABLE
source: "Target is not executing an operation with a query plan"
chi: "目标未运行可解释的命令"

# ER_CONNECTION_ALREADY_EXISTS
source: "Connection '%.*s' conflicts with existing connection '%.*s'"
chi: "连接'%.*s'与现有连接'%.*s'冲突"

# ER_CANT_START_STOP_SLAVE
source: "Can't %s SLAVE '%.*s'"
chi: "不能%sSLAVE'%.*s'"

# ER_SLAVE_STARTED
source: "SLAVE '%.*s' started"
chi: "SLAVE '%.*s'开始了"

# ER_SLAVE_STOPPED
source: "SLAVE '%.*s' stopped"
chi: "slave'%.*s'停止了"

# ER_SQL_DISCOVER_ERROR
source: "Engine %s failed to discover table %`-.192s.%`-.192s with '%s'"
chi: "引擎%s无法发现表%`-.192s.%`-.192s，'%s'"

# ER_FAILED_GTID_STATE_INIT
source: "Failed initializing replication GTID state"
chi: "初始化复制GTID状态失败"

# ER_INCORRECT_GTID_STATE
source: "Could not parse GTID list"
chi: "无法解析GTID列表"

# ER_CANNOT_UPDATE_GTID_STATE
source: "Could not update replication slave gtid state"
chi: "无法更新Replication Slave GTID状态"

# ER_DUPLICATE_GTID_DOMAIN
source: "GTID %u-%u-%llu and %u-%u-%llu conflict (duplicate domain id %u)"
chi: "GTID %u-%u-%llu和%u-%u-%llu冲突（重复域ID%u）"

# ER_GTID_OPEN_TABLE_FAILED
source: "Failed to open %s.%s"
chi: "未能打开%s.%s"

# ER_GTID_POSITION_NOT_FOUND_IN_BINLOG
source: "Connecting slave requested to start from GTID %u-%u-%llu, which is not in the master's binlog"
chi: "连接从站请求从GTID%u-%u-%llu开始，这不在Master的Binlog中"

# ER_CANNOT_LOAD_SLAVE_GTID_STATE
source: "Failed to load replication slave GTID position from table %s.%s"
chi: "无法从表%s中加载Replication Slave GTID位置。%s"

# ER_MASTER_GTID_POS_CONFLICTS_WITH_BINLOG
source: "Specified GTID %u-%u-%llu conflicts with the binary log which contains a more recent GTID %u-%u-%llu. If MASTER_GTID_POS=CURRENT_POS is used, the binlog position will override the new value of @@gtid_slave_pos"
chi: "指定的GTID%u-%u-%llu与二进制日志冲突，其中包含更新的GTID%u-%u-%llu。如果使用master_gtid_pos = current_pos，则Binlog位置将覆盖@@gtid_slave_pos的新值"

# ER_MASTER_GTID_POS_MISSING_DOMAIN
source: "Specified value for @@gtid_slave_pos contains no value for replication domain %u. This conflicts with the binary log which contains GTID %u-%u-%llu. If MASTER_GTID_POS=CURRENT_POS is used, the binlog position will override the new value of @@gtid_slave_pos"
chi: "指定值为@@gtid_slave_pos不包含复制域%u的值。这与二进制日志冲突，其中包含gtid%u-%u-%llu。如果使用master_gtid_pos = current_pos，则Binlog位置将覆盖@@ gtid_slave_pos的新值"

# ER_UNTIL_REQUIRES_USING_GTID
source: "START SLAVE UNTIL master_gtid_pos requires that slave is using GTID"
chi: "启动从站，直到master_gtid_pos要求从站使用gtid"

# ER_GTID_STRICT_OUT_OF_ORDER
source: "An attempt was made to binlog GTID %u-%u-%llu which would create an out-of-order sequence number with existing GTID %u-%u-%llu, and gtid strict mode is enabled"
chi: "尝试对Binlog GTID%u-%u-%llu进行，这将创建具有现有GTID%u-%u-%llu的订单无序序列号，并且启用了GTID严格模式"

# ER_GTID_START_FROM_BINLOG_HOLE
source: "The binlog on the master is missing the GTID %u-%u-%llu requested by the slave (even though a subsequent sequence number does exist), and GTID strict mode is enabled"
chi: "主机上的Binlog缺少从站所需请求的GTID%u-%u-%llu（即使存在后续的序列号），并启用GTID严格模式"

# ER_SLAVE_UNEXPECTED_MASTER_SWITCH
source: "Unexpected GTID received from master after reconnect. This normally indicates that the master server was replaced without restarting the slave threads. %s"
chi: "重新连接后，从master收到意外的GTID。这通常表示在不重新启动从线程的情况下替换主服务器。%s."

# ER_INSIDE_TRANSACTION_PREVENTS_SWITCH_GTID_DOMAIN_ID_SEQ_NO
source: "Cannot modify @@session.gtid_domain_id or @@session.gtid_seq_no inside a transaction"
chi: "无法修改@@sessient.gtid_domain_id或@@session.gtid_seq_no"

# ER_STORED_FUNCTION_PREVENTS_SWITCH_GTID_DOMAIN_ID_SEQ_NO
source: "Cannot modify @@session.gtid_domain_id or @@session.gtid_seq_no inside a stored function or trigger"
chi: "无法修改@@sessient.gtid_domain_id或@@session.gtid_seq_no或触发器"

# ER_GTID_POSITION_NOT_FOUND_IN_BINLOG2
source: "Connecting slave requested to start from GTID %u-%u-%llu, which is not in the master's binlog. Since the master's binlog contains GTIDs with higher sequence numbers, it probably means that the slave has diverged due to executing extra erroneous transactions"
chi: "连接从站请求从GTID%u-%u-%llu开始，这不在Master的Binlog中。由于Master的Binlog包含具有更高序列号的GTID，因此它可能意味着由于执行额外错误的交易，因此slave已经分歧"

# ER_BINLOG_MUST_BE_EMPTY
source: "This operation is not allowed if any GTID has been logged to the binary log. Run RESET MASTER first to erase the log"
chi: "如果已将任何GTID记录到二进制日志，则不允许此操作。首先运行RESET MASTER擦除日志"

# ER_NO_SUCH_QUERY
source: "Unknown query id: %lld"
chi: "未知查询ID：%lld"

# ER_BAD_BASE64_DATA
source: "Bad base64 data as position %u"
chi: "错误Base64数据作为位置%u"

# ER_INVALID_ROLE OP000
source: "Invalid role specification %`s"
chi: "无效的角色规范%`s"

# ER_INVALID_CURRENT_USER 0L000
source: "The current user is invalid"
chi: "当前用户无效"

# ER_CANNOT_GRANT_ROLE
source: "Cannot grant role '%s' to: %s"
chi: "无法将角色'%s'授予：%s"

# ER_CANNOT_REVOKE_ROLE
source: "Cannot revoke role '%s' from: %s"
chi: "无法撤消来自：%s的角色'%s'"

# ER_CHANGE_SLAVE_PARALLEL_THREADS_ACTIVE
source: "Cannot change @@slave_parallel_threads while another change is in progress"
chi: "无法更改@@slave_parallel_threads，而另一个更改正在进行中"

# ER_PRIOR_COMMIT_FAILED
source: "Commit failed due to failure of an earlier commit on which this one depends"
chi: "由于早期提交的失败取决于依赖于哪个依赖性，提交失败"

# ER_IT_IS_A_VIEW 42S02
source: "'%-.192s' is a view"
chi: "'%-.192s'是一个VIEW"

# ER_SLAVE_SKIP_NOT_IN_GTID
source: "When using parallel replication and GTID with multiple replication domains, @@sql_slave_skip_counter can not be used. Instead, setting @@gtid_slave_pos explicitly can be used to skip to after a given GTID position"
chi: "使用并行复制和带有多个复制域的GTID时，无法使用@@SQL_SLAVE_SKIP_COUNTER。相反，可以使用明确设置@@gtid_slave_pos以在给定的gtid位置之后跳到"

# ER_TABLE_DEFINITION_TOO_BIG
source: "The definition for table %`s is too big"
chi: "表%`s的定义太大了"

# ER_PLUGIN_INSTALLED
source: "Plugin '%-.192s' already installed"
chi: "插件'%-.192s'已安装"

# ER_STATEMENT_TIMEOUT 70100
source: "Query execution was interrupted (max_statement_time exceeded)"
chi: "查询执行中断（超出MAX_STATEMENT_TIME）"

# ER_SUBQUERIES_NOT_SUPPORTED 42000
source: "%s does not support subqueries or stored functions"
chi: "%s不支持子查询或存储的函数"

# ER_SET_STATEMENT_NOT_SUPPORTED 42000
source: "The system variable %.200s cannot be set in SET STATEMENT."
chi: "系统变量%.200s无法在set语句中设置。“"

# ER_UNUSED_9
source: "You should never see it"
chi: "你永远不应该看到它"

# ER_USER_CREATE_EXISTS
source: "Can't create user '%-.64s'@'%-.64s'; it already exists"
chi: "无法创建用户'%-.64s'@'%-.64s';它已经存在"

# ER_USER_DROP_EXISTS
source: "Can't drop user '%-.64s'@'%-.64s'; it doesn't exist"
chi: "无法删除用户'%-.64s'@'%-.64s';它不存在"

# ER_ROLE_CREATE_EXISTS
source: "Can't create role '%-.64s'; it already exists"
chi: "无法创建角色'%-.64s';它已经存在"

# ER_ROLE_DROP_EXISTS
source: "Can't drop role '%-.64s'; it doesn't exist"
chi: "无法删除'%-.64s'。它不存在"

# ER_CANNOT_CONVERT_CHARACTER
source: "Cannot convert '%s' character 0x%-.64s to '%s'"
chi: "无法将'%s'字符0x转换为0x%-.64s到'%s'"

# ER_INVALID_DEFAULT_VALUE_FOR_FIELD 22007
source: "Incorrect default value '%-.128T' for column '%.192s'"
chi: "列的默认值不正确'%-.128T' '%.192s'"

# ER_KILL_QUERY_DENIED_ERROR
source: "You are not owner of query %lu"
chi: "你不是查询%lu的所有者"

# ER_NO_EIS_FOR_FIELD
source: "Engine-independent statistics are not collected for column '%s'"
chi: "没有收集无关的统计信息列'%s'"

# ER_WARN_AGGFUNC_DEPENDENCE
source: "Aggregate function '%-.192s)' of SELECT #%d belongs to SELECT #%d"
chi: "聚合函数'%-.192s）'SELECT＃%d的属于选择＃%d"

# WARN_INNODB_PARTITION_OPTION_IGNORED
source: "<%-.64s> option ignored for InnoDB partition"
chi: "<%-.64s> innodb分区忽略的选项"

# ER_FILE_CORRUPT
source: "File %s is corrupted"
chi: "文件%s已损坏"

# ER_ERROR_ON_MASTER
source: "Query partially completed on the master (error on master: %d) and was aborted. There is a chance that your master is inconsistent at this point. If you are sure that your master is ok, run this query manually on the slave and then restart the slave with SET GLOBAL SQL_SLAVE_SKIP_COUNTER=1; START SLAVE;. Query:'%s'"
chi: "查询在主设备上部分完成（主设备：%d）并中止。你的master在这一点上有可能不一致。如果您确定您的主站是可以的，请在从站上手动运行此查询，然后使用SET GLOBAL SQL_SLAVE_SKIP_COUNTER = 1; START SLAVE ;查询：'%s'"

# ER_INCONSISTENT_ERROR
source: "Query caused different errors on master and slave. Error on master: message (format)='%s' error code=%d; Error on slave:actual message='%s', error code=%d. Default database:'%s'. Query:'%s'"
chi: "查询在主站和从站上引起了不同的错误。主站错误：消息（格式）='%s'错误代码=%d;从站错误：实际消息='%s'，错误代码=%d。默认数据库：'%s'。查询：'%s'"

# ER_STORAGE_ENGINE_NOT_LOADED
source: "Storage engine for table '%s'.'%s' is not loaded."
chi: "表'%s'的存储引擎'%s'没有加载。"

# ER_GET_STACKED_DA_WITHOUT_ACTIVE_HANDLER 0Z002
source: "GET STACKED DIAGNOSTICS when handler not active"
chi: "处理程序未激活时GET STACKED DIAGNOSTICS"

# ER_WARN_LEGACY_SYNTAX_CONVERTED
source: "%s is no longer supported. The statement was converted to %s."
chi: "不再支持%s。该语句被转换为%s。"

# ER_BINLOG_UNSAFE_FULLTEXT_PLUGIN
source: "Statement is unsafe because it uses a fulltext parser plugin which may not return the same value on the slave."
chi: "语句不安全，因为它使用全文解析器插件，它可能不会在从站上返回相同的值。"

# ER_CANNOT_DISCARD_TEMPORARY_TABLE
source: "Cannot DISCARD/IMPORT tablespace associated with temporary table"
chi: "无法丢弃与临时表相关联的/导入表空间"

# ER_FK_DEPTH_EXCEEDED
source: "Foreign key cascade delete/update exceeds max depth of %d."
chi: "外键级联删除/更新超出了%d的最大深度。"

# ER_COL_COUNT_DOESNT_MATCH_PLEASE_UPDATE_V2
source: "Column count of %s.%s is wrong. Expected %d, found %d. Created with MariaDB %d, now running %d. Please use mariadb-upgrade to fix this error."
chi: "列数为%s.%s是错误的。预期的%d，找到%d。使用MariaDB%d创建，现在运行%d。请使用mariadb-upgrade来修复此错误。"

# ER_WARN_TRIGGER_DOESNT_HAVE_CREATED
source: "Trigger %s.%s.%s does not have CREATED attribute."
chi: "触发器%s.%s.%s没有CREATE属性。"

# ER_REFERENCED_TRG_DOES_NOT_EXIST_MYSQL
source: "Referenced trigger '%s' for the given action time and event type does not exist."
chi: "引用的触发器'%s'用于给定的动作时间和事件类型不存在。"

# ER_EXPLAIN_NOT_SUPPORTED
source: "EXPLAIN FOR CONNECTION command is supported only for SELECT/UPDATE/INSERT/DELETE/REPLACE"
chi: "EXPLAIN FOR CONNECTION仅支持SELECT/UPDATE/INSERT/DELETE/REPLACE"

# ER_INVALID_FIELD_SIZE
source: "Invalid size for column '%-.192s'."
chi: "列'%-.192s'的大小无效。"

# ER_MISSING_HA_CREATE_OPTION
source: "Table storage engine '%-.64s' found required create option missing"
chi: "表存储引擎'%-.64s'所找到的必备创建选项丢失"

# ER_ENGINE_OUT_OF_MEMORY
source: "Out of memory in storage engine '%-.64s'."
chi: "存储引擎'%-.64s'中的内存不足。"

# ER_PASSWORD_EXPIRE_ANONYMOUS_USER
source: "The password for anonymous user cannot be expired."
chi: "匿名用户的密码不能过期。"

# ER_SLAVE_SQL_THREAD_MUST_STOP
source: "This operation cannot be performed with a running slave sql thread; run STOP SLAVE SQL_THREAD first"
chi: "无法使用正在运行的从SQL线程执行此操作;首先运行STOP SLAVE SQL_THREAD"

# ER_NO_FT_MATERIALIZED_SUBQUERY
source: "Cannot create FULLTEXT index on materialized subquery"
chi: "无法在物化的子查询上创建FullText索引"

# ER_INNODB_UNDO_LOG_FULL
source: "Undo Log error: %s"
chi: "撤消日志错误：%s"

# ER_INVALID_ARGUMENT_FOR_LOGARITHM 2201E
source: "Invalid argument for logarithm"
chi: "对数的参数无效"

# ER_SLAVE_CHANNEL_IO_THREAD_MUST_STOP
source: "This operation cannot be performed with a running slave io thread; run STOP SLAVE IO_THREAD FOR CHANNEL '%s' first."
chi: "无法使用正在运行的slave IO线程执行此操作;首先运行STOP SLAVE IO_THREAD FOR CHANNEL'%s'。"

# ER_WARN_OPEN_TEMP_TABLES_MUST_BE_ZERO
source: "This operation may not be safe when the slave has temporary tables. The tables will be kept open until the server restarts or until the tables are deleted by any replicated DROP statement. Suggest to wait until slave_open_temp_tables = 0."
chi: "当从站具有临时表时，此操作可能不安全。表将保持打开，直到服务器重新启动或通过任何复制的DROP语句删除表。建议等到Slave_open_temp_tables = 0。"

# ER_WARN_ONLY_MASTER_LOG_FILE_NO_POS
source: "CHANGE MASTER TO with a MASTER_LOG_FILE clause but no MASTER_LOG_POS clause may not be safe. The old position value may not be valid for the new binary log file."
chi: "使用CHANGE MASTER TO master_log_file子句更改master，但没有master_log_pos子句可能不安全。旧位置值可能对新的二进制日志文件无效。"

# ER_QUERY_TIMEOUT
source: "Query execution was interrupted, maximum statement execution time exceeded"
chi: "查询执行中断，超过了最大语句执行时间"

# ER_NON_RO_SELECT_DISABLE_TIMER
source: "Select is not a read only statement, disabling timer"
chi: "SELECT不是只读语句，禁用计时器"

# ER_DUP_LIST_ENTRY
source: "Duplicate entry '%-.192s'."
chi: "重复条目'%-.192s'。"

# ER_SQL_MODE_NO_EFFECT
source: "'%s' mode no longer has any effect. Use STRICT_ALL_TABLES or STRICT_TRANS_TABLES instead."
chi: "'%s'模式不再有任何效果。使用STRICT_ALL_TABLES或STRICT_TRANS_TABLES。"

# ER_AGGREGATE_ORDER_FOR_UNION
source: "Expression #%u of ORDER BY contains aggregate function and applies to a UNION"
chi: "表达式＃%u ORDER BY包含聚合函数并适用于UNION"

# ER_AGGREGATE_ORDER_NON_AGG_QUERY
source: "Expression #%u of ORDER BY contains aggregate function and applies to the result of a non-aggregated query"
chi: "表达式＃%u通过包含聚合函数，并适用于非聚合查询的结果"

# ER_SLAVE_WORKER_STOPPED_PREVIOUS_THD_ERROR
source: "Slave worker has stopped after at least one previous worker encountered an error when slave-preserve-commit-order was enabled. To preserve commit order, the last transaction executed by this thread has not been committed. When restarting the slave after fixing any failed threads, you should fix this worker as well."
chi: "在启用了slave保存提交次序时至少有一个以前的工人遇到错误后，slave工作者已停止。要保留提交次序，此线程执行的最后一项事务尚未提交。在修复任何故障线程后重新启动从站时，您也应该修复此工作人。"

# ER_DONT_SUPPORT_SLAVE_PRESERVE_COMMIT_ORDER
source: "slave_preserve_commit_order is not supported %s."
chi: "slave_preerve_commit_order不支持%s。"

# ER_SERVER_OFFLINE_MODE
source: "The server is currently in offline mode"
chi: "服务器目前处于离线模式"

# ER_GIS_DIFFERENT_SRIDS
source: "Binary geometry function %s given two geometries of different srids: %u and %u, which should have been identical."
chi: "二进制几何函数%s给定两个不同SRID的几何形状：%u和%u，应该是相同的。"

# ER_GIS_UNSUPPORTED_ARGUMENT
source: "Calling geometry function %s with unsupported types of arguments."
chi: "调用几何函数%s与不受支持类型的参数。"

# ER_GIS_UNKNOWN_ERROR
source: "Unknown GIS error occurred in function %s."
chi: "未知的GIS错误发生在功能%s中。"

# ER_GIS_UNKNOWN_EXCEPTION
source: "Unknown exception caught in GIS function %s."
chi: "在GIS功能%s中捕获的未知异常。"

# ER_GIS_INVALID_DATA 22023
source: "Invalid GIS data provided to function %s."
chi: "提供给功能%s的GIS数据无效。"

# ER_BOOST_GEOMETRY_EMPTY_INPUT_EXCEPTION
source: "The geometry has no data in function %s."
chi: "几何形状在功能%s中没有数据。"

# ER_BOOST_GEOMETRY_CENTROID_EXCEPTION
source: "Unable to calculate centroid because geometry is empty in function %s."
chi: "无法计算质心，因为在功能%s中几何为空。"

# ER_BOOST_GEOMETRY_OVERLAY_INVALID_INPUT_EXCEPTION
source: "Geometry overlay calculation error: geometry data is invalid in function %s."
chi: "几何叠加计算错误：几何数据在功能%s中无效。"

# ER_BOOST_GEOMETRY_TURN_INFO_EXCEPTION
source: "Geometry turn info calculation error: geometry data is invalid in function %s."
chi: "几何旋转信息计算错误：几何数据在功能%s中无效。"

# ER_BOOST_GEOMETRY_SELF_INTERSECTION_POINT_EXCEPTION
source: "Analysis procedures of intersection points interrupted unexpectedly in function %s."
chi: "在功能%s中出乎意料地中断交叉点的分析程序。"

# ER_BOOST_GEOMETRY_UNKNOWN_EXCEPTION
source: "Unknown exception thrown in function %s."
chi: "在功能%s中抛出的未知异常。"

# ER_STD_BAD_ALLOC_ERROR
source: "Memory allocation error: %-.256s in function %s."
chi: "内存分配错误：%-.256s。函数%s。"

# ER_STD_DOMAIN_ERROR
source: "Domain error: %-.256s in function %s."
chi: "域名错误：%-.256s. 函数%s"

# ER_STD_LENGTH_ERROR
source: "Length error: %-.256s in function %s."
chi: "长度误差：%-.256s函数%s。"

# ER_STD_INVALID_ARGUMENT
source: "Invalid argument error: %-.256s in function %s."
chi: "无效的参数错误：%-.256s函数%s。"

# ER_STD_OUT_OF_RANGE_ERROR
source: "Out of range error: %-.256s in function %s."
chi: "超出范围错误：%-.256s 函数%s。"

# ER_STD_OVERFLOW_ERROR
source: "Overflow error: %-.256s in function %s."
chi: "溢出错误：%-.256s。功能%s。"

# ER_STD_RANGE_ERROR
source: "Range error: %-.256s in function %s."
chi: "范围错误：%-.256s函数%s。"

# ER_STD_UNDERFLOW_ERROR
source: "Underflow error: %-.256s in function %s."
chi: "下溢错误：%-.256s函数%s。"

# ER_STD_LOGIC_ERROR
source: "Logic error: %-.256s in function %s."
chi: "逻辑错误：%-.256s 函数%s。"

# ER_STD_RUNTIME_ERROR
source: "Runtime error: %-.256s in function %s."
chi: "运行时错误：%-.256s函数%s。"

# ER_STD_UNKNOWN_EXCEPTION
source: "Unknown exception: %-.384s in function %s."
chi: "未知例外：%-.384s在函数%s中。"

# ER_GIS_DATA_WRONG_ENDIANESS
source: "Geometry byte string must be little endian."
chi: "几何字节字符串必须是小endian。"

# ER_CHANGE_MASTER_PASSWORD_LENGTH
source: "The password provided for the replication user exceeds the maximum length of 32 characters"
chi: "为Replication User提供的密码超过32个字符的最大长度"

# ER_USER_LOCK_WRONG_NAME 42000
source: "Incorrect user-level lock name '%-.192s'."
chi: "用户级锁名名称'%-.192s'不正确。"

# ER_USER_LOCK_DEADLOCK
source: "Deadlock found when trying to get user-level lock; try rolling back transaction/releasing locks and restarting lock acquisition."
chi: "在尝试获得用户级锁时发现死锁;尝试回滚交易/释放锁定并重新启动锁定采集。"

# ER_REPLACE_INACCESSIBLE_ROWS
source: "REPLACE cannot be executed as it requires deleting rows that are not in the view"
chi: "无法执行REPLACE，因为它需要删除不在视图中的行"

# ER_ALTER_OPERATION_NOT_SUPPORTED_REASON_GIS
source: "Do not support online operation on table with GIS index"
chi: "不要支持使用GIS索引的表中的在线操作"

# ER_WITH_COL_WRONG_LIST
source: "WITH column list and SELECT field list have different column counts"
chi: "使用列列表并选择字段列表具有不同的列计数"

# ER_TOO_MANY_DEFINITIONS_IN_WITH_CLAUSE
source: "Too many WITH elements in WITH clause"
chi: "WITH条款中的元素太多了"

# ER_DUP_QUERY_NAME
source: "Duplicate query name %`-.64s in WITH clause"
chi: "WITH子句重复查询名称%`-.64s"

# ER_RECURSIVE_WITHOUT_ANCHORS
source: "No anchors for recursive WITH element '%s'"
chi: "没有元素'%s'递归的锚点"

# ER_UNACCEPTABLE_MUTUAL_RECURSION
source: "Unacceptable mutual recursion with anchored table '%s'"
chi: "锚定表'%s'不可接受的相互递归"

# ER_REF_TO_RECURSIVE_WITH_TABLE_IN_DERIVED
source: "Reference to recursive WITH table '%s' in materialized derived"
chi: "物质化的衍生参考指向递归的WITH 表'%s'"

# ER_NOT_STANDARD_COMPLIANT_RECURSIVE
source: "Restrictions imposed on recursive definitions are violated for table '%s'"
chi: "表'%s'违反了递归定义的限制"

# ER_WRONG_WINDOW_SPEC_NAME
source: "Window specification with name '%s' is not defined"
chi: "没有定义名称'%s'的窗口规范"

# ER_DUP_WINDOW_NAME
source: "Multiple window specifications with the same name '%s'"
chi: "具有相同名称'%s'的多个窗口规范"

# ER_PARTITION_LIST_IN_REFERENCING_WINDOW_SPEC
source: "Window specification referencing another one '%s' cannot contain partition list"
chi: "窗口规范引用另一个'%s'不能包含分区列表"

# ER_ORDER_LIST_IN_REFERENCING_WINDOW_SPEC
source: "Referenced window specification '%s' already contains order list"
chi: "引用的窗口规范'%s'已包含次序列表"

# ER_WINDOW_FRAME_IN_REFERENCED_WINDOW_SPEC
source: "Referenced window specification '%s' cannot contain window frame"
chi: "引用的窗口规范'%s'不能包含窗口框架"

# ER_BAD_COMBINATION_OF_WINDOW_FRAME_BOUND_SPECS
source: "Unacceptable combination of window frame bound specifications"
chi: "窗框绑定规格的不可接受的组合"

# ER_WRONG_PLACEMENT_OF_WINDOW_FUNCTION
source: "Window function is allowed only in SELECT list and ORDER BY clause"
chi: "窗口函数仅在SELECT列表和ORDER BY子句中允许"

# ER_WINDOW_FUNCTION_IN_WINDOW_SPEC
source: "Window function is not allowed in window specification"
chi: "窗口规范中不允许窗口功能"

# ER_NOT_ALLOWED_WINDOW_FRAME
source: "Window frame is not allowed with '%s'"
chi: "窗框不允许使用'%s'"

# ER_NO_ORDER_LIST_IN_WINDOW_SPEC
source: "No order list in window specification for '%s'"
chi: "在“%s”的窗口规范中没有订单列表"

# ER_RANGE_FRAME_NEEDS_SIMPLE_ORDERBY
source: "RANGE-type frame requires ORDER BY clause with single sort key"
chi: "范围型框架需要单个排序键订购逐个条款"

# ER_WRONG_TYPE_FOR_ROWS_FRAME
source: "Integer is required for ROWS-type frame"
chi: "行类型框架需要整数"

# ER_WRONG_TYPE_FOR_RANGE_FRAME
source: "Numeric datatype is required for RANGE-type frame"
chi: "范围类型框架需要数字数据类型"

# ER_FRAME_EXCLUSION_NOT_SUPPORTED
source: "Frame exclusion is not supported yet"
chi: "帧排除尚不支持"

# ER_WINDOW_FUNCTION_DONT_HAVE_FRAME
source: "This window function may not have a window frame"
chi: "此窗口功能可能没有窗口框架"

# ER_INVALID_NTILE_ARGUMENT
source: "Argument of NTILE must be greater than 0"
chi: "NTILE的参数必须大于0"

# ER_CONSTRAINT_FAILED 23000
source: "CONSTRAINT %`s failed for %`-.192s.%`-.192s"
chi: "CONSTRAINT %`s失败的%`-.192s。%`-.192s"

# ER_EXPRESSION_IS_TOO_BIG
source: "Expression in the %s clause is too big"
chi: "%s条款中的表达太大了"

# ER_ERROR_EVALUATING_EXPRESSION
source: "Got an error evaluating stored expression %s"
chi: "获得了一个错误评估存储的表达式%s"

# ER_CALCULATING_DEFAULT_VALUE
source: "Got an error when calculating default value for %`s"
chi: "计算默认值为%`s时出错"

# ER_EXPRESSION_REFERS_TO_UNINIT_FIELD 01000
source: "Expression for field %`-.64s is referring to uninitialized field %`s"
chi: "字段%`-.64s的表达指的是未初始化的字段%`s"

# ER_PARTITION_DEFAULT_ERROR
source: "Only one DEFAULT partition allowed"
chi: "只允许一个默认分区"

# ER_REFERENCED_TRG_DOES_NOT_EXIST
source: "Referenced trigger '%s' for the given action time and event type does not exist"
chi: "给定动作时间和事件类型的引用触发'%s'不存在"

# ER_INVALID_DEFAULT_PARAM
source: "Default/ignore value is not supported for such parameter usage"
chi: "此类参数使用不支持默认/忽略值"

# ER_BINLOG_NON_SUPPORTED_BULK
source: "Only row based replication supported for bulk operations"
chi: "仅支持基于行的复制，支持批量操作"

# ER_BINLOG_UNCOMPRESS_ERROR
source: "Uncompress the compressed binlog failed"
chi: "解压压缩的binlog失败"
