Repository: vladbogo/test-translation
Catalog: chi.xlf
Languages: chi

# ER_NONEXISTING_PROC_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s' on routine '%-.192s'"
chi: "无授权：用户'%-.48s'主机'%-.64s'ROUTINE'%-.192s'"

# ER_PROC_AUTO_GRANT_FAIL
source: "Failed to grant EXECUTE and ALTER ROUTINE privileges"
chi: "无法授予EXECUTE和ALTER ROUTINE权限"

# ER_PROC_AUTO_REVOKE_FAIL
source: "Failed to revoke all privileges to dropped routine"
chi: "无法撤消所有权限以删除例程"

# ER_DATA_TOO_LONG 22001
source: "Data too long for column '%s' at row %lu"
chi: "列'%s'行%lu数据太长"

# ER_SP_BAD_SQLSTATE 42000
source: "Bad SQLSTATE: '%s'"
chi: "坏SQLSTATE：'%s'"

# ER_STARTUP
source: "%s: ready for connections.\nVersion: '%s' socket: '%s' port: %d %s"
chi: "%s：已经准备好接受连接\nVersion：'%s'套接字：'%s'端口：%d %s"

# ER_LOAD_FROM_FIXED_SIZE_ROWS_TO_VAR
source: "Can't load value from file with fixed size rows to variable"
chi: "无法从带有固定大小行的文件中加载值到变量"

# ER_CANT_CREATE_USER_WITH_GRANT 42000
source: "You are not allowed to create a user with GRANT"
chi: "您不允许使用创建用户时给予GRANT"

# ER_WRONG_VALUE_FOR_TYPE
source: "Incorrect %-.32s value: '%-.128T' for function %-.32s"
chi: "不正确的%-.32s值：'%-.128T' 函数：%-.32s"

# ER_TABLE_DEF_CHANGED
source: "Table definition has changed, please retry transaction"
chi: "表定义已更改，请重试"

# ER_SP_DUP_HANDLER 42000
source: "Duplicate handler declared in the same block"
chi: "在同一块中声明的处理程序重复"

# ER_SP_NOT_VAR_ARG 42000
source: "OUT or INOUT argument %d for routine %s is not a variable or NEW pseudo-variable in BEFORE trigger"
chi: "OUT或INOUT参数%d 例程 %s的不是BEFORE触发器里的变量或新伪变量"

# ER_SP_NO_RETSET 0A000
source: "Not allowed to return a result set from a %s"
chi: "不允许从%s返回结果集"

# ER_CANT_CREATE_GEOMETRY_OBJECT 22003
source: "Cannot get geometry object from data you send to the GEOMETRY field"
chi: "无法从发送到几何字段的数据中获取几何对象"

# ER_FAILED_ROUTINE_BREAK_BINLOG
source: "A routine failed and has neither NO SQL nor READS SQL DATA in its declaration and binary logging is enabled; if non-transactional tables were updated, the binary log will miss their changes"
chi: "ROUTINE失败，定义中既没有NO SQL也没有READ SQL DAT。启用二进制日志记录;如果更新非事务性表，则二进制日志将会错过其更改"

# ER_BINLOG_UNSAFE_ROUTINE
source: "This function has none of DETERMINISTIC, NO SQL, or READS SQL DATA in its declaration and binary logging is enabled (you *might* want to use the less safe log_bin_trust_function_creators variable)"
chi: "此函数定义中没有DETERMINISTIC，NO SQL，或者READS SQL DATA，并且已启用二进制日志记录（您*可能*希望使用较少的安全性的log_bin_trust_function_creators变量）"

# ER_BINLOG_CREATE_ROUTINE_NEED_SUPER
source: "You do not have the SUPER privilege and binary logging is enabled (you *might* want to use the less safe log_bin_trust_function_creators variable)"
chi: "您没有超级特权和二进制日志记录已启用（您*可能*想要使用较少的安全log_bin_trust_function_creators变量）"

# ER_EXEC_STMT_WITH_OPEN_CURSOR
source: "You can't execute a prepared statement which has an open cursor associated with it. Reset the statement to re-execute it"
chi: "您无法执行具有与之关联的打开Cursor的prepared statement。重置语句以重新执行它"

# ER_STMT_HAS_NO_OPEN_CURSOR
source: "The statement (%lu) has no open cursor"
chi: "语句（%lu）没有开放的Cursor"

# ER_COMMIT_NOT_ALLOWED_IN_SF_OR_TRG
source: "Explicit or implicit commit is not allowed in stored function or trigger"
chi: "在存储的函数或触发器中不允许显式或隐式提交"

# ER_NO_DEFAULT_FOR_VIEW_FIELD
source: "Field of view '%-.192s.%-.192s' underlying table doesn't have a default value"
chi: "VIEW的列'%-.192s.%-.192s'底层表没有默认值"

# ER_SP_NO_RECURSION
source: "Recursive stored functions and triggers are not allowed"
chi: "不允许递归存储功能和触发器"

# ER_TOO_BIG_SCALE 42000 S1009
source: "Too big scale specified for '%-.192s'. Maximum is %u"
chi: "指定的大规模为'%-.192s'。最大是%u"

# ER_TOO_BIG_PRECISION 42000 S1009
source: "Too big precision specified for '%-.192s'. Maximum is %u"
chi: "指定的精度太大 '%-.192s'。最大是%u"

# ER_M_BIGGER_THAN_D 42000 S1009
source: "For float(M,D), double(M,D) or decimal(M,D), M must be >= D (column '%-.192s')"
chi: "对于FLOAT（M，D），DOUBLE（M，D）或DECIMAL（M，D），M必须> = D（列'%-.192s'）"

# ER_WRONG_LOCK_OF_SYSTEM_TABLE
source: "You can't combine write-locking of system tables with other tables or lock types"
chi: "您无法将系统表的写入锁定与其他表或锁定类型相结合"

# ER_CONNECT_TO_FOREIGN_DATA_SOURCE
source: "Unable to connect to foreign data source: %.64s"
chi: "无法连接到外数据源：%.64s"

# ER_QUERY_ON_FOREIGN_DATA_SOURCE
source: "There was a problem processing the query on the foreign data source. Data source error: %-.64s"
chi: "处理对外数据源上的查询时出现问题。数据源错误：%-.64s"

# ER_FOREIGN_DATA_SOURCE_DOESNT_EXIST
source: "The foreign data source you are trying to reference does not exist. Data source error: %-.64s"
chi: "您尝试引用的外数据源不存在。数据源错误：%-.64s"

# ER_FOREIGN_DATA_STRING_INVALID_CANT_CREATE
source: "Can't create federated table. The data source connection string '%-.64s' is not in the correct format"
chi: "无法创建联合表。数据源连接字符串'%-.64s'不是正确的格式"

# ER_FOREIGN_DATA_STRING_INVALID
source: "The data source connection string '%-.64s' is not in the correct format"
chi: "数据源连接字符串'%-.64s'不是正确的格式"

# ER_CANT_CREATE_FEDERATED_TABLE
source: "Can't create federated table. Foreign data src error: %-.64s"
chi: "无法创建联合表。外数据SRC错误：%-.64s"

# ER_TRG_IN_WRONG_SCHEMA
source: "Trigger in wrong schema"
chi: "触发在错的SCHEMA"

# ER_STACK_OVERRUN_NEED_MORE
source: "Thread stack overrun: %ld bytes used of a %ld byte stack, and %ld bytes needed. Consider increasing the thread_stack system variable."
chi: "线程堆栈溢出：%ld字节堆栈的%ld字节，以及所需的%ld字节。使用'mariadbd --thread_stack =＃'指定更大的堆栈"

# ER_TOO_LONG_BODY 42000 S1009
source: "Routine body for '%-.100s' is too long"
chi: "'%-.100s”的ROUTINE太长了"

# ER_WARN_CANT_DROP_DEFAULT_KEYCACHE
source: "Cannot drop default keycache"
chi: "无法删除默认索引缓存"

# ER_TOO_BIG_DISPLAYWIDTH 42000 S1009
source: "Display width out of range for '%-.192s' (max = %lu)"
chi: "显示宽度超过'%-.192s'的范围（max =%lu）"

# ER_XAER_DUPID XAE08
source: "XAER_DUPID: The XID already exists"
chi: "XAER_DUPID：xid已存在"

# ER_DATETIME_FUNCTION_OVERFLOW 22008
source: "Datetime function: %-.32s field overflow"
chi: "DateTime函数：%-.32s字段溢出"

# ER_CANT_UPDATE_USED_TABLE_IN_SF_OR_TRG
source: "Can't update table '%-.192s' in stored function/trigger because it is already used by statement which invoked this stored function/trigger"
chi: "在存储的函数/触发器中无法更新表'%-.192s'，因为它已被调用此存储的函数/触发器调用的语句"

# ER_VIEW_PREVENT_UPDATE
source: "The definition of table '%-.192s' prevents operation %-.192s on table '%-.192s'"
chi: "表'%-.192s'的定义可防止在表'%-.192s'上的操作'%-.192s'"

# ER_PS_NO_RECURSION
source: "The prepared statement contains a stored routine call that refers to that same statement. It's not allowed to execute a prepared statement in such a recursive manner"
chi: "prepared statement包含一个有关该语句的存储例程调用。它不允许以这种递归方式执行prepared statement"

# ER_SP_CANT_SET_AUTOCOMMIT
source: "Not allowed to set autocommit from a stored function or trigger"
chi: "不允许从存储的函数或触发器设置自动判处"

# ER_MALFORMED_DEFINER 0L000
source: "Invalid definer"
chi: "无效的定义"

# ER_VIEW_FRM_NO_USER
source: "View '%-.192s'.'%-.192s' has no definer information (old table format). Current user is used as definer. Please recreate the view!"
chi: "VIEW'%-.192s'。'%-.192s'没有绝定的信息（旧表格式）。当前用户用作定义。请重新创建视图！"

# ER_VIEW_OTHER_USER
source: "You need the SUPER privilege for creation view with '%-.192s'@'%-.192s' definer"
chi: "您需要使用'%-.192s'@'%-.192s'的创建视图的超级特权"

# ER_NO_SUCH_USER
source: "The user specified as a definer ('%-.64s'@'%-.64s') does not exist"
chi: "指定为定义的用户（'%-.64s'@'%-.64s'）不存在"

# ER_FORBID_SCHEMA_CHANGE
source: "Changing schema from '%-.192s' to '%-.192s' is not allowed"
chi: "不允许从'%-.192s'到'%-.192s'的SCHEMA更改"

# ER_ROW_IS_REFERENCED_2 23000
source: "Cannot delete or update a parent row: a foreign key constraint fails (%.192s)"
chi: "无法删除或更新父行：外键约束失败（%.192s）"

# ER_NO_REFERENCED_ROW_2 23000
source: "Cannot add or update a child row: a foreign key constraint fails (%.192s)"
chi: "无法添加或更新子行：外键约束失败（%.192s）"

# ER_SP_BAD_VAR_SHADOW 42000
source: "Variable '%-.64s' must be quoted with `...`, or renamed"
chi: "变量'%-.64s'必须用`...`，或重命名"

# ER_TRG_NO_DEFINER
source: "No definer attribute for trigger '%-.192s'.'%-.192s'. The trigger will be activated under the authorization of the invoker, which may have insufficient privileges. Please recreate the trigger"
chi: "触发'%-.192s'的绝对属性。'%-.192s'。触发器将在调用者的授权下激活，该权限可能不足。请重新创建触发器"

# ER_OLD_FILE_FORMAT
source: "'%-.192s' has an old format, you should re-create the '%s' object(s)"
chi: "'%-.192s'具有旧格式，您应该重新创建'%s'对象"

# ER_SP_RECURSION_LIMIT
source: "Recursive limit %d (as set by the max_sp_recursion_depth variable) was exceeded for routine %.192s"
chi: "递归限制%d（如max_sp_recursion_depth变量设置）的例程%.192s"

# ER_SP_PROC_TABLE_CORRUPT
source: "Failed to load routine %-.192s (internal code %d). For more details, run SHOW WARNINGS"
chi: "无法加载常规%-.192s（内部代码%d）。有关更多详细信息，请运行SHOW WARNINGS"

# ER_SP_WRONG_NAME 42000
source: "Incorrect routine name '%-.192s'"
chi: "常规名称错误不正确'%-.192s'"

# ER_TABLE_NEEDS_UPGRADE
source: "Upgrade required. Please do \"REPAIR %s %`s\" or dump/reload to fix it!"
chi: "需要升级。请做\"修复%s%`s \"或转储/重新加载以修复！"

# ER_SP_NO_AGGREGATE 42000
source: "AGGREGATE is not supported for stored functions"
chi: "存储函数不支持聚合"

# ER_MAX_PREPARED_STMT_COUNT_REACHED 42000
source: "Can't create more than max_prepared_stmt_count statements (current value: %u)"
chi: "无法创建超过max_prepared_stmt_count语句（当前值：%u）"

# ER_VIEW_RECURSIVE
source: "%`s.%`s contains view recursion"
chi: "%`s.%`s包含视图递归"

# ER_NON_GROUPING_FIELD_USED 42000
source: "Non-grouping field '%-.192s' is used in %-.64s clause"
chi: "非分组字段'%-.192s'用于%-.64s条款"

# ER_TABLE_CANT_HANDLE_SPKEYS
source: "The storage engine %s doesn't support SPATIAL indexes"
chi: "存储引擎%s不支持SPATIAL索引"

# ER_NO_TRIGGERS_ON_SYSTEM_SCHEMA
source: "Triggers can not be created on system tables"
chi: "无法在系统表上创建触发器"

# ER_REMOVED_SPACES
source: "Leading spaces are removed from name '%s'"
chi: "前面的空格从名称'%s'删除"

# ER_AUTOINC_READ_FAILED
source: "Failed to read auto-increment value from storage engine"
chi: "无法从存储引擎读取自动增量值"

# ER_USERNAME
source: "user name"
chi: "用户名"

# ER_HOSTNAME
source: "host name"
chi: "主机名"

# ER_WRONG_STRING_LENGTH
source: "String '%-.70T' is too long for %s (should be no longer than %d)"
chi: "字符串'%-.70T'对于%s（应不超过%d）太长"

# ER_NON_INSERTABLE_TABLE
source: "The target table %-.100s of the %s is not insertable-into"
chi: "目标表%-.100s %s不可插入"

# ER_ADMIN_WRONG_MRG_TABLE
source: "Table '%-.64s' is differently defined or of non-MyISAM type or doesn't exist"
chi: "表'%-.64s'不同定义、或非myisam类型、或不存在"

# ER_TOO_HIGH_LEVEL_OF_NESTING_FOR_SELECT
source: "Too high level of nesting for select"
chi: "太高的嵌套SELECT"

# ER_NAME_BECOMES_EMPTY
source: "Name '%-.64s' has become ''"
chi: "名'%-.64s'已成为''"

# ER_AMBIGUOUS_FIELD_TERM
source: "First character of the FIELDS TERMINATED string is ambiguous; please use non-optional and non-empty FIELDS ENCLOSED BY"
chi: "FIELDS TERMINATED字符串的第一个字符是模棱两可的;请使用非空字段FIELDS ENCLOSED BY"

# ER_FOREIGN_SERVER_EXISTS
source: "The foreign server, %s, you are trying to create already exists"
chi: "您正在尝试创建的外来服务器%s已存在"

# ER_FOREIGN_SERVER_DOESNT_EXIST
source: "The foreign server name you are trying to reference does not exist. Data source error: %-.64s"
chi: "您尝试引用的外部服务器名称不存在。数据源错误：%-.64s"

# ER_ILLEGAL_HA_CREATE_OPTION
source: "Table storage engine '%-.64s' does not support the create option '%.64s'"
chi: "表存储引擎'%-.64s'不支持创建选项'%.64s'"

# ER_PARTITION_REQUIRES_VALUES_ERROR
source: "Syntax error: %-.64s PARTITIONING requires definition of VALUES %-.64s for each partition"
chi: "语法错误：%-.64s PARTITIONING需要定义给每个分区VALUES %-.64s"

# ER_PARTITION_WRONG_VALUES_ERROR
source: "Only %-.64s PARTITIONING can use VALUES %-.64s in partition definition"
chi: "只有%-.64s PARTITIONING可以使用VALUES %-.64s在分区定义中"

# ER_PARTITION_MAXVALUE_ERROR
source: "MAXVALUE can only be used in last partition definition"
chi: "MAXVALUE只能在最后一个分区定义中使用"

# ER_PARTITION_SUBPARTITION_ERROR
source: "Subpartitions can only be hash partitions and by key"
chi: "子分区只能是哈希分区和分区列"

# ER_PARTITION_SUBPART_MIX_ERROR
source: "Must define subpartitions on all partitions if on one partition"
chi: "如果在一个分区上，必须在所有分区上定义子组分"

# ER_PARTITION_WRONG_NO_PART_ERROR
source: "Wrong number of partitions defined, mismatch with previous setting"
chi: "定义了错误的分区数，与以前的设置不匹配"

# ER_PARTITION_WRONG_NO_SUBPART_ERROR
source: "Wrong number of subpartitions defined, mismatch with previous setting"
chi: "错误的子组分数定义，与以前的设置不匹配"

# ER_WRONG_EXPR_IN_PARTITION_FUNC_ERROR
source: "Constant, random or timezone-dependent expressions in (sub)partitioning function are not allowed"
chi: "不允许（子）分区功能中的常量，随机或时区依赖表达式"

# ER_NOT_CONSTANT_EXPRESSION
source: "Expression in %s must be constant"
chi: "%s中的表达必须是恒定的"

# ER_FIELD_NOT_FOUND_PART_ERROR
source: "Field in list of fields for partition function not found in table"
chi: "在表中找不到分区功能的字段列表中的字段"

# ER_LIST_OF_FIELDS_ONLY_IN_HASH_ERROR
source: "List of fields is only allowed in KEY partitions"
chi: "只允许在索引分区中允许字段列表"

# ER_INCONSISTENT_PARTITION_INFO_ERROR
source: "The partition info in the frm file is not consistent with what can be written into the frm file"
chi: "FRM文件中的分区信息不与可以写入FRM文件的内容一致"

# ER_PARTITION_FUNC_NOT_ALLOWED_ERROR
source: "The %-.192s function returns the wrong type"
chi: "%-.192s函数返回错误的类型"

# ER_PARTITIONS_MUST_BE_DEFINED_ERROR
source: "For %-.64s partitions each partition must be defined"
chi: "对于%-.64s分区必须定义每个分区"

# ER_RANGE_NOT_INCREASING_ERROR
source: "VALUES LESS THAN value must be strictly increasing for each partition"
chi: "每个分区的VALUES LESS THAN的值必须严格增加"

# ER_INCONSISTENT_TYPE_OF_FUNCTIONS_ERROR
source: "VALUES value must be of same type as partition function"
chi: "VALUES值必须与分区函数相同"

# ER_MULTIPLE_DEF_CONST_IN_LIST_PART_ERROR
source: "Multiple definition of same constant in list partitioning"
chi: "列表分区中相同常量的多个定义"

# ER_PARTITION_ENTRY_ERROR
source: "Partitioning can not be used stand-alone in query"
chi: "分区不能在查询中独立使用"

# ER_MIX_HANDLER_ERROR
source: "The mix of handlers in the partitions is not allowed in this version of MariaDB"
chi: "此版本的MariaDB中不允许分区中的处理程序混合"

# ER_PARTITION_NOT_DEFINED_ERROR
source: "For the partitioned engine it is necessary to define all %-.64s"
chi: "对于分区引擎，需要定义所有%-.64s"

# ER_TOO_MANY_PARTITIONS_ERROR
source: "Too many partitions (including subpartitions) were defined"
chi: "定义了太多分区（包括子组分）"

# ER_SUBPARTITION_ERROR
source: "It is only possible to mix RANGE/LIST partitioning with HASH/KEY partitioning for subpartitioning"
chi: "只有在子节分节的HASH/KEY分区中可以混合RANGE/LIST分区"

# ER_CANT_CREATE_HANDLER_FILE
source: "Failed to create specific handler file"
chi: "无法创建特定的处理程序文件"

# ER_BLOB_FIELD_IN_PART_FUNC_ERROR
source: "A BLOB field is not allowed in partition function"
chi: "分区功能中不允许BLOB字段"

# ER_UNIQUE_KEY_NEED_ALL_FIELDS_IN_PF
source: "A %-.192s must include all columns in the table's partitioning function"
chi: "A%-.192s必须包含表的分区功能中的所有列"

# ER_NO_PARTS_ERROR
source: "Number of %-.64s = 0 is not an allowed value"
chi: "不允许%-.64s = 0"

# ER_PARTITION_MGMT_ON_NONPARTITIONED
source: "Partition management on a not partitioned table is not possible"
chi: "不分区表上的分区管理是不可能的"

# ER_PARTITION_DOES_NOT_EXIST
source: "Wrong partition name or partition list"
chi: "分区名称或分区列表错误"

# ER_DROP_LAST_PARTITION
source: "Cannot remove all partitions, use DROP TABLE instead"
chi: "无法删除所有分区，请使用删除表"

# ER_COALESCE_ONLY_ON_HASH_PARTITION
source: "COALESCE PARTITION can only be used on HASH/KEY partitions"
chi: "COALESCE分区只能用于哈希/索引分区"

# ER_REORG_HASH_ONLY_ON_SAME_NO
source: "REORGANIZE PARTITION can only be used to reorganize partitions not to change their numbers"
chi: "REORGANIZE PARTITION只能用于重新组织不改变他们的数字的分区"

# ER_REORG_NO_PARAM_ERROR
source: "REORGANIZE PARTITION without parameters can only be used on auto-partitioned tables using HASH PARTITIONs"
chi: "没有参数的REORGANIZE PARTITION只能用于HASH PARTITION的自动分区表"

# ER_ONLY_ON_RANGE_LIST_PARTITION
source: "%-.64s PARTITION can only be used on RANGE/LIST partitions"
chi: "%-.64s分区只能用于RANGE/LIST分区"

# ER_ADD_PARTITION_SUBPART_ERROR
source: "Trying to Add partition(s) with wrong number of subpartitions"
chi: "尝试用错误数量的子分区添加分区"

# ER_ADD_PARTITION_NO_NEW_PARTITION
source: "At least one partition must be added"
chi: "必须添加至少一个分区"

# ER_COALESCE_PARTITION_NO_PARTITION
source: "At least one partition must be coalesced"
chi: "至少一个分区必须合并"

# ER_REORG_PARTITION_NOT_EXIST
source: "More partitions to reorganize than there are partitions"
chi: "分区重组量超过而不是分区量"

# ER_SAME_NAME_PARTITION
source: "Duplicate partition name %-.192s"
chi: "重复分区名称%-.192s"

# ER_NO_BINLOG_ERROR
source: "It is not allowed to shut off binlog on this command"
chi: "在此命令上不允许关闭binlog"

# ER_CONSECUTIVE_REORG_PARTITIONS
source: "When reorganizing a set of partitions they must be in consecutive order"
chi: "在重新组织一组分区时，它们必须按照次序"

# ER_REORG_OUTSIDE_RANGE
source: "Reorganize of range partitions cannot change total ranges except for last partition where it can extend the range"
chi: "重组范围分区无法更改除最后分区之外的总范围，无法扩展范围"

# ER_PARTITION_FUNCTION_FAILURE
source: "Partition function not supported in this version for this handler"
chi: "此版不支持此处理程序的分区功能"

# ER_PART_STATE_ERROR
source: "Partition state cannot be defined from CREATE/ALTER TABLE"
chi: "无法从CREATE/ALTER表中定义分区状态"

# ER_LIMITED_PART_RANGE
source: "The %-.64s handler only supports 32 bit integers in VALUES"
chi: "%-.64s处理程序仅支持32-bit整数"

# ER_PLUGIN_IS_NOT_LOADED
source: "Plugin '%-.192s' is not loaded"
chi: "插件'%-.192s'未加载"

# ER_WRONG_VALUE
source: "Incorrect %-.32s value: '%-.128T'"
chi: "错误%-.32s值：'%-.128T'"

# ER_NO_PARTITION_FOR_GIVEN_VALUE
source: "Table has no partition for value %-.64s"
chi: "表没有%-.64s的分区"

# ER_FILEGROUP_OPTION_ONLY_ONCE
source: "It is not allowed to specify %s more than once"
chi: "设置%s不能超过一次"

# ER_CREATE_FILEGROUP_FAILED
source: "Failed to create %s"
chi: "无法创建%s"

# ER_DROP_FILEGROUP_FAILED
source: "Failed to drop %s"
chi: "未能DROP%s"

# ER_TABLESPACE_AUTO_EXTEND_ERROR
source: "The handler doesn't support autoextend of tablespaces"
chi: "处理程序不支持表空间的自动扩展名"

# ER_WRONG_SIZE_NUMBER
source: "A size parameter was incorrectly specified, either number or on the form 10M"
chi: "尺寸参数被错误地指定，编号或表单10M"

# ER_SIZE_OVERFLOW_ERROR
source: "The size number was correct but we don't allow the digit part to be more than 2 billion"
chi: "尺寸编号是正确的，但我们不允许数字部分超过20亿"

# ER_ALTER_FILEGROUP_FAILED
source: "Failed to alter: %s"
chi: "未能改变：%s"

# ER_BINLOG_ROW_LOGGING_FAILED
source: "Writing one row to the row-based binary log failed"
chi: "将一行写入基于行的二进制日志失败"

# ER_BINLOG_ROW_WRONG_TABLE_DEF
source: "Table definition on master and slave does not match: %s"
chi: "表定义主机和从站不匹配：%s"

# ER_BINLOG_ROW_RBR_TO_SBR
source: "Slave running with --log-slave-updates must use row-based binary logging to be able to replicate row-based binary log events"
chi: "使用--log-slave-updates的从站必须使用基于行的二进制日志记录，以便能够复制基于行的二进制日志事件"

# ER_EVENT_ALREADY_EXISTS
source: "Event '%-.192s' already exists"
chi: "事件'%-.192s'已经存在"

# ER_EVENT_STORE_FAILED
source: "Failed to store event %s. Error code %M from storage engine"
chi: "无法存储事件%s。错误代码%M来自存储引擎"

# ER_EVENT_DOES_NOT_EXIST
source: "Unknown event '%-.192s'"
chi: "未知事件'%-.192s'"

# ER_EVENT_CANT_ALTER
source: "Failed to alter event '%-.192s'"
chi: "无法改变事件'%-.192s'"

# ER_EVENT_DROP_FAILED
source: "Failed to drop %s"
chi: "未能DROP%s"

# ER_EVENT_INTERVAL_NOT_POSITIVE_OR_TOO_BIG
source: "INTERVAL is either not positive or too big"
chi: "INTERVAL为负或太大"

# ER_EVENT_ENDS_BEFORE_STARTS
source: "ENDS is either invalid or before STARTS"
chi: "ENDS无效的或在STARTS之前"

# ER_EVENT_EXEC_TIME_IN_THE_PAST
source: "Event execution time is in the past. Event has been disabled"
chi: "事件执行时间在过去。事件已被禁用"

# ER_EVENT_OPEN_TABLE_FAILED
source: "Failed to open mysql.event"
chi: "无法打开mysql.event"

# ER_EVENT_NEITHER_M_EXPR_NOR_M_AT
source: "No datetime expression provided"
chi: "没有提供DateTime表达式"

# ER_UNUSED_2
source: "You should never see it"
chi: "你永远不应该看到它"

# ER_UNUSED_3
source: "You should never see it"
chi: "你永远不应该看到它"

# ER_EVENT_CANNOT_DELETE
source: "Failed to delete the event from mysql.event"
chi: "无法从mysql.event删除该事件"

# ER_EVENT_COMPILE_ERROR
source: "Error during compilation of event's body"
chi: "在汇编事件的主体时出错"

# ER_EVENT_SAME_NAME
source: "Same old and new event name"
chi: "相同的旧活动名称"

# ER_EVENT_DATA_TOO_LONG
source: "Data for column '%s' too long"
chi: "列'%s'数据太长"

# ER_DROP_INDEX_FK
source: "Cannot drop index '%-.192s': needed in a foreign key constraint"
chi: "无法删除索引'%-.192s'：外部索引约束中需要它"

# ER_WARN_DEPRECATED_SYNTAX_WITH_VER
source: "The syntax '%s' is deprecated and will be removed in MariaDB %s. Please use %s instead"
chi: "语法'%s'被弃用，将在Mariadb%s中删除。请使用%s"

# ER_CANT_WRITE_LOCK_LOG_TABLE
source: "You can't write-lock a log table. Only read access is possible"
chi: "您无法获得日志表的写锁。只有读访问是可能的"

# ER_CANT_LOCK_LOG_TABLE
source: "You can't use locks with log tables"
chi: "您无法使用带日志表的锁"

# ER_UNUSED_4
source: "You should never see it"
chi: "你永远不应该看到它"

# ER_COL_COUNT_DOESNT_MATCH_PLEASE_UPDATE
source: "Column count of mysql.%s is wrong. Expected %d, found %d. Created with MariaDB %d, now running %d. Please use mariadb-upgrade to fix this error"
chi: "mysql的列计数。%s是错误的。预期%d，找到%d。使用MariaDB%d创建，现在运行%d。请使用mariadb-upgrade来修复此错误"

# ER_TEMP_TABLE_PREVENTS_SWITCH_OUT_OF_RBR
source: "Cannot switch out of the row-based binary log format when the session has open temporary tables"
chi: "当会话打开临时表时，无法切换出基于行的二进制日志格式"

# ER_STORED_FUNCTION_PREVENTS_SWITCH_BINLOG_FORMAT
source: "Cannot change the binary logging format inside a stored function or trigger"
chi: "无法更改存储函数或触发器内的二进制记录格式"

# ER_UNUSED_13
source: "You should never see it"
chi: "你永远不应该看到它"

# ER_PARTITION_NO_TEMPORARY
source: "Cannot create temporary table with partitions"
chi: "无法使用分区创建临时表"

# ER_PARTITION_CONST_DOMAIN_ERROR
source: "Partition constant is out of partition function domain"
chi: "分区常量超出分区功能域"

# ER_PARTITION_FUNCTION_IS_NOT_ALLOWED
source: "This partition function is not allowed"
chi: "不允许此分区功能"

# ER_DDL_LOG_ERROR
source: "Error in DDL log"
chi: "DDL日志中的错误"

# ER_NULL_IN_VALUES_LESS_THAN
source: "Not allowed to use NULL value in VALUES LESS THAN"
chi: "VALUES LESS THAN不允许使用NULL"

# ER_WRONG_PARTITION_NAME
source: "Incorrect partition name"
chi: "分区名称不正确"

# ER_CANT_CHANGE_TX_CHARACTERISTICS 25001
source: "Transaction characteristics can't be changed while a transaction is in progress"
chi: "交易正在进行，无法更改事务特性"

# ER_DUP_ENTRY_AUTOINCREMENT_CASE
source: "ALTER TABLE causes auto_increment resequencing, resulting in duplicate entry '%-.192T' for key '%-.192s'"
chi: "ALTER TABLE表会导致AUTO_INCREMENT重建，导致重复的条目'%-.192T'用于索引'%-.192s'"

# ER_EVENT_MODIFY_QUEUE_ERROR
source: "Internal scheduler error %d"
chi: "内部调度器错误%d"

# ER_EVENT_SET_VAR_ERROR
source: "Error during starting/stopping of the scheduler. Error code %M"
chi: "在开始/停止调度程序期间出错。错误代码%M"

# ER_PARTITION_MERGE_ERROR
source: "Engine cannot be used in partitioned tables"
chi: "引擎不能用于分区表"

# ER_CANT_ACTIVATE_LOG
source: "Cannot activate '%-.64s' log"
chi: "无法激活'%-.64s'日志"

# ER_RBR_NOT_AVAILABLE
source: "The server was not built with row-based replication"
chi: "服务器不是基于行的复制构建的"

# ER_BASE64_DECODE_ERROR
source: "Decoding of base64 string failed"
chi: "Base64字符串的解码失败"

# ER_EVENT_RECURSION_FORBIDDEN
source: "Recursion of EVENT DDL statements is forbidden when body is present"
chi: "EVENT主体存在时EVENT DDL语句递归被禁止"

# ER_EVENTS_DB_ERROR
source: "Cannot proceed, because event scheduler is disabled"
chi: "无法继续，因为事件调度程序已禁用"

# ER_ONLY_INTEGERS_ALLOWED
source: "Only integers allowed as number here"
chi: "这里只允许整数作为数字"

# ER_UNSUPORTED_LOG_ENGINE
source: "Storage engine %s cannot be used for log tables"
chi: "存储引擎%s不能用于日志表"

# ER_BAD_LOG_STATEMENT
source: "You cannot '%s' a log table if logging is enabled"
chi: "如果启用日志记录，则无法'%s'日志表"

# ER_CANT_RENAME_LOG_TABLE
source: "Cannot rename '%s'. When logging enabled, rename to/from log table must rename two tables: the log table to an archive table and another table back to '%s'"
chi: "无法重命名'%s'。启用日志记录时，重命名日志表必须重命名两个表：日志表到存档表，另一个表返回'%s'"

# ER_WRONG_PARAMCOUNT_TO_NATIVE_FCT 42000
source: "Incorrect parameter count in the call to native function '%-.192s'"
chi: "对本机函数的呼叫中的参数计数不正确'%-.192s'"
