Repository: vladbogo/test-translation
Catalog: chi.xlf
Languages: chi

# ER_BINLOG_READ_EVENT_CHECKSUM_FAILURE
source: "Replication event checksum verification failed while reading from a log file"
chi: "从日志文件读取时复制事件校验和验证失败"

# ER_BINLOG_STMT_CACHE_SIZE_GREATER_THAN_MAX
source: "Option binlog_stmt_cache_size (%lu) is greater than max_binlog_stmt_cache_size (%lu); setting binlog_stmt_cache_size equal to max_binlog_stmt_cache_size"
chi: "选项binlog_stmt_cache_size（%lu）大于max_binlog_stmt_cache_size（%lu）;设置binlog_stmt_cache_size等于max_binlog_stmt_cache_size"

# ER_CANT_UPDATE_TABLE_IN_CREATE_TABLE_SELECT
source: "Can't update table '%-.192s' while '%-.192s' is being created"
chi: "无法更新表'%-.192s'正在创建'%-.192s'"

# ER_PARTITION_CLAUSE_ON_NONPARTITIONED
source: "PARTITION () clause on non partitioned table"
chi: "非分区表上的PARTITION（）子句"

# ER_ROW_DOES_NOT_MATCH_GIVEN_PARTITION_SET
source: "Found a row not matching the given partition set"
chi: "发现不匹配给定分区集的行"

# ER_UNUSED_5
source: "You should never see it"
chi: "你永远不应该看到它"

# ER_CHANGE_RPL_INFO_REPOSITORY_FAILURE
source: "Failure while changing the type of replication repository: %s"
chi: "更改Replication存储库类型时失败：%s"

# ER_WARNING_NOT_COMPLETE_ROLLBACK_WITH_CREATED_TEMP_TABLE
source: "The creation of some temporary tables could not be rolled back"
chi: "无法回滚一些临时表的创建"

# ER_WARNING_NOT_COMPLETE_ROLLBACK_WITH_DROPPED_TEMP_TABLE
source: "Some temporary tables were dropped, but these operations could not be rolled back"
chi: "一些临时表被删除，但这些操作无法回滚"

# ER_MTS_FEATURE_IS_NOT_SUPPORTED
source: "%s is not supported in multi-threaded slave mode. %s"
chi: "%s不支持多线程从模式。%s."

# ER_MTS_UPDATED_DBS_GREATER_MAX
source: "The number of modified databases exceeds the maximum %d; the database names will not be included in the replication event metadata"
chi: "修改的数据库的数量超过了最大%d;数据库名称不会包含在Replication事件元数据中"

# ER_MTS_CANT_PARALLEL
source: "Cannot execute the current event group in the parallel mode. Encountered event %s, relay-log name %s, position %s which prevents execution of this event group in parallel mode. Reason: %s"
chi: "无法以并行模式执行当前事件组。遇到事件%s，中继日志名称%s，position%s，它防止并行模式执行此事件组。原因：%s"

# ER_FULLTEXT_NOT_SUPPORTED_WITH_PARTITIONING
source: "FULLTEXT index is not supported for partitioned tables"
chi: "分区表不支持FullText索引"

# ER_DA_INVALID_CONDITION_NUMBER 35000
source: "Invalid condition number"
chi: "无效条件号"

# ER_INSECURE_PLAIN_TEXT
source: "Sending passwords in plain text without SSL/TLS is extremely insecure"
chi: "在没有SSL/TLS的纯文本中发送密码非常不安全"

# ER_INSECURE_CHANGE_MASTER
source: "Storing MariaDB user name or password information in the master.info repository is not secure and is therefore not recommended. Please see the MariaDB Manual for more about this issue and possible alternatives"
chi: "在Master.Info存储库中存储MariaDB用户名或密码信息不安全，因此不建议使用。有关此问题和可能的替代方案，请参阅MariaDB手册"

# ER_FOREIGN_DUPLICATE_KEY_WITH_CHILD_INFO 23000 S1009
source: "Foreign key constraint for table '%.192s', record '%-.192s' would lead to a duplicate entry in table '%.192s', key '%.192s'"
chi: "表'%.192s'的外键约束，记录'%-.192s'会导致表'%.192s'中的重复条目，键'%.192s'"

# ER_FOREIGN_DUPLICATE_KEY_WITHOUT_CHILD_INFO 23000 S1009
source: "Foreign key constraint for table '%.192s', record '%-.192s' would lead to a duplicate entry in a child table"
chi: "表'%.192s'的外键约束，记录'%-.192s'会导致子表中的重复条目"

# ER_SQLTHREAD_WITH_SECURE_SLAVE
source: "Setting authentication options is not possible when only the Slave SQL Thread is being started"
chi: "仅在启动从SQL线程时无法设置身份验证选项"

# ER_TABLE_HAS_NO_FT
source: "The table does not have FULLTEXT index to support this query"
chi: "该表没有全文索引来支持此查询"

# ER_VARIABLE_NOT_SETTABLE_IN_SF_OR_TRIGGER
source: "The system variable %.200s cannot be set in stored functions or triggers"
chi: "无法在存储的函数或触发器中设置系统变量%.200s"

# ER_VARIABLE_NOT_SETTABLE_IN_TRANSACTION
source: "The system variable %.200s cannot be set when there is an ongoing transaction"
chi: "持续交易时，无法设置系统变量%.200s"

# ER_GTID_NEXT_IS_NOT_IN_GTID_NEXT_LIST
source: "The system variable @@SESSION.GTID_NEXT has the value %.200s, which is not listed in @@SESSION.GTID_NEXT_LIST"
chi: "系统变量@@session.gtid_next具有值%.200s，该值未在@@session.gtid_next_list中列出"

# ER_CANT_CHANGE_GTID_NEXT_IN_TRANSACTION_WHEN_GTID_NEXT_LIST_IS_NULL
source: "When @@SESSION.GTID_NEXT_LIST == NULL, the system variable @@SESSION.GTID_NEXT cannot change inside a transaction"
chi: "当@@session.gtid_next_list == null时，系统变量@@session.gtid_next无法在事务内更改"

# ER_SET_STATEMENT_CANNOT_INVOKE_FUNCTION
source: "The statement 'SET %.200s' cannot invoke a stored function"
chi: "语句'SET %.200s'无法调用存储的函数"

# ER_GTID_NEXT_CANT_BE_AUTOMATIC_IF_GTID_NEXT_LIST_IS_NON_NULL
source: "The system variable @@SESSION.GTID_NEXT cannot be 'AUTOMATIC' when @@SESSION.GTID_NEXT_LIST is non-NULL"
chi: "系统变量@@sessient.gtid_next不能是'自动'@@sessient.gtid_next_list非null时"

# ER_SKIPPING_LOGGED_TRANSACTION
source: "Skipping transaction %.200s because it has already been executed and logged"
chi: "跳过事务%.200s，因为它已经被执行和记录"

# ER_MALFORMED_GTID_SET_SPECIFICATION
source: "Malformed GTID set specification '%.200s'"
chi: "畸形GTID设置规范'%.200s'"

# ER_MALFORMED_GTID_SET_ENCODING
source: "Malformed GTID set encoding"
chi: "格式错误的GTID集编码"

# ER_MALFORMED_GTID_SPECIFICATION
source: "Malformed GTID specification '%.200s'"
chi: "畸形GTID规范'%.200s'"

# ER_GNO_EXHAUSTED
source: "Impossible to generate Global Transaction Identifier: the integer component reached the maximal value. Restart the server with a new server_uuid"
chi: "无法生成全局事务标识符：整数组件达到了最大值。用新server_uuId重新启动服务器"

# ER_BAD_SLAVE_AUTO_POSITION
source: "Parameters MASTER_LOG_FILE, MASTER_LOG_POS, RELAY_LOG_FILE and RELAY_LOG_POS cannot be set when MASTER_AUTO_POSITION is active"
chi: "当MASTER_AUTO_POSITION处于活动状态时，无法设置参数MASTER_LOG_FILE，MASTER_LOG_POS，RELAY_LOG_FILE和RELAY_LOG_POS"

# ER_AUTO_POSITION_REQUIRES_GTID_MODE_ON
source: "CHANGE MASTER TO MASTER_AUTO_POSITION = 1 can only be executed when GTID_MODE = ON"
chi: "CHANGE MASTER TO MASTER_AUTO_POSITION = 1只能在GTID_MODE = ON上执行"

# ER_CANT_DO_IMPLICIT_COMMIT_IN_TRX_WHEN_GTID_NEXT_IS_SET
source: "Cannot execute statements with implicit commit inside a transaction when GTID_NEXT != AUTOMATIC or GTID_NEXT_LIST != NULL"
chi: "当GTID_Next != AUTOMATIC 或GTID_NEXT_LIST != NULL时，无法在事务中执行语句"

# ER_GTID_MODE_2_OR_3_REQUIRES_ENFORCE_GTID_CONSISTENCY_ON
source: "GTID_MODE = ON or GTID_MODE = UPGRADE_STEP_2 requires ENFORCE_GTID_CONSISTENCY = 1"
chi: "GTID_MODE = ON或GTID_MODE = UPGRADE_STEP_2需要ENFORCE_GTID_CONSISTY = 1"

# ER_GTID_MODE_REQUIRES_BINLOG
source: "GTID_MODE = ON or UPGRADE_STEP_1 or UPGRADE_STEP_2 requires --log-bin and --log-slave-updates"
chi: "GTID_MODE = ON或UPGRADE_STEP_1或UPGRADE_STEP_2需要--log-bin和-log-slave-updates"

# ER_CANT_SET_GTID_NEXT_TO_GTID_WHEN_GTID_MODE_IS_OFF
source: "GTID_NEXT cannot be set to UUID:NUMBER when GTID_MODE = OFF"
chi: "GTID_NEXT无法设置为UUID:NUMBER 当GTID_MODE = OFF"

# ER_CANT_SET_GTID_NEXT_TO_ANONYMOUS_WHEN_GTID_MODE_IS_ON
source: "GTID_NEXT cannot be set to ANONYMOUS when GTID_MODE = ON"
chi: "GTID_NEXT无法在当GTID_MODE = ON上时设置为ANONYMOUS"

# ER_CANT_SET_GTID_NEXT_LIST_TO_NON_NULL_WHEN_GTID_MODE_IS_OFF
source: "GTID_NEXT_LIST cannot be set to a non-NULL value when GTID_MODE = OFF"
chi: "GTID_NEXT_LIST无法设置为非空值当GTID_MODE = OFF"

# ER_FOUND_GTID_EVENT_WHEN_GTID_MODE_IS_OFF
source: "Found a Gtid_log_event or Previous_gtids_log_event when GTID_MODE = OFF"
chi: "找到一个Gtid_log_event或Previous_gtids_log_event，当gtid_mode = OFF时"

# ER_GTID_UNSAFE_NON_TRANSACTIONAL_TABLE
source: "When ENFORCE_GTID_CONSISTENCY = 1, updates to non-transactional tables can only be done in either autocommitted statements or single-statement transactions, and never in the same statement as updates to transactional tables"
chi: "当Enforce_gtid_consistenty = 1时，对非事务性表的更新只能在Autocomated语句或单一语句事务中完成，而不是在与事务表中的更新相同的语句中"

# ER_GTID_UNSAFE_CREATE_SELECT
source: "CREATE TABLE ... SELECT is forbidden when ENFORCE_GTID_CONSISTENCY = 1"
chi: "CREATE TABLE...SELECT在ENFORCE_GTID_CONSISTENCY = 1时被禁止"

# ER_GTID_UNSAFE_CREATE_DROP_TEMPORARY_TABLE_IN_TRANSACTION
source: "When ENFORCE_GTID_CONSISTENCY = 1, the statements CREATE TEMPORARY TABLE and DROP TEMPORARY TABLE can be executed in a non-transactional context only, and require that AUTOCOMMIT = 1"
chi: "当ENFORCE_GTID_CONSISTENCY = 1时，语句CREATE TEMPORARY TABL和DROP TEMPORARY TABLE，只能在非事务性上下文中执行，并且要求autocommit = 1"

# ER_GTID_MODE_CAN_ONLY_CHANGE_ONE_STEP_AT_A_TIME
source: "The value of GTID_MODE can only change one step at a time: OFF <-> UPGRADE_STEP_1 <-> UPGRADE_STEP_2 <-> ON. Also note that this value must be stepped up or down simultaneously on all servers; see the Manual for instructions."
chi: "GTID_MODE的值只能一次更改一步：OFF<-> UPGRODE_STEP_1 <-> UPGRODE_STEP_2 <-> ON。另请注意，此值必须在所有服务器上同时上升或下降;有关说明，请参阅手册。“"

# ER_MASTER_HAS_PURGED_REQUIRED_GTIDS
source: "The slave is connecting using CHANGE MASTER TO MASTER_AUTO_POSITION = 1, but the master has purged binary logs containing GTIDs that the slave requires"
chi: "从机更改主站到Master_Auto_Position = 1，因此主站连接，但主设备已清除了slave需要的GTID的二进制日志"

# ER_CANT_SET_GTID_NEXT_WHEN_OWNING_GTID
source: "GTID_NEXT cannot be changed by a client that owns a GTID. The client owns %s. Ownership is released on COMMIT or ROLLBACK"
chi: "无法由拥有GTID的客户端更改GTID_NEXT。客户拥有%s。所有权在提交或回滚上发布"

# ER_UNKNOWN_EXPLAIN_FORMAT
source: "Unknown %s format name: '%s'"
chi: "未知%s格式名称：'%s'"

# ER_CANT_EXECUTE_IN_READ_ONLY_TRANSACTION 25006
source: "Cannot execute statement in a READ ONLY transaction"
chi: "无法在只读事务中执行语句"

# ER_TOO_LONG_TABLE_PARTITION_COMMENT
source: "Comment for table partition '%-.64s' is too long (max = %lu)"
chi: "表分区的评论'%-.64s'太长（max =%lu）"

# ER_SLAVE_CONFIGURATION
source: "Slave is not configured or failed to initialize properly. You must at least set --server-id to enable either a master or a slave. Additional error messages can be found in the MariaDB error log"
chi: "从站未配置或未能正确初始化。您必须至少set --server-id以启用主站或从站。可以在MariaDB错误日志中找到其他错误消息"

# ER_INNODB_FT_LIMIT
source: "InnoDB presently supports one FULLTEXT index creation at a time"
chi: "InnoDB目前一次支持一个全文索引创建"

# ER_INNODB_NO_FT_TEMP_TABLE
source: "Cannot create FULLTEXT index on temporary InnoDB table"
chi: "无法在临时InnoDB表上创建FullText索引"

# ER_INNODB_FT_WRONG_DOCID_COLUMN
source: "Column '%-.192s' is of wrong type for an InnoDB FULLTEXT index"
chi: "列'%-.192s'是innodb fulltext索引的错误类型"

# ER_INNODB_FT_WRONG_DOCID_INDEX
source: "Index '%-.192s' is of wrong type for an InnoDB FULLTEXT index"
chi: "InnoDB全文索引的索引'%-.192s'是错误的类型错误"

# ER_INNODB_ONLINE_LOG_TOO_BIG
source: "Creating index '%-.192s' required more than 'innodb_online_alter_log_max_size' bytes of modification log. Please try again"
chi: "创建索引'%-.192s'所需的多于'innodb_online_alter_log_max_size'字节的修改日志。请再试一次"

# ER_UNKNOWN_ALTER_ALGORITHM
source: "Unknown ALGORITHM '%s'"
chi: "未知算法'%s'"

# ER_UNKNOWN_ALTER_LOCK
source: "Unknown LOCK type '%s'"
chi: "未知锁定类型'%s'"

# ER_MTS_CHANGE_MASTER_CANT_RUN_WITH_GAPS
source: "CHANGE MASTER cannot be executed when the slave was stopped with an error or killed in MTS mode. Consider using RESET SLAVE or START SLAVE UNTIL"
chi: "当从站因为错误停止或以MTS模式终止时，不呢执行CHANGE MASTER。考虑使用RESET SLAVE或START SLAVE UNTIL"

# ER_MTS_RECOVERY_FAILURE
source: "Cannot recover after SLAVE errored out in parallel execution mode. Additional error messages can be found in the MariaDB error log"
chi: "从并行执行模式下的从站错误后无法恢复。可以在MariaDB错误日志中找到其他错误消息"

# ER_MTS_RESET_WORKERS
source: "Cannot clean up worker info tables. Additional error messages can be found in the MariaDB error log"
chi: "无法清理工作者信息表。可以在MariaDB错误日志中找到其他错误消息"

# ER_COL_COUNT_DOESNT_MATCH_CORRUPTED_V2
source: "Column count of %s.%s is wrong. Expected %d, found %d. The table is probably corrupted"
chi: "列数为%s.%s是错误的。预期的%d，找到%d。表可能损坏了"

# ER_SLAVE_SILENT_RETRY_TRANSACTION
source: "Slave must silently retry current transaction"
chi: "从站必须静默地重试当前事务"

# ER_UNUSED_22
source: "You should never see it"
chi: "你永远不应该看到它"

# ER_TABLE_SCHEMA_MISMATCH
source: "Schema mismatch (%s)"
chi: "架构不匹配(%s)"

# ER_TABLE_IN_SYSTEM_TABLESPACE
source: "Table %-.192s in system tablespace"
chi: "表%-.192s在系统表空间中"

# ER_IO_READ_ERROR
source: "IO Read error: (%lu, %s) %s"
chi: "IO读取错误:（%lu，%s）%s"

# ER_IO_WRITE_ERROR
source: "IO Write error: (%lu, %s) %s"
chi: "IO写错错误:（%lu，%s）%s"

# ER_TABLESPACE_MISSING
source: "Tablespace is missing for table '%-.192s'"
chi: "表空间缺少表'%-.192s'"

# ER_TABLESPACE_EXISTS
source: "Tablespace for table '%-.192s' exists. Please DISCARD the tablespace before IMPORT"
chi: "表格'%-.192s'的表空间。请在导入之前丢弃表空间"

# ER_TABLESPACE_DISCARDED
source: "Tablespace has been discarded for table %`s"
chi: "表空间已被丢弃为表%`s"

# ER_INTERNAL_ERROR
source: "Internal error: %-.192s"
chi: "内部错误：%-.192s"

# ER_INNODB_IMPORT_ERROR
source: "ALTER TABLE '%-.192s' IMPORT TABLESPACE failed with error %lu : '%s'"
chi: "ALTER TABLE '%-.192s' IMPORT TABLESPACE 失败，错误%lu：'%s'"

# ER_INNODB_INDEX_CORRUPT
source: "Index corrupt: %s"
chi: "索引损坏：%s"

# ER_INVALID_YEAR_COLUMN_LENGTH
source: "YEAR(%lu) column type is deprecated. Creating YEAR(4) column instead"
chi: "已弃用YEAR（%lu）列类型。创建YEAR(4)列代替"

# ER_NOT_VALID_PASSWORD
source: "Your password does not satisfy the current policy requirements"
chi: "您的密码不满足当前的政策要求"

# ER_MUST_CHANGE_PASSWORD
source: "You must SET PASSWORD before executing this statement"
chi: "您必须在执行此语句之前设置密码"

# ER_FK_NO_INDEX_CHILD
source: "Failed to add the foreign key constraint. Missing index for constraint '%s' in the foreign table '%s'"
chi: "无法添加外键约束。外表'%s'中的约束'%s'缺少索引"

# ER_FK_NO_INDEX_PARENT
source: "Failed to add the foreign key constraint. Missing index for constraint '%s' in the referenced table '%s'"
chi: "无法添加外键约束。引用的表'%s'中的约束'%s'缺少索引"

# ER_FK_FAIL_ADD_SYSTEM
source: "Failed to add the foreign key constraint '%s' to system tables"
chi: "无法将外键约束'%s'添加到系统表"

# ER_FK_CANNOT_OPEN_PARENT
source: "Failed to open the referenced table '%s'"
chi: "无法打开引用的表'%s'"

# ER_FK_INCORRECT_OPTION
source: "Failed to add the foreign key constraint on table '%s'. Incorrect options in FOREIGN KEY constraint '%s'"
chi: "无法在表'%s'上添加外键约束。外键约束'%s'中的选项不正确"

# ER_DUP_CONSTRAINT_NAME
source: "Duplicate %s constraint name '%s'"
chi: "重复%s约束名称'%s'"

# ER_PASSWORD_FORMAT
source: "The password hash doesn't have the expected format. Check if the correct password algorithm is being used with the PASSWORD() function"
chi: "密码哈希没有预期的格式。检查密码（）函数是否使用正确的密码算法"

# ER_FK_COLUMN_CANNOT_DROP
source: "Cannot drop column '%-.192s': needed in a foreign key constraint '%-.192s'"
chi: "无法删除'%-.192s'列：在外部索引约束'%-.192s'中需要"

# ER_FK_COLUMN_CANNOT_DROP_CHILD
source: "Cannot drop column '%-.192s': needed in a foreign key constraint '%-.192s' of table %-.192s"
chi: "无法删除列'%-.192s'：在外键约束'%-.192s'中需要，表%-.192s"

# ER_FK_COLUMN_NOT_NULL
source: "Column '%-.192s' cannot be NOT NULL: needed in a foreign key constraint '%-.192s' SET NULL"
chi: "列'%-.192s'不能没有null：在外键约束'%-.192s'设置为null"

# ER_DUP_INDEX
source: "Duplicate index %`s. This is deprecated and will be disallowed in a future release"
chi: "重复索引%`s。这已弃用，将在未来的版本中不允许"

# ER_FK_COLUMN_CANNOT_CHANGE
source: "Cannot change column '%-.192s': used in a foreign key constraint '%-.192s'"
chi: "无法更改列'%-.192s'：用于外部键约束'%-.192s'"

# ER_FK_COLUMN_CANNOT_CHANGE_CHILD
source: "Cannot change column '%-.192s': used in a foreign key constraint '%-.192s' of table '%-.192s'"
chi: "无法更改列'%-.192s'：用于在外部键约束'%-.192s'的表'%-.192s'"

# ER_FK_CANNOT_DELETE_PARENT
source: "Cannot delete rows from table which is parent in a foreign key constraint '%-.192s' of table '%-.192s'"
chi: "无法从表中删除来自表中的父级的表中的行'%-.192s”表'%-.192s'"

# ER_MALFORMED_PACKET
source: "Malformed communication packet"
chi: "畸形通信包"

# ER_READ_ONLY_MODE
source: "Running in read-only mode"
chi: "以只读模式运行"

# ER_GTID_NEXT_TYPE_UNDEFINED_GROUP
source: "When GTID_NEXT is set to a GTID, you must explicitly set it again after a COMMIT or ROLLBACK. If you see this error message in the slave SQL thread, it means that a table in the current transaction is transactional on the master and non-transactional on the slave. In a client connection, it means that you executed SET GTID_NEXT before a transaction and forgot to set GTID_NEXT to a different identifier or to 'AUTOMATIC' after COMMIT or ROLLBACK. Current GTID_NEXT is '%s'"
chi: "当GTID_NEXT设置为GTID时，必须在提交或回滚后立即将其再次设置。如果在从SQL线程中看到此错误消息，则表示当前事务中的表是在主站和从站上的非交易的事务性。在客户端连接中，它意味着您在事务之前执行SET GTID_NEXT并忘记将GTID_NEXT设置为不同的标识符或在提交或回滚后“自动”。当前gtid_next是'%s'"

# ER_VARIABLE_NOT_SETTABLE_IN_SP
source: "The system variable %.200s cannot be set in stored procedures"
chi: "无法在存储过程中设置系统变量%.200s"

# ER_CANT_SET_GTID_PURGED_WHEN_GTID_MODE_IS_OFF
source: "GTID_PURGED can only be set when GTID_MODE = ON"
chi: "只能在GTID_MODE = ON设置GTID_PURGED"

# ER_CANT_SET_GTID_PURGED_WHEN_GTID_EXECUTED_IS_NOT_EMPTY
source: "GTID_PURGED can only be set when GTID_EXECUTED is empty"
chi: "只有在GTID_EXECUTED为空时才可以设置GTID_PURGED"

# ER_CANT_SET_GTID_PURGED_WHEN_OWNED_GTIDS_IS_NOT_EMPTY
source: "GTID_PURGED can only be set when there are no ongoing transactions (not even in other clients)"
chi: "只有在没有持续的事务时才可以设置GTID_PURGED（即使在其他客户端中不）"

# ER_GTID_PURGED_WAS_CHANGED
source: "GTID_PURGED was changed from '%s' to '%s'"
chi: "GTID_PURGED从'%s'更改为'%s'"

# ER_GTID_EXECUTED_WAS_CHANGED
source: "GTID_EXECUTED was changed from '%s' to '%s'"
chi: "GTID_EXECUTE从'%s'更改为'%s'"

# ER_BINLOG_STMT_MODE_AND_NO_REPL_TABLES
source: "Cannot execute statement: impossible to write to binary log since BINLOG_FORMAT = STATEMENT, and both replicated and non replicated tables are written to"
chi: "无法执行语句：由于BINLOG_FORMAT = STATEMENT，因此无法写入二进制日志，并将复制和非复制表写入"

# ER_ALTER_OPERATION_NOT_SUPPORTED 0A000
source: "%s is not supported for this operation. Try %s"
chi: "此操作不支持%s。试试%s"

# ER_ALTER_OPERATION_NOT_SUPPORTED_REASON 0A000
source: "%s is not supported. Reason: %s. Try %s"
chi: "不支持%s。原因：%s。试试%s"

# ER_ALTER_OPERATION_NOT_SUPPORTED_REASON_COPY
source: "COPY algorithm requires a lock"
chi: "复制算法需要锁定"

# ER_ALTER_OPERATION_NOT_SUPPORTED_REASON_PARTITION
source: "Partition specific operations do not yet support LOCK/ALGORITHM"
chi: "分区特定操作尚不支持锁定/算法"

# ER_ALTER_OPERATION_NOT_SUPPORTED_REASON_FK_RENAME
source: "Columns participating in a foreign key are renamed"
chi: "参与外键的列被更名"

# ER_ALTER_OPERATION_NOT_SUPPORTED_REASON_COLUMN_TYPE
source: "Cannot change column type"
chi: "无法更改列类型"

# ER_ALTER_OPERATION_NOT_SUPPORTED_REASON_FK_CHECK
source: "Adding foreign keys needs foreign_key_checks=OFF"
chi: "添加外键需要figner_key_checks = OFF"

# ER_ALTER_OPERATION_NOT_SUPPORTED_REASON_IGNORE
source: "Creating unique indexes with IGNORE requires COPY algorithm to remove duplicate rows"
chi: "使用忽略创建唯一索引需要复制算法删除重复行"

# ER_ALTER_OPERATION_NOT_SUPPORTED_REASON_NOPK
source: "Dropping a primary key is not allowed without also adding a new primary key"
chi: "不允许删除主键，而不添加新的主键"

# ER_ALTER_OPERATION_NOT_SUPPORTED_REASON_AUTOINC
source: "Adding an auto-increment column requires a lock"
chi: "添加自动增量列需要锁定"

# ER_ALTER_OPERATION_NOT_SUPPORTED_REASON_HIDDEN_FTS
source: "Cannot replace hidden FTS_DOC_ID with a user-visible one"
chi: "无法使用用户可见的替换隐藏的FTS_DOC_ID"

# ER_ALTER_OPERATION_NOT_SUPPORTED_REASON_CHANGE_FTS
source: "Cannot drop or rename FTS_DOC_ID"
chi: "无法删除或重命名FTS_DOC_ID"

# ER_ALTER_OPERATION_NOT_SUPPORTED_REASON_FTS
source: "Fulltext index creation requires a lock"
chi: "fulltext索引创建需要锁定"

# ER_SQL_SLAVE_SKIP_COUNTER_NOT_SETTABLE_IN_GTID_MODE
source: "sql_slave_skip_counter can not be set when the server is running with GTID_MODE = ON. Instead, for each transaction that you want to skip, generate an empty transaction with the same GTID as the transaction"
chi: "使用GTID_Mode = ON运行时，无法设置SQL_SLAVE_SKIP_COUNTER。相反，对于要跳过的每个事务，使用与事务相同的GTID生成空事务"

# ER_DUP_UNKNOWN_IN_INDEX 23000
source: "Duplicate entry for key '%-.192s'"
chi: "索引的重复条目'%-.192s'"

# ER_IDENT_CAUSES_TOO_LONG_PATH
source: "Long database name and identifier for object resulted in path length exceeding %d characters. Path: '%s'"
chi: "对象的长数据库名称和标识符导致路径长度超过%d字符。路径：'%s'"

# ER_ALTER_OPERATION_NOT_SUPPORTED_REASON_NOT_NULL
source: "cannot convert NULL to non-constant DEFAULT"
chi: "无法将null转换为非常量默认值"

# ER_MUST_CHANGE_PASSWORD_LOGIN
source: "Your password has expired. To log in you must change it using a client that supports expired passwords"
chi: "您的密码已过期。要登录您必须使用支持过期密码的客户端更改它"

# ER_ROW_IN_WRONG_PARTITION
source: "Found a row in wrong partition %s"
chi: "在错误分区%s中找到了一行"

# ER_MTS_EVENT_BIGGER_PENDING_JOBS_SIZE_MAX
source: "Cannot schedule event %s, relay-log name %s, position %s to Worker thread because its size %lu exceeds %lu of slave_pending_jobs_size_max"
chi: "无法安排事件%s，中继日志名称%s，position%s对工作线程，因为它的大小%lu超过了slave_pending_jobs_size_max (%lu)"

# ER_INNODB_NO_FT_USES_PARSER
source: "Cannot CREATE FULLTEXT INDEX WITH PARSER on InnoDB table"
chi: "无法在InnoDB表上CREATE FULLTEXT INDEX WITH PARSER"

# ER_BINLOG_LOGICAL_CORRUPTION
source: "The binary log file '%s' is logically corrupted: %s"
chi: "二进制日志文件'%s'逻辑损坏：%s"

# ER_WARN_PURGE_LOG_IN_USE
source: "file %s was not purged because it was being read by %d thread(s), purged only %d out of %d files"
chi: "未清除文件%s，因为它被%d线程读取，只清除%d文件中的%d"

# ER_WARN_PURGE_LOG_IS_ACTIVE
source: "file %s was not purged because it is the active log file"
chi: "文件%s未清除，因为它是活动日志文件"

# ER_AUTO_INCREMENT_CONFLICT
source: "Auto-increment value in UPDATE conflicts with internally generated values"
chi: "更新中的自动增量值与内部生成的值冲突"

# WARN_ON_BLOCKHOLE_IN_RBR
source: "Row events are not logged for %s statements that modify BLACKHOLE tables in row format. Table(s): '%-.192s'"
chi: "未记录行事件的%s语句，该语句以行格式修改BlackHole表。表：'%-.192s'"

# ER_SLAVE_MI_INIT_REPOSITORY
source: "Slave failed to initialize master info structure from the repository"
chi: "从设备无法从存储库初始化主信息结构"

# ER_SLAVE_RLI_INIT_REPOSITORY
source: "Slave failed to initialize relay log info structure from the repository"
chi: "从站无法从存储库初始化中继日志信息结构"

# ER_ACCESS_DENIED_CHANGE_USER_ERROR 28000
source: "Access denied trying to change to user '%-.48s'@'%-.64s' (using password: %s). Disconnecting"
chi: "访问拒绝尝试更改为用户'%-.48s'@'%-.64s'（使用密码：%s）。断开连接"

# ER_INNODB_READ_ONLY
source: "InnoDB is in read only mode"
chi: "innodb是只读模式"

# ER_STOP_SLAVE_SQL_THREAD_TIMEOUT
source: "STOP SLAVE command execution is incomplete: Slave SQL thread got the stop signal, thread is busy, SQL thread will stop once the current task is complete"
chi: "STOP SLAVE命令执行不完整：从SQL线程获得停止信号，线程正忙，一旦当前任务完成后，SQL线程将停止"

# ER_STOP_SLAVE_IO_THREAD_TIMEOUT
source: "STOP SLAVE command execution is incomplete: Slave IO thread got the stop signal, thread is busy, IO thread will stop once the current task is complete"
chi: "STOP SLAVE命令执行不完整：从机动程线程得到停止信号，线程很忙，一旦当前任务完成后，IO线程将停止。"

# ER_TABLE_CORRUPT
source: "Operation cannot be performed. The table '%-.64s.%-.64s' is missing, corrupt or contains bad data"
chi: "无法执行操作。表'%-.64s。%-.64s'丢失，损坏或包含不良数据"

# ER_TEMP_FILE_WRITE_FAILURE
source: "Temporary file write failure"
chi: "临时文件写入失败"

# ER_INNODB_FT_AUX_NOT_HEX_ID
source: "Upgrade index name failed, please use create index(alter table) algorithm copy to rebuild index"
chi: "升级索引名称失败，请使用创建索引（ALTER TABLE）算法复制来重建索引"

# ER_GENERATED_COLUMN_FUNCTION_IS_NOT_ALLOWED
source: "Function or expression '%s' cannot be used in the %s clause of %`s"
chi: "函数或表达式'%s'不能用于%s的%`s"

# ER_PRIMARY_KEY_BASED_ON_GENERATED_COLUMN
source: "Primary key cannot be defined upon a generated column"
chi: "主键无法在生成的列上定义"

# ER_KEY_BASED_ON_GENERATED_VIRTUAL_COLUMN
source: "Key/Index cannot be defined on a virtual generated column"
chi: "无法在虚拟生成的列上定义键/索引"

# ER_WRONG_FK_OPTION_FOR_GENERATED_COLUMN
source: "Cannot define foreign key with %s clause on a generated column"
chi: "无法在生成的列上定义%s子句的外键"

# ER_WARNING_NON_DEFAULT_VALUE_FOR_GENERATED_COLUMN
source: "The value specified for generated column '%s' in table '%s' has been ignored"
chi: "忽略了表'%s'中为生成的列'%s'指定的值已被忽略"

# ER_UNSUPPORTED_ACTION_ON_GENERATED_COLUMN
source: "This is not yet supported for generated columns"
chi: "生成的列尚未支持这一点"

# ER_UNSUPPORTED_ENGINE_FOR_GENERATED_COLUMNS
source: "%s storage engine does not support generated columns"
chi: "%s存储引擎不支持生成的列"
