Repository: vladbogo/test-translation
Catalog: cze.xlf
Languages: cze

# ER_NO
source: "NO"
cze: "NE"

# ER_YES
source: "YES"
cze: "ANO"

# ER_CANT_CREATE_FILE
source: "Can't create file '%-.200s' (errno: %M)"
cze: "Nemohu vytvořit soubor '%-.200s' (chybový kód: %M)"

# ER_CANT_CREATE_TABLE
source: "Can't create table %`s.%`s (errno: %M)"
cze: "Nemohu vytvořit tabulku %`s.%`s (chybový kód: %M)"

# ER_CANT_CREATE_DB
source: "Can't create database '%-.192s' (errno: %M)"
cze: "Nemohu vytvořit databázi '%-.192s' (chybový kód: %M)"

# ER_DB_CREATE_EXISTS
source: "Can't create database '%-.192s'; database exists"
cze: "Nemohu vytvořit databázi '%-.192s'; databáze již existuje"

# ER_DB_DROP_EXISTS
source: "Can't drop database '%-.192s'; database doesn't exist"
cze: "Nemohu zrušit databázi '%-.192s', databáze neexistuje"

# ER_DB_DROP_DELETE
source: "Error dropping database (can't delete '%-.192s', errno: %M)"
cze: "Chyba při rušení databáze (nemohu vymazat '%-.192s', chyba %M)"

# ER_DB_DROP_RMDIR
source: "Error dropping database (can't rmdir '%-.192s', errno: %M)"
cze: "Chyba při rušení databáze (nemohu vymazat adresář '%-.192s', chyba %M)"

# ER_CANT_DELETE_FILE
source: "Error on delete of '%-.192s' (errno: %M)"
cze: "Chyba při výmazu '%-.192s' (chybový kód: %M)"

# ER_CANT_FIND_SYSTEM_REC
source: "Can't read record in system table"
cze: "Nemohu číst záznam v systémové tabulce"

# ER_CANT_GET_STAT
source: "Can't get status of '%-.200s' (errno: %M)"
cze: "Nemohu získat stav '%-.200s' (chybový kód: %M)"

# ER_CANT_GET_WD
source: "Can't get working directory (errno: %M)"
cze: "Chyba při zjišťování pracovní adresář (chybový kód: %M)"

# ER_CANT_LOCK
source: "Can't lock file (errno: %M)"
cze: "Nemohu uzamknout soubor (chybový kód: %M)"

# ER_CANT_OPEN_FILE
source: "Can't open file: '%-.200s' (errno: %M)"
cze: "Nemohu otevřít soubor '%-.200s' (chybový kód: %M)"

# ER_FILE_NOT_FOUND
source: "Can't find file: '%-.200s' (errno: %M)"
cze: "Nemohu najít soubor '%-.200s' (chybový kód: %M)"

# ER_CANT_READ_DIR
source: "Can't read dir of '%-.192s' (errno: %M)"
cze: "Nemohu číst adresář '%-.192s' (chybový kód: %M)"

# ER_CANT_SET_WD
source: "Can't change dir to '%-.192s' (errno: %M)"
cze: "Nemohu změnit adresář na '%-.192s' (chybový kód: %M)"

# ER_CHECKREAD
source: "Record has changed since last read in table '%-.192s'"
cze: "Záznam byl změněn od posledního čtení v tabulce '%-.192s'"

# ER_DISK_FULL
source: "Disk full (%s); waiting for someone to free some space... (errno: %M)"
cze: "Disk je plný (%s), čekám na uvolnění nějakého místa ... (chybový kód: %M)"

# ER_DUP_KEY 23000
source: "Can't write; duplicate key in table '%-.192s'"
cze: "Nemohu zapsat, zdvojený klíč v tabulce '%-.192s'"

# ER_ERROR_ON_CLOSE
source: "Error on close of '%-.192s' (errno: %M)"
cze: "Chyba při zavírání '%-.192s' (chybový kód: %M)"

# ER_ERROR_ON_READ
source: "Error reading file '%-.200s' (errno: %M)"
cze: "Chyba při čtení souboru '%-.200s' (chybový kód: %M)"

# ER_ERROR_ON_RENAME
source: "Error on rename of '%-.210s' to '%-.210s' (errno: %M)"
cze: "Chyba při přejmenování '%-.210s' na '%-.210s' (chybový kód: %M)"

# ER_ERROR_ON_WRITE
source: "Error writing file '%-.200s' (errno: %M)"
cze: "Chyba při zápisu do souboru '%-.200s' (chybový kód: %M)"

# ER_FILE_USED
source: "'%-.192s' is locked against change"
cze: "'%-.192s' je zamčen proti změnám"

# ER_FILSORT_ABORT
source: "Sort aborted"
cze: "Třídění přerušeno"

# ER_FORM_NOT_FOUND
source: "View '%-.192s' doesn't exist for '%-.192s'"
cze: "Pohled '%-.192s' pro '%-.192s' neexistuje"

# ER_KEY_NOT_FOUND
source: "Can't find record in '%-.192s'"
cze: "Nemohu najít záznam v '%-.192s'"

# ER_NOT_FORM_FILE
source: "Incorrect information in file: '%-.200s'"
cze: "Nesprávná informace v souboru '%-.200s'"

# ER_NOT_KEYFILE
source: "Index for table '%-.200s' is corrupt; try to repair it"
cze: "Nesprávný klíč pro tabulku '%-.200s'; pokuste se ho opravit"

# ER_OLD_KEYFILE
source: "Old key file for table '%-.192s'; repair it!"
cze: "Starý klíčový soubor pro '%-.192s'; opravte ho"

# ER_OPEN_AS_READONLY
source: "Table '%-.192s' is read only"
cze: "'%-.192s' je jen pro čtení"

# ER_OUTOFMEMORY HY001 S1001
source: "Out of memory; restart server and try again (needed %d bytes)"
cze: "Málo paměti. Přestartujte daemona a zkuste znovu (je potřeba %d bytů)"

# ER_OUT_OF_SORTMEMORY HY001 S1001
source: "Out of sort memory, consider increasing server sort buffer size"
cze: "Málo paměti pro třídění. Zvyšte velikost třídícího bufferu"

# ER_UNEXPECTED_EOF
source: "Unexpected EOF found when reading file '%-.192s' (errno: %M)"
cze: "Neočekávaný konec souboru při čtení '%-.192s' (chybový kód: %M)"

# ER_CON_COUNT_ERROR 08004
source: "Too many connections"
cze: "Příliš mnoho spojení"

# ER_OUT_OF_RESOURCES
source: "Out of memory."
cze: "Málo prostoru/paměti pro thread"

# ER_BAD_HOST_ERROR 08S01
source: "Can't get hostname for your address"
cze: "Nemohu zjistit jméno stroje pro Vaši adresu"

# ER_HANDSHAKE_ERROR 08S01
source: "Bad handshake"
cze: "Chyba při ustavování spojení"

# ER_DBACCESS_DENIED_ERROR 42000
source: "Access denied for user '%s'@'%s' to database '%-.192s'"
cze: "Přístup pro uživatele '%s'@'%s' k databázi '%-.192s' není povolen"

# ER_ACCESS_DENIED_ERROR 28000
source: "Access denied for user '%s'@'%s' (using password: %s)"
cze: "Přístup pro uživatele '%s'@'%s' (s heslem %s)"

# ER_NO_DB_ERROR 3D000
source: "No database selected"
cze: "Nebyla vybrána žádná databáze"

# ER_UNKNOWN_COM_ERROR 08S01
source: "Unknown command"
cze: "Neznámý příkaz"

# ER_BAD_NULL_ERROR 23000
source: "Column '%-.192s' cannot be null"
cze: "Sloupec '%-.192s' nemůže být null"

# ER_BAD_DB_ERROR 42000
source: "Unknown database '%-.192s'"
cze: "Neznámá databáze '%-.192s'"

# ER_TABLE_EXISTS_ERROR 42S01
source: "Table '%-.192s' already exists"
cze: "Tabulka '%-.192s' již existuje"

# ER_BAD_TABLE_ERROR 42S02
source: "Unknown table '%-.100T'"
cze: "Neznámá tabulka '%-.100T'"

# ER_NON_UNIQ_ERROR 23000
source: "Column '%-.192s' in %-.192s is ambiguous"
cze: "Sloupec '%-.192s' v %-.192s není zcela jasný"

# ER_SERVER_SHUTDOWN 08S01
source: "Server shutdown in progress"
cze: "Probíhá ukončování práce serveru"

# ER_BAD_FIELD_ERROR 42S22 S0022
source: "Unknown column '%-.192s' in '%-.192s'"
cze: "Neznámý sloupec '%-.192s' v %-.192s"

# ER_WRONG_FIELD_WITH_GROUP 42000 S1009
source: "'%-.192s' isn't in GROUP BY"
cze: "Použité '%-.192s' nebylo v group by"

# ER_WRONG_GROUP_FIELD 42000 S1009
source: "Can't group on '%-.192s'"
cze: "Nemohu použít group na '%-.192s'"

# ER_WRONG_SUM_SELECT 42000 S1009
source: "Statement has sum functions and columns in same statement"
cze: "Příkaz obsahuje zároveň funkci sum a sloupce"

# ER_WRONG_VALUE_COUNT 21S01
source: "Column count doesn't match value count"
cze: "Počet sloupců neodpovídá zadané hodnotě"

# ER_TOO_LONG_IDENT 42000 S1009
source: "Identifier name '%-.100T' is too long"
cze: "Jméno identifikátoru '%-.100T' je příliš dlouhé"

# ER_DUP_FIELDNAME 42S21 S1009
source: "Duplicate column name '%-.192s'"
cze: "Zdvojené jméno sloupce '%-.192s'"

# ER_DUP_KEYNAME 42000 S1009
source: "Duplicate key name '%-.192s'"
cze: "Zdvojené jméno klíče '%-.192s'"

# ER_DUP_ENTRY 23000 S1009
source: "Duplicate entry '%-.192T' for key %d"
cze: "Zdvojený klíč '%-.192T' (číslo klíče %d)"

# ER_WRONG_FIELD_SPEC 42000 S1009
source: "Incorrect column specifier for column '%-.192s'"
cze: "Chybná specifikace sloupce '%-.192s'"

# ER_PARSE_ERROR 42000 s1009
source: "%s near '%-.80T' at line %d"
cze: "%s blízko '%-.80T' na řádku %d"

# ER_EMPTY_QUERY 42000
source: "Query was empty"
cze: "Výsledek dotazu je prázdný"

# ER_NONUNIQ_TABLE 42000 S1009
source: "Not unique table/alias: '%-.192s'"
cze: "Nejednoznačná tabulka/alias: '%-.192s'"

# ER_INVALID_DEFAULT 42000 S1009
source: "Invalid default value for '%-.192s'"
cze: "Chybná defaultní hodnota pro '%-.192s'"

# ER_MULTIPLE_PRI_KEY 42000 S1009
source: "Multiple primary key defined"
cze: "Definováno více primárních klíčů"

# ER_TOO_MANY_KEYS 42000 S1009
source: "Too many keys specified; max %d keys allowed"
cze: "Zadáno příliš mnoho klíčů, je povoleno nejvíce %d klíčů"

# ER_TOO_MANY_KEY_PARTS 42000 S1009
source: "Too many key parts specified; max %d parts allowed"
cze: "Zadáno příliš mnoho část klíčů, je povoleno nejvíce %d částí"

# ER_TOO_LONG_KEY 42000 S1009
source: "Specified key was too long; max key length is %d bytes"
cze: "Zadaný klíč byl příliš dlouhý, největší délka klíče je %d"

# ER_KEY_COLUMN_DOES_NOT_EXIST 42000 S1009
source: "Key column '%-.192s' doesn't exist in table"
cze: "Klíčový sloupec '%-.192s' v tabulce neexistuje"

# ER_TOO_BIG_FIELDLENGTH 42000 S1009
source: "Column length too big for column '%-.192s' (max = %lu); use BLOB or TEXT instead"
cze: "Příliš velká délka sloupce '%-.192s' (nejvíce %lu). Použijte BLOB"

# ER_WRONG_AUTO_KEY 42000 S1009
source: "Incorrect table definition; there can be only one auto column and it must be defined as a key"
cze: "Můžete mít pouze jedno AUTO pole a to musí být definováno jako klíč"

# ER_NORMAL_SHUTDOWN
source: "%s (initiated by: %s): Normal shutdown"
cze: "%s (%s): normální ukončení"

# ER_GOT_SIGNAL
source: "%s: Got signal %d. Aborting!\n"
cze: "%s: přijat signal %d, končím\n"

# ER_SHUTDOWN_COMPLETE
source: "%s: Shutdown complete\n"
cze: "%s: ukončení práce hotovo\n"

# ER_FORCING_CLOSE 08S01
source: "%s: Forcing close of thread %ld user: '%-.48s'\n"
cze: "%s: násilné uzavření threadu %ld uživatele '%-.48s'\n"

# ER_IPSOCK_ERROR 08S01
source: "Can't create IP socket"
cze: "Nemohu vytvořit IP socket"

# ER_NO_SUCH_INDEX 42S12 S1009
source: "Table '%-.192s' has no index like the one used in CREATE INDEX; recreate the table"
cze: "Tabulka '%-.192s' nemá index odpovídající CREATE INDEX. Vytvořte tabulku znovu"

# ER_WRONG_FIELD_TERMINATORS 42000 S1009
source: "Field separator argument is not what is expected; check the manual"
cze: "Argument separátoru položek nebyl očekáván. Přečtěte si manuál"

# ER_BLOBS_AND_NO_TERMINATED 42000 S1009
source: "You can't use fixed rowlength with BLOBs; please use 'fields terminated by'"
cze: "Není možné použít pevný rowlength s BLOBem. Použijte 'fields terminated by'"

# ER_TEXTFILE_NOT_READABLE
source: "The file '%-.128s' must be in the database directory or be readable by all"
cze: "Soubor '%-.128s' musí být v adresáři databáze nebo čitelný pro všechny"

# ER_FILE_EXISTS_ERROR
source: "File '%-.200s' already exists"
cze: "Soubor '%-.200s' již existuje"

# ER_LOAD_INFO
source: "Records: %ld Deleted: %ld Skipped: %ld Warnings: %ld"
cze: "Záznamů: %ld Vymazáno: %ld Přeskočeno: %ld Varování: %ld"

# ER_ALTER_INFO
source: "Records: %ld Duplicates: %ld"
cze: "Záznamů: %ld Zdvojených: %ld"

# ER_WRONG_SUB_KEY
source: "Incorrect prefix key; the used key part isn't a string, the used length is longer than the key part, or the storage engine doesn't support unique prefix keys"
cze: "Chybná podčást klíče -- není to řetězec nebo je delší než délka části klíče"

# ER_CANT_REMOVE_ALL_FIELDS 42000
source: "You can't delete all columns with ALTER TABLE; use DROP TABLE instead"
cze: "Není možné vymazat všechny položky s ALTER TABLE. Použijte DROP TABLE"

# ER_CANT_DROP_FIELD_OR_KEY 42000
source: "Can't DROP %s %`-.192s; check that it exists"
cze: "Nemohu zrušit (DROP %s) %`-.192s. Zkontrolujte, zda neexistují záznamy/klíče"

# ER_INSERT_INFO
source: "Records: %ld Duplicates: %ld Warnings: %ld"
cze: "Záznamů: %ld Zdvojených: %ld Varování: %ld"

# ER_NO_SUCH_THREAD
source: "Unknown thread id: %lu"
cze: "Neznámá identifikace threadu: %lu"

# ER_KILL_DENIED_ERROR
source: "You are not owner of thread %lld"
cze: "Nejste vlastníkem threadu %lld"

# ER_NO_TABLES_USED
source: "No tables used"
cze: "Nejsou použity žádné tabulky"

# ER_TOO_BIG_SET
source: "Too many strings for column %-.192s and SET"
cze: "Příliš mnoho řetězců pro sloupec %-.192s a SET"

# ER_NO_UNIQUE_LOGFILE
source: "Can't generate a unique log-filename %-.200s.(1-999)\n"
cze: "Nemohu vytvořit jednoznačné jméno logovacího souboru %-.200s.(1-999)\n"

# ER_TABLE_NOT_LOCKED_FOR_WRITE
source: "Table '%-.192s' was locked with a READ lock and can't be updated"
cze: "Tabulka '%-.192s' byla zamčena s READ a nemůže být změněna"

# ER_TABLE_NOT_LOCKED
source: "Table '%-.192s' was not locked with LOCK TABLES"
cze: "Tabulka '%-.192s' nebyla zamčena s LOCK TABLES"

# ER_WRONG_DB_NAME 42000
source: "Incorrect database name '%-.100T'"
cze: "Nepřípustné jméno databáze '%-.100T'"

# ER_WRONG_TABLE_NAME 42000
source: "Incorrect table name '%-.100s'"
cze: "Nepřípustné jméno tabulky '%-.100s'"

# ER_TOO_BIG_SELECT 42000
source: "The SELECT would examine more than MAX_JOIN_SIZE rows; check your WHERE and use SET SQL_BIG_SELECTS=1 or SET MAX_JOIN_SIZE=# if the SELECT is okay"
cze: "Zadaný SELECT by procházel příliš mnoho záznamů a trval velmi dlouho. Zkontrolujte tvar WHERE a je-li SELECT v pořádku, použijte SET SQL_BIG_SELECTS=1"

# ER_UNKNOWN_ERROR
source: "Unknown error"
cze: "Neznámá chyba"

# ER_UNKNOWN_PROCEDURE 42000
source: "Unknown procedure '%-.192s'"
cze: "Neznámá procedura %-.192s"

# ER_WRONG_PARAMCOUNT_TO_PROCEDURE 42000
source: "Incorrect parameter count to procedure '%-.192s'"
cze: "Chybný počet parametrů procedury %-.192s"

# ER_WRONG_PARAMETERS_TO_PROCEDURE
source: "Incorrect parameters to procedure '%-.192s'"
cze: "Chybné parametry procedury %-.192s"

# ER_UNKNOWN_TABLE 42S02
source: "Unknown table '%-.192s' in %-.32s"
cze: "Neznámá tabulka '%-.192s' v %-.32s"

# ER_FIELD_SPECIFIED_TWICE 42000
source: "Column '%-.192s' specified twice"
cze: "Položka '%-.192s' je zadána dvakrát"

# ER_INVALID_GROUP_FUNC_USE
source: "Invalid use of group function"
cze: "Nesprávné použití funkce group"

# ER_UNSUPPORTED_EXTENSION 42000
source: "Table '%-.192s' uses an extension that doesn't exist in this MariaDB version"
cze: "Tabulka '%-.192s' používá rozšíření, které v této verzi MariaDB není"

# ER_TABLE_MUST_HAVE_COLUMNS 42000
source: "A table must have at least 1 column"
cze: "Tabulka musí mít alespoň jeden sloupec"

# ER_RECORD_FILE_FULL
source: "The table '%-.192s' is full"
cze: "Tabulka '%-.192s' je plná"

# ER_UNKNOWN_CHARACTER_SET 42000
source: "Unknown character set: '%-.64s'"
cze: "Neznámá znaková sada: '%-.64s'"

# ER_TOO_MANY_TABLES
source: "Too many tables; MariaDB can only use %d tables in a join"
cze: "Příliš mnoho tabulek, MariaDB jich může mít v joinu jen %d"

# ER_TOO_MANY_FIELDS
source: "Too many columns"
cze: "Příliš mnoho položek"

# ER_TOO_BIG_ROWSIZE 42000
source: "Row size too large. The maximum row size for the used table type, not counting BLOBs, is %ld. This includes storage overhead, check the manual. You have to change some columns to TEXT or BLOBs"
cze: "Řádek je příliš velký. Maximální velikost řádku, nepočítaje položky blob, je %ld. Musíte změnit některé položky na blob"

# ER_STACK_OVERRUN
source: "Thread stack overrun: Used: %ld of a %ld stack. Use 'mariadbd --thread_stack=#' to specify a bigger stack if needed"
cze: "Přetečení zásobníku threadu: použito %ld z %ld. Použijte 'mariadbd --thread_stack=#' k zadání většího zásobníku"

# ER_WRONG_OUTER_JOIN 42000
source: "Cross dependency found in OUTER JOIN; examine your ON conditions"
cze: "V OUTER JOIN byl nalezen křížový odkaz. Prověřte ON podmínky"

# ER_CANT_FIND_UDF
source: "Can't load function '%-.192s'"
cze: "Nemohu načíst funkci '%-.192s'"

# ER_CANT_INITIALIZE_UDF
source: "Can't initialize function '%-.192s'; %-.80s"
cze: "Nemohu inicializovat funkci '%-.192s'; %-.80s"

# ER_UDF_NO_PATHS
source: "No paths allowed for shared library"
cze: "Pro sdílenou knihovnu nejsou povoleny cesty"

# ER_UDF_EXISTS
source: "Function '%-.192s' already exists"
cze: "Funkce '%-.192s' již existuje"

# ER_CANT_OPEN_LIBRARY
source: "Can't open shared library '%-.192s' (errno: %d, %-.128s)"
cze: "Nemohu otevřít sdílenou knihovnu '%-.192s' (errno: %d, %-.128s)"

# ER_CANT_FIND_DL_ENTRY
source: "Can't find symbol '%-.128s' in library"
cze: "Nemohu najít funkci '%-.128s' v knihovně"

# ER_FUNCTION_NOT_DEFINED
source: "Function '%-.192s' is not defined"
cze: "Funkce '%-.192s' není definována"

# ER_HOST_IS_BLOCKED
source: "Host '%-.64s' is blocked because of many connection errors; unblock with 'mariadb-admin flush-hosts'"
cze: "Stroj '%-.64s' je zablokován kvůli mnoha chybám při připojování. Odblokujete použitím 'mariadb-admin flush-hosts'"

# ER_HOST_NOT_PRIVILEGED
source: "Host '%-.64s' is not allowed to connect to this MariaDB server"
cze: "Stroj '%-.64s' nemá povoleno se k tomuto MariaDB serveru připojit"

# ER_PASSWORD_ANONYMOUS_USER 42000
source: "You are using MariaDB as an anonymous user and anonymous users are not allowed to modify user settings"
cze: "Používáte MariaDB jako anonymní uživatel a anonymní uživatelé nemají povoleno měnit hesla"

# ER_PASSWORD_NOT_ALLOWED 42000
source: "You must have privileges to update tables in the mysql database to be able to change passwords for others"
cze: "Na změnu hesel ostatním musíte mít právo provést update tabulek v databázi mysql"

# ER_PASSWORD_NO_MATCH 28000
source: "Can't find any matching row in the user table"
cze: "V tabulce user není žádný odpovídající řádek"

# ER_UPDATE_INFO
source: "Rows matched: %ld Changed: %ld Warnings: %ld"
cze: "Nalezených řádků: %ld Změněno: %ld Varování: %ld"

# ER_CANT_CREATE_THREAD
source: "Can't create a new thread (errno %M); if you are not out of available memory, you can consult the manual for a possible OS-dependent bug"
cze: "Nemohu vytvořit nový thread (errno %M). Pokud je ještě nějaká volná paměť, podívejte se do manuálu na část o chybách specifických pro jednotlivé operační systémy"

# ER_WRONG_VALUE_COUNT_ON_ROW 21S01
source: "Column count doesn't match value count at row %lu"
cze: "Počet sloupců neodpovídá počtu hodnot na řádku %lu"

# ER_CANT_REOPEN_TABLE
source: "Can't reopen table: '%-.192s'"
cze: "Nemohu znovuotevřít tabulku: '%-.192s"

# ER_INVALID_USE_OF_NULL 22004
source: "Invalid use of NULL value"
cze: "Neplatné užití hodnoty NULL"

# ER_REGEXP_ERROR 42000
source: "Regex error '%s'"
cze: "Regulární výraz vrátil chybu: %s"

# ER_MIX_OF_GROUP_FUNC_AND_FIELDS 42000
source: "Mixing of GROUP columns (MIN(),MAX(),COUNT(),...) with no GROUP columns is illegal if there is no GROUP BY clause"
cze: "Pokud není žádná GROUP BY klauzule, není dovoleno současné použití GROUP položek (MIN(),MAX(),COUNT()...) s ne GROUP položkami"

# ER_NONEXISTING_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s'"
cze: "Neexistuje odpovídající grant pro uživatele '%-.48s' na stroji '%-.64s'"

# ER_TABLEACCESS_DENIED_ERROR 42000
source: "%-.100T command denied to user '%s'@'%s' for table '%-.192s'"
cze: "%-.100T příkaz nepřístupný pro uživatele: '%s'@'%s' pro tabulku '%-.192s'"

# ER_COLUMNACCESS_DENIED_ERROR 42000
source: "%-.32s command denied to user '%s'@'%s' for column '%-.192s' in table '%-.192s'"
cze: "%-.32s příkaz nepřístupný pro uživatele: '%s'@'%s' pro sloupec '%-.192s' v tabulce '%-.192s'"

# ER_ILLEGAL_GRANT_FOR_TABLE 42000
source: "Illegal GRANT/REVOKE command; please consult the manual to see which privileges can be used"
cze: "Neplatný příkaz GRANT/REVOKE. Prosím, přečtěte si v manuálu, jaká privilegia je možné použít"

# ER_GRANT_WRONG_HOST_OR_USER 42000
source: "The host or user argument to GRANT is too long"
cze: "Argument příkazu GRANT uživatel nebo stroj je příliš dlouhý"

# ER_NO_SUCH_TABLE 42S02
source: "Table '%-.192s.%-.192s' doesn't exist"
cze: "Tabulka '%-.192s.%-.192s' neexistuje"

# ER_NONEXISTING_TABLE_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s' on table '%-.192s'"
cze: "Neexistuje odpovídající grant pro uživatele '%-.48s' na stroji '%-.64s' pro tabulku '%-.192s'"

# ER_NOT_ALLOWED_COMMAND 42000
source: "The used command is not allowed with this MariaDB version"
cze: "Použitý příkaz není v této verzi MariaDB povolen"

# ER_SYNTAX_ERROR 42000
source: "You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use"
cze: "Vaše syntaxe je nějaká divná"

# ER_DELAYED_CANT_CHANGE_LOCK
source: "Delayed insert thread couldn't get requested lock for table %-.192s"
cze: "Zpožděný insert threadu nebyl schopen získat požadovaný zámek pro tabulku %-.192s"

# ER_TOO_MANY_DELAYED_THREADS
source: "Too many delayed threads in use"
cze: "Příliš mnoho zpožděných threadů"

# ER_ABORTING_CONNECTION 08S01
source: "Aborted connection %ld to db: '%-.192s' user: '%-.48s' (%-.64s)"
cze: "Zrušeno spojení %ld do databáze: '%-.192s' uživatel: '%-.48s' (%-.64s)"

# ER_NET_PACKET_TOO_LARGE 08S01
source: "Got a packet bigger than 'max_allowed_packet' bytes"
cze: "Zjištěn příchozí packet delší než 'max_allowed_packet'"

# ER_NET_READ_ERROR_FROM_PIPE 08S01
source: "Got a read error from the connection pipe"
cze: "Zjištěna chyba při čtení z roury spojení"

# ER_NET_FCNTL_ERROR 08S01
source: "Got an error from fcntl()"
cze: "Zjištěna chyba fcntl()"

# ER_NET_PACKETS_OUT_OF_ORDER 08S01
source: "Got packets out of order"
cze: "Příchozí packety v chybném pořadí"

# ER_NET_UNCOMPRESS_ERROR 08S01
source: "Couldn't uncompress communication packet"
cze: "Nemohu rozkomprimovat komunikační packet"

# ER_NET_READ_ERROR 08S01
source: "Got an error reading communication packets"
cze: "Zjištěna chyba při čtení komunikačního packetu"

# ER_NET_READ_INTERRUPTED 08S01
source: "Got timeout reading communication packets"
cze: "Zjištěn timeout při čtení komunikačního packetu"

# ER_NET_ERROR_ON_WRITE 08S01
source: "Got an error writing communication packets"
cze: "Zjištěna chyba při zápisu komunikačního packetu"

# ER_NET_WRITE_INTERRUPTED 08S01
source: "Got timeout writing communication packets"
cze: "Zjištěn timeout při zápisu komunikačního packetu"

# ER_TOO_LONG_STRING 42000
source: "Result string is longer than 'max_allowed_packet' bytes"
cze: "Výsledný řetězec je delší než 'max_allowed_packet'"

# ER_TABLE_CANT_HANDLE_BLOB 42000
source: "Storage engine %s doesn't support BLOB/TEXT columns"
cze: "Typ použité tabulky (%s) nepodporuje BLOB/TEXT sloupce"

# ER_TABLE_CANT_HANDLE_AUTO_INCREMENT 42000
source: "Storage engine %s doesn't support AUTO_INCREMENT columns"
cze: "Typ použité tabulky (%s) nepodporuje AUTO_INCREMENT sloupce"

# ER_DELAYED_INSERT_TABLE_LOCKED
source: "INSERT DELAYED can't be used with table '%-.192s' because it is locked with LOCK TABLES"
cze: "INSERT DELAYED není možno s tabulkou '%-.192s' použít, protože je zamčená pomocí LOCK TABLES"

# ER_WRONG_COLUMN_NAME 42000
source: "Incorrect column name '%-.100s'"
cze: "Nesprávné jméno sloupce '%-.100s'"

# ER_WRONG_MRG_TABLE
source: "Unable to open underlying table which is differently defined or of non-MyISAM type or doesn't exist"
cze: "Všechny tabulky v MERGE tabulce nejsou definovány stejně"

# ER_DUP_UNIQUE 23000
source: "Can't write, because of unique constraint, to table '%-.192s'"
cze: "Kvůli unique constraintu nemozu zapsat do tabulky '%-.192s'"

# ER_BLOB_KEY_WITHOUT_LENGTH 42000
source: "BLOB/TEXT column '%-.192s' used in key specification without a key length"
cze: "BLOB sloupec '%-.192s' je použit ve specifikaci klíče bez délky"

# ER_PRIMARY_CANT_HAVE_NULL 42000
source: "All parts of a PRIMARY KEY must be NOT NULL; if you need NULL in a key, use UNIQUE instead"
cze: "Všechny části primárního klíče musejí být NOT NULL; pokud potřebujete NULL, použijte UNIQUE"

# ER_TOO_MANY_ROWS 42000
source: "Result consisted of more than one row"
cze: "Výsledek obsahuje více než jeden řádek"

# ER_REQUIRES_PRIMARY_KEY 42000
source: "This table type requires a primary key"
cze: "Tento typ tabulky vyžaduje primární klíč"

# ER_NO_RAID_COMPILED
source: "This version of MariaDB is not compiled with RAID support"
cze: "Tato verze MariaDB není zkompilována s podporou RAID"
