Repository: vladbogo/test-translation
Catalog: cze.xlf
Languages: cze

# ER_UPDATE_WITHOUT_KEY_IN_SAFE_MODE
source: "You are using safe update mode and you tried to update a table without a WHERE that uses a KEY column"
cze: "Update tabulky bez WHERE s klíčem není v módu bezpečných update dovoleno"

# ER_KEY_DOES_NOT_EXISTS 42000 S1009
source: "Key '%-.192s' doesn't exist in table '%-.192s'"
cze: "Klíč '%-.192s' v tabulce '%-.192s' neexistuje"

# ER_CHECK_NO_SUCH_TABLE 42000
source: "Can't open table"
cze: "Nemohu otevřít tabulku"

# ER_CHECK_NOT_IMPLEMENTED 42000
source: "The storage engine for the table doesn't support %s"
cze: "Handler tabulky nepodporuje %s"

# ER_CANT_DO_THIS_DURING_AN_TRANSACTION 25000
source: "You are not allowed to execute this command in a transaction"
cze: "Provedení tohoto příkazu není v transakci dovoleno"

# ER_ERROR_DURING_COMMIT
source: "Got error %M during COMMIT"
cze: "Chyba %M při COMMIT"

# ER_ERROR_DURING_ROLLBACK
source: "Got error %M during ROLLBACK"
cze: "Chyba %M při ROLLBACK"

# ER_ERROR_DURING_FLUSH_LOGS
source: "Got error %M during FLUSH_LOGS"
cze: "Chyba %M při FLUSH_LOGS"

# ER_ERROR_DURING_CHECKPOINT
source: "Got error %M during CHECKPOINT"
cze: "Chyba %M při CHECKPOINT"

# ER_NEW_ABORTING_CONNECTION 08S01
source: "Aborted connection %lld to db: '%-.192s' user: '%-.48s' host: '%-.64s' (%-.64s)"
cze: "Spojení %lld do databáze: '%-.192s' uživatel: '%-.48s' stroj: '%-.64s' (%-.64s) bylo přerušeno"

# ER_INDEX_REBUILD
source: "Failed rebuilding the index of dumped table '%-.192s'"
cze: "Přebudování indexu dumpnuté tabulky '%-.192s' nebylo úspěšné"

# ER_MASTER
source: "Error from master: '%-.64s'"
cze: "Chyba masteru: '%-.64s'"

# ER_MASTER_NET_READ 08S01
source: "Net error reading from master"
cze: "Síťová chyba při čtení z masteru"

# ER_MASTER_NET_WRITE 08S01
source: "Net error writing to master"
cze: "Síťová chyba při zápisu na master"

# ER_FT_MATCHING_KEY_NOT_FOUND
source: "Can't find FULLTEXT index matching the column list"
cze: "Žádný sloupec nemá vytvořen fulltextový index"

# ER_LOCK_OR_ACTIVE_TRANSACTION
source: "Can't execute the given command because you have active locked tables or an active transaction"
cze: "Nemohu provést zadaný příkaz, protože existují aktivní zamčené tabulky nebo aktivní transakce"

# ER_UNKNOWN_SYSTEM_VARIABLE
source: "Unknown system variable '%-.*s'"
cze: "Neznámá systémová proměnná '%-.*s'"

# ER_CRASHED_ON_USAGE
source: "Table '%-.192s' is marked as crashed and should be repaired"
cze: "Tabulka '%-.192s' je označena jako porušená a měla by být opravena"

# ER_CRASHED_ON_REPAIR
source: "Table '%-.192s' is marked as crashed and last (automatic?) repair failed"
cze: "Tabulka '%-.192s' je označena jako porušená a poslední (automatická?) oprava se nezdařila"

# ER_DUP_ENTRY_WITH_KEY_NAME 23000 S1009
source: "Duplicate entry '%-.64T' for key '%-.192s'"
cze: "Zvojený klíč '%-.64T' (číslo klíče '%-.192s')"

# ER_ACCESS_DENIED_NO_PASSWORD_ERROR 28000
source: "Access denied for user '%s'@'%s'"
cze: "Přístup pro uživatele '%s'@'%s'"

# ER_DUP_UNKNOWN_IN_INDEX 23000
source: "Duplicate entry for key '%-.192s'"
cze: "Zdvojený klíč (číslo klíče '%-.192s')"
