Repository: vladbogo/test-translation
Catalog: dan.xlf
Languages: dan

# ER_REQUIRES_PRIMARY_KEY 42000
source: "This table type requires a primary key"
dan: "Denne tabeltype kræver en primærnøgle"

# ER_NO_RAID_COMPILED
source: "This version of MariaDB is not compiled with RAID support"
dan: "Denne udgave af MariaDB er ikke oversat med understøttelse af RAID"

# ER_UPDATE_WITHOUT_KEY_IN_SAFE_MODE
source: "You are using safe update mode and you tried to update a table without a WHERE that uses a KEY column"
dan: "Du bruger sikker opdaterings modus ('safe update mode') og du forsøgte at opdatere en tabel uden en WHERE klausul, der gør brug af et KEY felt"

# ER_KEY_DOES_NOT_EXISTS 42000 S1009
source: "Key '%-.192s' doesn't exist in table '%-.192s'"
dan: "Nøglen '%-.192s' eksisterer ikke i tabellen '%-.192s'"

# ER_CHECK_NO_SUCH_TABLE 42000
source: "Can't open table"
dan: "Kan ikke åbne tabellen"

# ER_CHECK_NOT_IMPLEMENTED 42000
source: "The storage engine for the table doesn't support %s"
dan: "Denne tabeltype understøtter ikke %s"

# ER_CANT_DO_THIS_DURING_AN_TRANSACTION 25000
source: "You are not allowed to execute this command in a transaction"
dan: "Du må ikke bruge denne kommando i en transaktion"

# ER_ERROR_DURING_COMMIT
source: "Got error %M during COMMIT"
dan: "Modtog fejl %M mens kommandoen COMMIT blev udført"

# ER_ERROR_DURING_ROLLBACK
source: "Got error %M during ROLLBACK"
dan: "Modtog fejl %M mens kommandoen ROLLBACK blev udført"

# ER_ERROR_DURING_FLUSH_LOGS
source: "Got error %M during FLUSH_LOGS"
dan: "Modtog fejl %M mens kommandoen FLUSH_LOGS blev udført"

# ER_ERROR_DURING_CHECKPOINT
source: "Got error %M during CHECKPOINT"
dan: "Modtog fejl %M mens kommandoen CHECKPOINT blev udført"

# ER_NEW_ABORTING_CONNECTION 08S01
source: "Aborted connection %lld to db: '%-.192s' user: '%-.48s' host: '%-.64s' (%-.64s)"
dan: "Afbrød forbindelsen %lld til databasen '%-.192s' bruger: '%-.48s' vært: '%-.64s' (%-.64s)"

# ER_INDEX_REBUILD
source: "Failed rebuilding the index of dumped table '%-.192s'"
dan: "Kunne ikke genopbygge indekset for den dumpede tabel '%-.192s'"

# ER_MASTER
source: "Error from master: '%-.64s'"
dan: "Fejl fra master: '%-.64s'"

# ER_MASTER_NET_READ 08S01
source: "Net error reading from master"
dan: "Netværksfejl ved læsning fra master"

# ER_MASTER_NET_WRITE 08S01
source: "Net error writing to master"
dan: "Netværksfejl ved skrivning til master"

# ER_FT_MATCHING_KEY_NOT_FOUND
source: "Can't find FULLTEXT index matching the column list"
dan: "Kan ikke finde en FULLTEXT nøgle som svarer til kolonne listen"

# ER_LOCK_OR_ACTIVE_TRANSACTION
source: "Can't execute the given command because you have active locked tables or an active transaction"
dan: "Kan ikke udføre den givne kommando fordi der findes aktive, låste tabeller eller fordi der udføres en transaktion"

# ER_UNKNOWN_SYSTEM_VARIABLE
source: "Unknown system variable '%-.*s'"
dan: "Ukendt systemvariabel '%-.*s'"

# ER_CRASHED_ON_USAGE
source: "Table '%-.192s' is marked as crashed and should be repaired"
dan: "Tabellen '%-.192s' er markeret med fejl og bør repareres"

# ER_CRASHED_ON_REPAIR
source: "Table '%-.192s' is marked as crashed and last (automatic?) repair failed"
dan: "Tabellen '%-.192s' er markeret med fejl og sidste (automatiske?) REPAIR fejlede"

# ER_WARNING_NOT_COMPLETE_ROLLBACK
source: "Some non-transactional changed tables couldn't be rolled back"
dan: "Advarsel: Visse data i tabeller der ikke understøtter transaktioner kunne ikke tilbagestilles"

# ER_TRANS_CACHE_FULL
source: "Multi-statement transaction required more than 'max_binlog_cache_size' bytes of storage; increase this mariadbd variable and try again"
dan: "Fler-udtryks transaktion krævede mere plads en 'max_binlog_cache_size' bytes. Forhøj værdien af denne variabel og prøv igen"

# ER_SLAVE_MUST_STOP
source: "This operation cannot be performed as you have a running slave '%2$*1$s'; run STOP SLAVE '%2$*1$s' first"
dan: "Denne handling kunne ikke udføres med kørende slave '%2$*1$s', brug først kommandoen STOP SLAVE '%2$*1$s'"

# ER_SLAVE_NOT_RUNNING
source: "This operation requires a running slave; configure slave and do START SLAVE"
dan: "Denne handling kræver en kørende slave. Konfigurer en slave og brug kommandoen START SLAVE"

# ER_BAD_SLAVE
source: "The server is not configured as slave; fix in config file or with CHANGE MASTER TO"
dan: "Denne server er ikke konfigureret som slave. Ret in config-filen eller brug kommandoen CHANGE MASTER TO"

# ER_SLAVE_THREAD
source: "Could not create slave thread; check system resources"
dan: "Kunne ikke danne en slave-tråd; check systemressourcerne"

# ER_TOO_MANY_USER_CONNECTIONS 42000
source: "User %-.64s already has more than 'max_user_connections' active connections"
dan: "Brugeren %-.64s har allerede mere end 'max_user_connections' aktive forbindelser"

# ER_SET_CONSTANTS_ONLY
source: "You may only use constant expressions in this statement"
dan: "Du må kun bruge konstantudtryk med SET"

# ER_LOCK_WAIT_TIMEOUT
source: "Lock wait timeout exceeded; try restarting transaction"
dan: "Lock wait timeout overskredet"

# ER_LOCK_TABLE_FULL
source: "The total number of locks exceeds the lock table size"
dan: "Det totale antal låse overstiger størrelsen på låse-tabellen"

# ER_READ_ONLY_TRANSACTION 25000
source: "Update locks cannot be acquired during a READ UNCOMMITTED transaction"
dan: "Update lås kan ikke opnås under en READ UNCOMMITTED transaktion"

# ER_DROP_DB_WITH_READ_LOCK
source: "DROP DATABASE not allowed while thread is holding global read lock"
dan: "DROP DATABASE er ikke tilladt mens en tråd holder på globalt read lock"

# ER_CREATE_DB_WITH_READ_LOCK
source: "CREATE DATABASE not allowed while thread is holding global read lock"
dan: "CREATE DATABASE er ikke tilladt mens en tråd holder på globalt read lock"

# ER_GET_ERRMSG
source: "Got error %d '%-.200s' from %s"
dan: "Modtog fejl %d '%-.200s' fra %s"

# ER_GET_TEMPORARY_ERRMSG
source: "Got temporary error %d '%-.200s' from %s"
dan: "Modtog temporary fejl %d '%-.200s' fra %s"

# ER_DUP_ENTRY_WITH_KEY_NAME 23000 S1009
source: "Duplicate entry '%-.64T' for key '%-.192s'"
dan: "Ens værdier '%-.64T' for indeks '%-.192s'"

# ER_ACCESS_DENIED_NO_PASSWORD_ERROR 28000
source: "Access denied for user '%s'@'%s'"
dan: "Adgang nægtet bruger: '%s'@'%s'"

# ER_DUP_UNKNOWN_IN_INDEX 23000
source: "Duplicate entry for key '%-.192s'"
dan: "Flere ens nøgler for indeks '%-.192s'"
