Repository: vladbogo/test-translation
Catalog: dan.xlf
Languages: dan

# ER_NO
source: "NO"
dan: "NEJ"

# ER_YES
source: "YES"
dan: "JA"

# ER_CANT_CREATE_FILE
source: "Can't create file '%-.200s' (errno: %M)"
dan: "Kan ikke oprette filen '%-.200s' (Fejlkode: %M)"

# ER_CANT_CREATE_TABLE
source: "Can't create table %`s.%`s (errno: %M)"
dan: "Kan ikke oprette tabellen %`s.%`s (Fejlkode: %M)"

# ER_CANT_CREATE_DB
source: "Can't create database '%-.192s' (errno: %M)"
dan: "Kan ikke oprette databasen '%-.192s' (Fejlkode: %M)"

# ER_DB_CREATE_EXISTS
source: "Can't create database '%-.192s'; database exists"
dan: "Kan ikke oprette databasen '%-.192s'; databasen eksisterer"

# ER_DB_DROP_EXISTS
source: "Can't drop database '%-.192s'; database doesn't exist"
dan: "Kan ikke slette (droppe) '%-.192s'; databasen eksisterer ikke"

# ER_DB_DROP_DELETE
source: "Error dropping database (can't delete '%-.192s', errno: %M)"
dan: "Fejl ved sletning (drop) af databasen (kan ikke slette '%-.192s', Fejlkode %M)"

# ER_DB_DROP_RMDIR
source: "Error dropping database (can't rmdir '%-.192s', errno: %M)"
dan: "Fejl ved sletting af database (kan ikke slette folderen '%-.192s', Fejlkode %M)"

# ER_CANT_DELETE_FILE
source: "Error on delete of '%-.192s' (errno: %M)"
dan: "Fejl ved sletning af '%-.192s' (Fejlkode: %M)"

# ER_CANT_FIND_SYSTEM_REC
source: "Can't read record in system table"
dan: "Kan ikke læse posten i systemfolderen"

# ER_CANT_GET_STAT
source: "Can't get status of '%-.200s' (errno: %M)"
dan: "Kan ikke læse status af '%-.200s' (Fejlkode: %M)"

# ER_CANT_GET_WD
source: "Can't get working directory (errno: %M)"
dan: "Kan ikke læse aktive folder (Fejlkode: %M)"

# ER_CANT_LOCK
source: "Can't lock file (errno: %M)"
dan: "Kan ikke låse fil (Fejlkode: %M)"

# ER_CANT_OPEN_FILE
source: "Can't open file: '%-.200s' (errno: %M)"
dan: "Kan ikke åbne fil: '%-.200s' (Fejlkode: %M)"

# ER_FILE_NOT_FOUND
source: "Can't find file: '%-.200s' (errno: %M)"
dan: "Kan ikke finde fila: '%-.200s' (Fejlkode: %M)"

# ER_CANT_READ_DIR
source: "Can't read dir of '%-.192s' (errno: %M)"
dan: "Kan ikke læse folder '%-.192s' (Fejlkode: %M)"

# ER_CANT_SET_WD
source: "Can't change dir to '%-.192s' (errno: %M)"
dan: "Kan ikke skifte folder til '%-.192s' (Fejlkode: %M)"

# ER_CHECKREAD
source: "Record has changed since last read in table '%-.192s'"
dan: "Posten er ændret siden sidste læsning '%-.192s'"

# ER_DISK_FULL
source: "Disk full (%s); waiting for someone to free some space... (errno: %M)"
dan: "Ikke mere diskplads (%s). Venter på at få frigjort plads... (Fejlkode: %M)"

# ER_DUP_KEY 23000
source: "Can't write; duplicate key in table '%-.192s'"
dan: "Kan ikke skrive, flere ens nøgler i tabellen '%-.192s'"

# ER_ERROR_ON_CLOSE
source: "Error on close of '%-.192s' (errno: %M)"
dan: "Fejl ved lukning af '%-.192s' (Fejlkode: %M)"

# ER_ERROR_ON_READ
source: "Error reading file '%-.200s' (errno: %M)"
dan: "Fejl ved læsning af '%-.200s' (Fejlkode: %M)"

# ER_ERROR_ON_RENAME
source: "Error on rename of '%-.210s' to '%-.210s' (errno: %M)"
dan: "Fejl ved omdøbning af '%-.210s' til '%-.210s' (Fejlkode: %M)"

# ER_ERROR_ON_WRITE
source: "Error writing file '%-.200s' (errno: %M)"
dan: "Fejl ved skriving av filen '%-.200s' (Fejlkode: %M)"

# ER_FILE_USED
source: "'%-.192s' is locked against change"
dan: "'%-.192s' er låst mod opdateringer"

# ER_FILSORT_ABORT
source: "Sort aborted"
dan: "Sortering afbrudt"

# ER_FORM_NOT_FOUND
source: "View '%-.192s' doesn't exist for '%-.192s'"
dan: "View '%-.192s' eksisterer ikke for '%-.192s'"

# ER_KEY_NOT_FOUND
source: "Can't find record in '%-.192s'"
dan: "Kan ikke finde posten i '%-.192s'"

# ER_NOT_FORM_FILE
source: "Incorrect information in file: '%-.200s'"
dan: "Forkert indhold i: '%-.200s'"

# ER_NOT_KEYFILE
source: "Index for table '%-.200s' is corrupt; try to repair it"
dan: "Fejl i indeksfilen til tabellen '%-.200s'; prøv at reparere den"

# ER_OLD_KEYFILE
source: "Old key file for table '%-.192s'; repair it!"
dan: "Gammel indeksfil for tabellen '%-.192s'; reparer den"

# ER_OPEN_AS_READONLY
source: "Table '%-.192s' is read only"
dan: "'%-.192s' er skrivebeskyttet"

# ER_OUTOFMEMORY HY001 S1001
source: "Out of memory; restart server and try again (needed %d bytes)"
dan: "Ikke mere hukommelse. Genstart serveren og prøv igen (mangler %d bytes)"

# ER_OUT_OF_SORTMEMORY HY001 S1001
source: "Out of sort memory, consider increasing server sort buffer size"
dan: "Ikke mere sorteringshukommelse. Øg sorteringshukommelse (sort buffer size) for serveren"

# ER_UNEXPECTED_EOF
source: "Unexpected EOF found when reading file '%-.192s' (errno: %M)"
dan: "Uventet afslutning på fil (eof) ved læsning af filen '%-.192s' (Fejlkode: %M)"

# ER_CON_COUNT_ERROR 08004
source: "Too many connections"
dan: "For mange forbindelser (connections)"

# ER_OUT_OF_RESOURCES
source: "Out of memory."
dan: "Udgået for tråde/hukommelse"

# ER_BAD_HOST_ERROR 08S01
source: "Can't get hostname for your address"
dan: "Kan ikke få værtsnavn for din adresse"

# ER_HANDSHAKE_ERROR 08S01
source: "Bad handshake"
dan: "Forkert håndtryk (handshake)"

# ER_DBACCESS_DENIED_ERROR 42000
source: "Access denied for user '%s'@'%s' to database '%-.192s'"
dan: "Adgang nægtet bruger: '%s'@'%s' til databasen '%-.192s'"

# ER_ACCESS_DENIED_ERROR 28000
source: "Access denied for user '%s'@'%s' (using password: %s)"
dan: "Adgang nægtet bruger: '%s'@'%s' (Bruger adgangskode: %s)"

# ER_NO_DB_ERROR 3D000
source: "No database selected"
dan: "Ingen database valgt"

# ER_UNKNOWN_COM_ERROR 08S01
source: "Unknown command"
dan: "Ukendt kommando"

# ER_BAD_NULL_ERROR 23000
source: "Column '%-.192s' cannot be null"
dan: "Kolonne '%-.192s' kan ikke være NULL"

# ER_BAD_DB_ERROR 42000
source: "Unknown database '%-.192s'"
dan: "Ukendt database '%-.192s'"

# ER_TABLE_EXISTS_ERROR 42S01
source: "Table '%-.192s' already exists"
dan: "Tabellen '%-.192s' findes allerede"

# ER_BAD_TABLE_ERROR 42S02
source: "Unknown table '%-.100T'"
dan: "Ukendt tabel '%-.100T'"

# ER_NON_UNIQ_ERROR 23000
source: "Column '%-.192s' in %-.192s is ambiguous"
dan: "Felt: '%-.192s' i tabel %-.192s er ikke entydigt"

# ER_SERVER_SHUTDOWN 08S01
source: "Server shutdown in progress"
dan: "Database nedlukning er i gang"

# ER_BAD_FIELD_ERROR 42S22 S0022
source: "Unknown column '%-.192s' in '%-.192s'"
dan: "Ukendt kolonne '%-.192s' i tabel %-.192s"

# ER_WRONG_FIELD_WITH_GROUP 42000 S1009
source: "'%-.192s' isn't in GROUP BY"
dan: "Brugte '%-.192s' som ikke var i group by"

# ER_WRONG_GROUP_FIELD 42000 S1009
source: "Can't group on '%-.192s'"
dan: "Kan ikke gruppere på '%-.192s'"

# ER_WRONG_SUM_SELECT 42000 S1009
source: "Statement has sum functions and columns in same statement"
dan: "Udtrykket har summer (sum) funktioner og kolonner i samme udtryk"

# ER_WRONG_VALUE_COUNT 21S01
source: "Column count doesn't match value count"
dan: "Kolonne tæller stemmer ikke med antallet af værdier"

# ER_TOO_LONG_IDENT 42000 S1009
source: "Identifier name '%-.100T' is too long"
dan: "Navnet '%-.100T' er for langt"

# ER_DUP_FIELDNAME 42S21 S1009
source: "Duplicate column name '%-.192s'"
dan: "Feltnavnet '%-.192s' findes allerede"

# ER_DUP_KEYNAME 42000 S1009
source: "Duplicate key name '%-.192s'"
dan: "Indeksnavnet '%-.192s' findes allerede"

# ER_DUP_ENTRY 23000 S1009
source: "Duplicate entry '%-.192T' for key %d"
dan: "Ens værdier '%-.192T' for indeks %d"

# ER_WRONG_FIELD_SPEC 42000 S1009
source: "Incorrect column specifier for column '%-.192s'"
dan: "Forkert kolonnespecifikaton for felt '%-.192s'"

# ER_PARSE_ERROR 42000 s1009
source: "%s near '%-.80T' at line %d"
dan: "%s nær '%-.80T' på linje %d"

# ER_EMPTY_QUERY 42000
source: "Query was empty"
dan: "Forespørgsel var tom"

# ER_NONUNIQ_TABLE 42000 S1009
source: "Not unique table/alias: '%-.192s'"
dan: "Tabellen/aliaset: '%-.192s' er ikke unikt"

# ER_INVALID_DEFAULT 42000 S1009
source: "Invalid default value for '%-.192s'"
dan: "Ugyldig standardværdi for '%-.192s'"

# ER_MULTIPLE_PRI_KEY 42000 S1009
source: "Multiple primary key defined"
dan: "Flere primærnøgler specificeret"

# ER_TOO_MANY_KEYS 42000 S1009
source: "Too many keys specified; max %d keys allowed"
dan: "For mange nøgler specificeret. Kun %d nøgler må bruges"

# ER_TOO_MANY_KEY_PARTS 42000 S1009
source: "Too many key parts specified; max %d parts allowed"
dan: "For mange nøgledele specificeret. Kun %d dele må bruges"

# ER_TOO_LONG_KEY 42000 S1009
source: "Specified key was too long; max key length is %d bytes"
dan: "Specificeret nøgle var for lang. Maksimal nøglelængde er %d"

# ER_KEY_COLUMN_DOES_NOT_EXIST 42000 S1009
source: "Key column '%-.192s' doesn't exist in table"
dan: "Nøglefeltet '%-.192s' eksisterer ikke i tabellen"

# ER_TOO_BIG_FIELDLENGTH 42000 S1009
source: "Column length too big for column '%-.192s' (max = %lu); use BLOB or TEXT instead"
dan: "For stor feltlængde for kolonne '%-.192s' (maks = %lu). Brug BLOB i stedet"

# ER_WRONG_AUTO_KEY 42000 S1009
source: "Incorrect table definition; there can be only one auto column and it must be defined as a key"
dan: "Der kan kun specificeres eet AUTO_INCREMENT-felt, og det skal være indekseret"

# ER_NORMAL_SHUTDOWN
source: "%s (initiated by: %s): Normal shutdown"
dan: "%s (%s): Normal nedlukning"

# ER_GOT_SIGNAL
source: "%s: Got signal %d. Aborting!\n"
dan: "%s: Fangede signal %d. Afslutter!!\n"

# ER_SHUTDOWN_COMPLETE
source: "%s: Shutdown complete\n"
dan: "%s: Server lukket\n"

# ER_FORCING_CLOSE 08S01
source: "%s: Forcing close of thread %ld user: '%-.48s'\n"
dan: "%s: Forceret nedlukning af tråd: %ld bruger: '%-.48s'\n"

# ER_IPSOCK_ERROR 08S01
source: "Can't create IP socket"
dan: "Kan ikke oprette IP socket"

# ER_NO_SUCH_INDEX 42S12 S1009
source: "Table '%-.192s' has no index like the one used in CREATE INDEX; recreate the table"
dan: "Tabellen '%-.192s' har ikke den nøgle, som blev brugt i CREATE INDEX. Genopret tabellen"

# ER_WRONG_FIELD_TERMINATORS 42000 S1009
source: "Field separator argument is not what is expected; check the manual"
dan: "Felt adskiller er ikke som forventet, se dokumentationen"

# ER_BLOBS_AND_NO_TERMINATED 42000 S1009
source: "You can't use fixed rowlength with BLOBs; please use 'fields terminated by'"
dan: "Man kan ikke bruge faste feltlængder med BLOB. Brug i stedet 'fields terminated by'"

# ER_TEXTFILE_NOT_READABLE
source: "The file '%-.128s' must be in the database directory or be readable by all"
dan: "Filen '%-.128s' skal være i database-folderen, eller kunne læses af alle"

# ER_FILE_EXISTS_ERROR
source: "File '%-.200s' already exists"
dan: "Filen '%-.200s' eksisterer allerede"

# ER_LOAD_INFO
source: "Records: %ld Deleted: %ld Skipped: %ld Warnings: %ld"
dan: "Poster: %ld Fjernet: %ld Sprunget over: %ld Advarsler: %ld"

# ER_ALTER_INFO
source: "Records: %ld Duplicates: %ld"
dan: "Poster: %ld Ens: %ld"

# ER_WRONG_SUB_KEY
source: "Incorrect prefix key; the used key part isn't a string, the used length is longer than the key part, or the storage engine doesn't support unique prefix keys"
dan: "Forkert indeksdel. Den anvendte nøgledel er ikke en streng eller længden er større end nøglelængden"

# ER_CANT_REMOVE_ALL_FIELDS 42000
source: "You can't delete all columns with ALTER TABLE; use DROP TABLE instead"
dan: "Man kan ikke slette alle felter med ALTER TABLE. Brug DROP TABLE i stedet"

# ER_CANT_DROP_FIELD_OR_KEY 42000
source: "Can't DROP %s %`-.192s; check that it exists"
dan: "Kan ikke udføre DROP %s %`-.192s. Undersøg om feltet/nøglen eksisterer"

# ER_INSERT_INFO
source: "Records: %ld Duplicates: %ld Warnings: %ld"
dan: "Poster: %ld Ens: %ld Advarsler: %ld"

# ER_NO_SUCH_THREAD
source: "Unknown thread id: %lu"
dan: "Ukendt tråd id: %lu"

# ER_KILL_DENIED_ERROR
source: "You are not owner of thread %lld"
dan: "Du er ikke ejer af tråden %lld"

# ER_NO_TABLES_USED
source: "No tables used"
dan: "Ingen tabeller i brug"

# ER_TOO_BIG_SET
source: "Too many strings for column %-.192s and SET"
dan: "For mange tekststrenge til specifikationen af SET i kolonne %-.192s"

# ER_NO_UNIQUE_LOGFILE
source: "Can't generate a unique log-filename %-.200s.(1-999)\n"
dan: "Kan ikke lave unikt log-filnavn %-.200s.(1-999)\n"

# ER_TABLE_NOT_LOCKED_FOR_WRITE
source: "Table '%-.192s' was locked with a READ lock and can't be updated"
dan: "Tabellen '%-.192s' var låst med READ lås og kan ikke opdateres"

# ER_TABLE_NOT_LOCKED
source: "Table '%-.192s' was not locked with LOCK TABLES"
dan: "Tabellen '%-.192s' var ikke låst med LOCK TABLES"

# ER_WRONG_DB_NAME 42000
source: "Incorrect database name '%-.100T'"
dan: "Ugyldigt database navn '%-.100T'"

# ER_WRONG_TABLE_NAME 42000
source: "Incorrect table name '%-.100s'"
dan: "Ugyldigt tabel navn '%-.100s'"

# ER_TOO_BIG_SELECT 42000
source: "The SELECT would examine more than MAX_JOIN_SIZE rows; check your WHERE and use SET SQL_BIG_SELECTS=1 or SET MAX_JOIN_SIZE=# if the SELECT is okay"
dan: "SELECT ville undersøge for mange poster og ville sandsynligvis tage meget lang tid. Undersøg WHERE delen og brug SET SQL_BIG_SELECTS=1 hvis udtrykket er korrekt"

# ER_UNKNOWN_ERROR
source: "Unknown error"
dan: "Ukendt fejl"

# ER_UNKNOWN_PROCEDURE 42000
source: "Unknown procedure '%-.192s'"
dan: "Ukendt procedure %-.192s"

# ER_WRONG_PARAMCOUNT_TO_PROCEDURE 42000
source: "Incorrect parameter count to procedure '%-.192s'"
dan: "Forkert antal parametre til proceduren %-.192s"

# ER_WRONG_PARAMETERS_TO_PROCEDURE
source: "Incorrect parameters to procedure '%-.192s'"
dan: "Forkert(e) parametre til proceduren %-.192s"

# ER_UNKNOWN_TABLE 42S02
source: "Unknown table '%-.192s' in %-.32s"
dan: "Ukendt tabel '%-.192s' i %-.32s"

# ER_FIELD_SPECIFIED_TWICE 42000
source: "Column '%-.192s' specified twice"
dan: "Feltet '%-.192s' er anvendt to gange"

# ER_INVALID_GROUP_FUNC_USE
source: "Invalid use of group function"
dan: "Forkert brug af grupperings-funktion"

# ER_UNSUPPORTED_EXTENSION 42000
source: "Table '%-.192s' uses an extension that doesn't exist in this MariaDB version"
dan: "Tabellen '%-.192s' bruger et filtypenavn som ikke findes i denne MariaDB version"

# ER_TABLE_MUST_HAVE_COLUMNS 42000
source: "A table must have at least 1 column"
dan: "En tabel skal have mindst een kolonne"

# ER_RECORD_FILE_FULL
source: "The table '%-.192s' is full"
dan: "Tabellen '%-.192s' er fuld"

# ER_UNKNOWN_CHARACTER_SET 42000
source: "Unknown character set: '%-.64s'"
dan: "Ukendt tegnsæt: '%-.64s'"

# ER_TOO_MANY_TABLES
source: "Too many tables; MariaDB can only use %d tables in a join"
dan: "For mange tabeller. MariaDB kan kun bruge %d tabeller i et join"

# ER_TOO_MANY_FIELDS
source: "Too many columns"
dan: "For mange felter"

# ER_TOO_BIG_ROWSIZE 42000
source: "Row size too large. The maximum row size for the used table type, not counting BLOBs, is %ld. This includes storage overhead, check the manual. You have to change some columns to TEXT or BLOBs"
dan: "For store poster. Max post størrelse, uden BLOB's, er %ld. Du må lave nogle felter til BLOB's"

# ER_STACK_OVERRUN
source: "Thread stack overrun: Used: %ld of a %ld stack. Use 'mariadbd --thread_stack=#' to specify a bigger stack if needed"
dan: "Thread stack brugt: Brugt: %ld af en %ld stak. Brug 'mariadbd --thread_stack=#' for at allokere en større stak om nødvendigt"

# ER_WRONG_OUTER_JOIN 42000
source: "Cross dependency found in OUTER JOIN; examine your ON conditions"
dan: "Krydsreferencer fundet i OUTER JOIN; check dine ON conditions"

# ER_CANT_FIND_UDF
source: "Can't load function '%-.192s'"
dan: "Kan ikke læse funktionen '%-.192s'"

# ER_CANT_INITIALIZE_UDF
source: "Can't initialize function '%-.192s'; %-.80s"
dan: "Kan ikke starte funktionen '%-.192s'; %-.80s"

# ER_UDF_NO_PATHS
source: "No paths allowed for shared library"
dan: "Angivelse af sti ikke tilladt for delt bibliotek"

# ER_UDF_EXISTS
source: "Function '%-.192s' already exists"
dan: "Funktionen '%-.192s' findes allerede"

# ER_CANT_OPEN_LIBRARY
source: "Can't open shared library '%-.192s' (errno: %d, %-.128s)"
dan: "Kan ikke åbne delt bibliotek '%-.192s' (errno: %d, %-.128s)"

# ER_CANT_FIND_DL_ENTRY
source: "Can't find symbol '%-.128s' in library"
dan: "Kan ikke finde funktionen '%-.128s' i bibliotek"

# ER_FUNCTION_NOT_DEFINED
source: "Function '%-.192s' is not defined"
dan: "Funktionen '%-.192s' er ikke defineret"

# ER_HOST_IS_BLOCKED
source: "Host '%-.64s' is blocked because of many connection errors; unblock with 'mariadb-admin flush-hosts'"
dan: "Værten '%-.64s' er blokeret på grund af mange fejlforespørgsler. Lås op med 'mariadb-admin flush-hosts'"

# ER_HOST_NOT_PRIVILEGED
source: "Host '%-.64s' is not allowed to connect to this MariaDB server"
dan: "Værten '%-.64s' kan ikke tilkoble denne MariaDB-server"

# ER_PASSWORD_ANONYMOUS_USER 42000
source: "You are using MariaDB as an anonymous user and anonymous users are not allowed to modify user settings"
dan: "Du bruger MariaDB som anonym bruger. Anonyme brugere må ikke ændre adgangskoder"

# ER_PASSWORD_NOT_ALLOWED 42000
source: "You must have privileges to update tables in the mysql database to be able to change passwords for others"
dan: "Du skal have tilladelse til at opdatere tabeller i MariaDB databasen for at ændre andres adgangskoder"

# ER_PASSWORD_NO_MATCH 28000
source: "Can't find any matching row in the user table"
dan: "Kan ikke finde nogen tilsvarende poster i bruger tabellen"

# ER_UPDATE_INFO
source: "Rows matched: %ld Changed: %ld Warnings: %ld"
dan: "Poster fundet: %ld Ændret: %ld Advarsler: %ld"

# ER_CANT_CREATE_THREAD
source: "Can't create a new thread (errno %M); if you are not out of available memory, you can consult the manual for a possible OS-dependent bug"
dan: "Kan ikke danne en ny tråd (fejl nr. %M). Hvis computeren ikke er løbet tør for hukommelse, kan du se i brugervejledningen for en mulig operativ-system - afhængig fejl"

# ER_WRONG_VALUE_COUNT_ON_ROW 21S01
source: "Column count doesn't match value count at row %lu"
dan: "Kolonne antallet stemmer ikke overens med antallet af værdier i post %lu"

# ER_CANT_REOPEN_TABLE
source: "Can't reopen table: '%-.192s'"
dan: "Kan ikke genåbne tabel '%-.192s"

# ER_INVALID_USE_OF_NULL 22004
source: "Invalid use of NULL value"
dan: "Forkert brug af nulværdi (NULL)"

# ER_REGEXP_ERROR 42000
source: "Regex error '%s'"
dan: "Fik fejl '%s' fra regexp"

# ER_MIX_OF_GROUP_FUNC_AND_FIELDS 42000
source: "Mixing of GROUP columns (MIN(),MAX(),COUNT(),...) with no GROUP columns is illegal if there is no GROUP BY clause"
dan: "Sammenblanding af GROUP kolonner (MIN(),MAX(),COUNT()...) uden GROUP kolonner er ikke tilladt, hvis der ikke er noget GROUP BY prædikat"

# ER_NONEXISTING_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s'"
dan: "Denne tilladelse findes ikke for brugeren '%-.48s' på vært '%-.64s'"

# ER_TABLEACCESS_DENIED_ERROR 42000
source: "%-.100T command denied to user '%s'@'%s' for table '%-.192s'"
dan: "%-.100T-kommandoen er ikke tilladt for brugeren '%s'@'%s' for tabellen '%-.192s'"

# ER_COLUMNACCESS_DENIED_ERROR 42000
source: "%-.32s command denied to user '%s'@'%s' for column '%-.192s' in table '%-.192s'"
dan: "%-.32s-kommandoen er ikke tilladt for brugeren '%s'@'%s' for kolonne '%-.192s' in tabellen '%-.192s'"

# ER_ILLEGAL_GRANT_FOR_TABLE 42000
source: "Illegal GRANT/REVOKE command; please consult the manual to see which privileges can be used"
dan: "Forkert GRANT/REVOKE kommando. Se i brugervejledningen hvilke privilegier der kan specificeres"

# ER_GRANT_WRONG_HOST_OR_USER 42000
source: "The host or user argument to GRANT is too long"
dan: "Værts- eller brugernavn for langt til GRANT"

# ER_NO_SUCH_TABLE 42S02
source: "Table '%-.192s.%-.192s' doesn't exist"
dan: "Tabellen '%-.192s.%-.192s' eksisterer ikke"

# ER_NONEXISTING_TABLE_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s' on table '%-.192s'"
dan: "Denne tilladelse eksisterer ikke for brugeren '%-.48s' på vært '%-.64s' for tabellen '%-.192s'"

# ER_NOT_ALLOWED_COMMAND 42000
source: "The used command is not allowed with this MariaDB version"
dan: "Den brugte kommando er ikke tilladt med denne udgave af MariaDB"

# ER_SYNTAX_ERROR 42000
source: "You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use"
dan: "Der er en fejl i SQL syntaksen"

# ER_DELAYED_CANT_CHANGE_LOCK
source: "Delayed insert thread couldn't get requested lock for table %-.192s"
dan: "Forsinket indsættelse tråden (delayed insert thread) kunne ikke opnå lås på tabellen %-.192s"

# ER_TOO_MANY_DELAYED_THREADS
source: "Too many delayed threads in use"
dan: "For mange slettede tråde (threads) i brug"

# ER_ABORTING_CONNECTION 08S01
source: "Aborted connection %ld to db: '%-.192s' user: '%-.48s' (%-.64s)"
dan: "Afbrudt forbindelse %ld til database: '%-.192s' bruger: '%-.48s' (%-.64s)"

# ER_NET_PACKET_TOO_LARGE 08S01
source: "Got a packet bigger than 'max_allowed_packet' bytes"
dan: "Modtog en datapakke som var større end 'max_allowed_packet'"

# ER_NET_READ_ERROR_FROM_PIPE 08S01
source: "Got a read error from the connection pipe"
dan: "Fik læsefejl fra forbindelse (connection pipe)"

# ER_NET_FCNTL_ERROR 08S01
source: "Got an error from fcntl()"
dan: "Fik fejlmeddelelse fra fcntl()"

# ER_NET_PACKETS_OUT_OF_ORDER 08S01
source: "Got packets out of order"
dan: "Modtog ikke datapakker i korrekt rækkefølge"

# ER_NET_UNCOMPRESS_ERROR 08S01
source: "Couldn't uncompress communication packet"
dan: "Kunne ikke dekomprimere kommunikations-pakke (communication packet)"

# ER_NET_READ_ERROR 08S01
source: "Got an error reading communication packets"
dan: "Fik fejlmeddelelse ved læsning af kommunikations-pakker (communication packets)"

# ER_NET_READ_INTERRUPTED 08S01
source: "Got timeout reading communication packets"
dan: "Timeout-fejl ved læsning af kommunukations-pakker (communication packets)"

# ER_NET_ERROR_ON_WRITE 08S01
source: "Got an error writing communication packets"
dan: "Fik fejlmeddelelse ved skrivning af kommunukations-pakker (communication packets)"

# ER_NET_WRITE_INTERRUPTED 08S01
source: "Got timeout writing communication packets"
dan: "Timeout-fejl ved skrivning af kommunukations-pakker (communication packets)"

# ER_TOO_LONG_STRING 42000
source: "Result string is longer than 'max_allowed_packet' bytes"
dan: "Strengen med resultater er større end 'max_allowed_packet'"

# ER_TABLE_CANT_HANDLE_BLOB 42000
source: "Storage engine %s doesn't support BLOB/TEXT columns"
dan: "Denne tabeltype (%s) understøtter ikke brug af BLOB og TEXT kolonner"

# ER_TABLE_CANT_HANDLE_AUTO_INCREMENT 42000
source: "Storage engine %s doesn't support AUTO_INCREMENT columns"
dan: "Denne tabeltype understøtter (%s) ikke brug af AUTO_INCREMENT kolonner"

# ER_DELAYED_INSERT_TABLE_LOCKED
source: "INSERT DELAYED can't be used with table '%-.192s' because it is locked with LOCK TABLES"
dan: "INSERT DELAYED kan ikke bruges med tabellen '%-.192s', fordi tabellen er låst med LOCK TABLES"

# ER_WRONG_COLUMN_NAME 42000
source: "Incorrect column name '%-.100s'"
dan: "Forkert kolonnenavn '%-.100s'"

# ER_WRONG_MRG_TABLE
source: "Unable to open underlying table which is differently defined or of non-MyISAM type or doesn't exist"
dan: "Tabellerne i MERGE er ikke defineret ens"

# ER_DUP_UNIQUE 23000
source: "Can't write, because of unique constraint, to table '%-.192s'"
dan: "Kan ikke skrive til tabellen '%-.192s' fordi det vil bryde CONSTRAINT regler"

# ER_BLOB_KEY_WITHOUT_LENGTH 42000
source: "BLOB/TEXT column '%-.192s' used in key specification without a key length"
dan: "BLOB kolonnen '%-.192s' brugt i nøglespecifikation uden nøglelængde"

# ER_PRIMARY_CANT_HAVE_NULL 42000
source: "All parts of a PRIMARY KEY must be NOT NULL; if you need NULL in a key, use UNIQUE instead"
dan: "Alle dele af en PRIMARY KEY skal være NOT NULL; Hvis du skal bruge NULL i nøglen, brug UNIQUE istedet"

# ER_TOO_MANY_ROWS 42000
source: "Result consisted of more than one row"
dan: "Resultatet bestod af mere end een række"
