Repository: vladbogo/test-translation
Catalog: est.xlf
Languages: est

# ER_NO
source: "NO"
est: "EI"

# ER_YES
source: "YES"
est: "JAH"

# ER_CANT_CREATE_FILE
source: "Can't create file '%-.200s' (errno: %M)"
est: "Ei suuda luua faili '%-.200s' (veakood: %M)"

# ER_CANT_CREATE_TABLE
source: "Can't create table %`s.%`s (errno: %M)"
est: "Ei suuda luua tabelit %`s.%`s (veakood: %M)"

# ER_CANT_CREATE_DB
source: "Can't create database '%-.192s' (errno: %M)"
est: "Ei suuda luua andmebaasi '%-.192s' (veakood: %M)"

# ER_DB_CREATE_EXISTS
source: "Can't create database '%-.192s'; database exists"
est: "Ei suuda luua andmebaasi '%-.192s': andmebaas juba eksisteerib"

# ER_DB_DROP_EXISTS
source: "Can't drop database '%-.192s'; database doesn't exist"
est: "Ei suuda kustutada andmebaasi '%-.192s': andmebaasi ei eksisteeri"

# ER_DB_DROP_DELETE
source: "Error dropping database (can't delete '%-.192s', errno: %M)"
est: "Viga andmebaasi kustutamisel (ei suuda kustutada faili '%-.192s', veakood: %M)"

# ER_DB_DROP_RMDIR
source: "Error dropping database (can't rmdir '%-.192s', errno: %M)"
est: "Viga andmebaasi kustutamisel (ei suuda kustutada kataloogi '%-.192s', veakood: %M)"

# ER_CANT_DELETE_FILE
source: "Error on delete of '%-.192s' (errno: %M)"
est: "Viga '%-.192s' kustutamisel (veakood: %M)"

# ER_CANT_FIND_SYSTEM_REC
source: "Can't read record in system table"
est: "Ei suuda lugeda kirjet süsteemsest tabelist"

# ER_CANT_GET_STAT
source: "Can't get status of '%-.200s' (errno: %M)"
est: "Ei suuda lugeda '%-.200s' olekut (veakood: %M)"

# ER_CANT_GET_WD
source: "Can't get working directory (errno: %M)"
est: "Ei suuda identifitseerida jooksvat kataloogi (veakood: %M)"

# ER_CANT_LOCK
source: "Can't lock file (errno: %M)"
est: "Ei suuda lukustada faili (veakood: %M)"

# ER_CANT_OPEN_FILE
source: "Can't open file: '%-.200s' (errno: %M)"
est: "Ei suuda avada faili '%-.200s' (veakood: %M)"

# ER_FILE_NOT_FOUND
source: "Can't find file: '%-.200s' (errno: %M)"
est: "Ei suuda leida faili '%-.200s' (veakood: %M)"

# ER_CANT_READ_DIR
source: "Can't read dir of '%-.192s' (errno: %M)"
est: "Ei suuda lugeda kataloogi '%-.192s' (veakood: %M)"

# ER_CANT_SET_WD
source: "Can't change dir to '%-.192s' (errno: %M)"
est: "Ei suuda siseneda kataloogi '%-.192s' (veakood: %M)"

# ER_CHECKREAD
source: "Record has changed since last read in table '%-.192s'"
est: "Kirje tabelis '%-.192s' on muutunud viimasest lugemisest saadik"

# ER_DISK_FULL
source: "Disk full (%s); waiting for someone to free some space... (errno: %M)"
est: "Ketas täis (%s). Ootame kuni tekib vaba ruumi... (veakood: %M)"

# ER_DUP_KEY 23000
source: "Can't write; duplicate key in table '%-.192s'"
est: "Ei saa kirjutada, korduv võti tabelis '%-.192s'"

# ER_ERROR_ON_CLOSE
source: "Error on close of '%-.192s' (errno: %M)"
est: "Viga faili '%-.192s' sulgemisel (veakood: %M)"

# ER_ERROR_ON_READ
source: "Error reading file '%-.200s' (errno: %M)"
est: "Viga faili '%-.200s' lugemisel (veakood: %M)"

# ER_ERROR_ON_RENAME
source: "Error on rename of '%-.210s' to '%-.210s' (errno: %M)"
est: "Viga faili '%-.210s' ümbernimetamisel '%-.210s'-ks (veakood: %M)"

# ER_ERROR_ON_WRITE
source: "Error writing file '%-.200s' (errno: %M)"
est: "Viga faili '%-.200s' kirjutamisel (veakood: %M)"

# ER_FILE_USED
source: "'%-.192s' is locked against change"
est: "'%-.192s' on lukustatud muudatuste vastu"

# ER_FILSORT_ABORT
source: "Sort aborted"
est: "Sorteerimine katkestatud"

# ER_FORM_NOT_FOUND
source: "View '%-.192s' doesn't exist for '%-.192s'"
est: "Vaade '%-.192s' ei eksisteeri '%-.192s' jaoks"

# ER_KEY_NOT_FOUND
source: "Can't find record in '%-.192s'"
est: "Ei suuda leida kirjet '%-.192s'-s"

# ER_NOT_FORM_FILE
source: "Incorrect information in file: '%-.200s'"
est: "Vigane informatsioon failis '%-.200s'"

# ER_NOT_KEYFILE
source: "Index for table '%-.200s' is corrupt; try to repair it"
est: "Tabeli '%-.200s' võtmefail on vigane; proovi seda parandada"

# ER_OLD_KEYFILE
source: "Old key file for table '%-.192s'; repair it!"
est: "Tabeli '%-.192s' võtmefail on aegunud; paranda see!"

# ER_OPEN_AS_READONLY
source: "Table '%-.192s' is read only"
est: "Tabel '%-.192s' on ainult lugemiseks"

# ER_OUTOFMEMORY HY001 S1001
source: "Out of memory; restart server and try again (needed %d bytes)"
est: "Mälu sai otsa. Proovi MariaDB uuesti käivitada (puudu jäi %d baiti)"

# ER_OUT_OF_SORTMEMORY HY001 S1001
source: "Out of sort memory, consider increasing server sort buffer size"
est: "Mälu sai sorteerimisel otsa. Suurenda MariaDB-i sorteerimispuhvrit"

# ER_UNEXPECTED_EOF
source: "Unexpected EOF found when reading file '%-.192s' (errno: %M)"
est: "Ootamatu faililõpumärgend faili '%-.192s' lugemisel (veakood: %M)"

# ER_CON_COUNT_ERROR 08004
source: "Too many connections"
est: "Liiga palju samaaegseid ühendusi"

# ER_OUT_OF_RESOURCES
source: "Out of memory."
est: "Mälu sai otsa. Võimalik, et aitab swap-i lisamine või käsu 'ulimit' abil MariaDB-le rohkema mälu kasutamise lubamine"

# ER_BAD_HOST_ERROR 08S01
source: "Can't get hostname for your address"
est: "Ei suuda lahendada IP aadressi masina nimeks"

# ER_HANDSHAKE_ERROR 08S01
source: "Bad handshake"
est: "Väär handshake"

# ER_DBACCESS_DENIED_ERROR 42000
source: "Access denied for user '%s'@'%s' to database '%-.192s'"
est: "Ligipääs keelatud kasutajale '%s'@'%s' andmebaasile '%-.192s'"

# ER_ACCESS_DENIED_ERROR 28000
source: "Access denied for user '%s'@'%s' (using password: %s)"
est: "Ligipääs keelatud kasutajale '%s'@'%s' (kasutab parooli: %s)"

# ER_NO_DB_ERROR 3D000
source: "No database selected"
est: "Andmebaasi ei ole valitud"

# ER_UNKNOWN_COM_ERROR 08S01
source: "Unknown command"
est: "Tundmatu käsk"

# ER_BAD_NULL_ERROR 23000
source: "Column '%-.192s' cannot be null"
est: "Tulp '%-.192s' ei saa omada nullväärtust"

# ER_BAD_DB_ERROR 42000
source: "Unknown database '%-.192s'"
est: "Tundmatu andmebaas '%-.192s'"

# ER_TABLE_EXISTS_ERROR 42S01
source: "Table '%-.192s' already exists"
est: "Tabel '%-.192s' juba eksisteerib"

# ER_BAD_TABLE_ERROR 42S02
source: "Unknown table '%-.100T'"
est: "Tundmatu tabel '%-.100T'"

# ER_NON_UNIQ_ERROR 23000
source: "Column '%-.192s' in %-.192s is ambiguous"
est: "Väli '%-.192s' %-.192s-s ei ole ühene"

# ER_SERVER_SHUTDOWN 08S01
source: "Server shutdown in progress"
est: "Serveri seiskamine käib"

# ER_BAD_FIELD_ERROR 42S22 S0022
source: "Unknown column '%-.192s' in '%-.192s'"
est: "Tundmatu tulp '%-.192s' '%-.192s'-s"

# ER_WRONG_FIELD_WITH_GROUP 42000 S1009
source: "'%-.192s' isn't in GROUP BY"
est: "'%-.192s' puudub GROUP BY klauslis"

# ER_WRONG_GROUP_FIELD 42000 S1009
source: "Can't group on '%-.192s'"
est: "Ei saa grupeerida '%-.192s' järgi"

# ER_WRONG_SUM_SELECT 42000 S1009
source: "Statement has sum functions and columns in same statement"
est: "Lauses on korraga nii tulbad kui summeerimisfunktsioonid"

# ER_WRONG_VALUE_COUNT 21S01
source: "Column count doesn't match value count"
est: "Tulpade arv erineb väärtuste arvust"

# ER_TOO_LONG_IDENT 42000 S1009
source: "Identifier name '%-.100T' is too long"
est: "Identifikaatori '%-.100T' nimi on liiga pikk"

# ER_DUP_FIELDNAME 42S21 S1009
source: "Duplicate column name '%-.192s'"
est: "Kattuv tulba nimi '%-.192s'"

# ER_DUP_KEYNAME 42000 S1009
source: "Duplicate key name '%-.192s'"
est: "Kattuv võtme nimi '%-.192s'"

# ER_DUP_ENTRY 23000 S1009
source: "Duplicate entry '%-.192T' for key %d"
est: "Kattuv väärtus '%-.192T' võtmele %d"

# ER_WRONG_FIELD_SPEC 42000 S1009
source: "Incorrect column specifier for column '%-.192s'"
est: "Vigane tulba kirjeldus tulbale '%-.192s'"

# ER_PARSE_ERROR 42000 s1009
source: "%s near '%-.80T' at line %d"
est: "%s '%-.80T' ligidal real %d"

# ER_EMPTY_QUERY 42000
source: "Query was empty"
est: "Tühi päring"

# ER_NONUNIQ_TABLE 42000 S1009
source: "Not unique table/alias: '%-.192s'"
est: "Ei ole unikaalne tabel/alias '%-.192s'"

# ER_INVALID_DEFAULT 42000 S1009
source: "Invalid default value for '%-.192s'"
est: "Vigane vaikeväärtus '%-.192s' jaoks"

# ER_MULTIPLE_PRI_KEY 42000 S1009
source: "Multiple primary key defined"
est: "Mitut primaarset võtit ei saa olla"

# ER_TOO_MANY_KEYS 42000 S1009
source: "Too many keys specified; max %d keys allowed"
est: "Liiga palju võtmeid. Maksimaalselt võib olla %d võtit"

# ER_TOO_MANY_KEY_PARTS 42000 S1009
source: "Too many key parts specified; max %d parts allowed"
est: "Võti koosneb liiga paljudest osadest. Maksimaalselt võib olla %d osa"

# ER_TOO_LONG_KEY 42000 S1009
source: "Specified key was too long; max key length is %d bytes"
est: "Võti on liiga pikk. Maksimaalne võtmepikkus on %d"

# ER_KEY_COLUMN_DOES_NOT_EXIST 42000 S1009
source: "Key column '%-.192s' doesn't exist in table"
est: "Võtme tulp '%-.192s' puudub tabelis"

# ER_TOO_BIG_FIELDLENGTH 42000 S1009
source: "Column length too big for column '%-.192s' (max = %lu); use BLOB or TEXT instead"
est: "Tulba '%-.192s' pikkus on liiga pikk (maksimaalne pikkus: %lu). Kasuta BLOB väljatüüpi"

# ER_WRONG_AUTO_KEY 42000 S1009
source: "Incorrect table definition; there can be only one auto column and it must be defined as a key"
est: "Vigane tabelikirjeldus; Tabelis tohib olla üks auto_increment tüüpi tulp ning see peab olema defineeritud võtmena"

# ER_NORMAL_SHUTDOWN
source: "%s (initiated by: %s): Normal shutdown"
est: "%s (%s): MariaDB lõpetas"

# ER_GOT_SIGNAL
source: "%s: Got signal %d. Aborting!\n"
est: "%s: sain signaali %d. Lõpetan!\n"

# ER_SHUTDOWN_COMPLETE
source: "%s: Shutdown complete\n"
est: "%s: Lõpp\n"

# ER_FORCING_CLOSE 08S01
source: "%s: Forcing close of thread %ld user: '%-.48s'\n"
est: "%s: Sulgen jõuga lõime %ld kasutaja: '%-.48s'\n"

# ER_IPSOCK_ERROR 08S01
source: "Can't create IP socket"
est: "Ei suuda luua IP socketit"

# ER_NO_SUCH_INDEX 42S12 S1009
source: "Table '%-.192s' has no index like the one used in CREATE INDEX; recreate the table"
est: "Tabelil '%-.192s' puuduvad võtmed. Loo tabel uuesti"

# ER_WRONG_FIELD_TERMINATORS 42000 S1009
source: "Field separator argument is not what is expected; check the manual"
est: "Väljade eraldaja erineb oodatust. Tutvu kasutajajuhendiga"

# ER_BLOBS_AND_NO_TERMINATED 42000 S1009
source: "You can't use fixed rowlength with BLOBs; please use 'fields terminated by'"
est: "BLOB-tüüpi väljade olemasolul ei saa kasutada fikseeritud väljapikkust. Vajalik 'fields terminated by' määrang"

# ER_TEXTFILE_NOT_READABLE
source: "The file '%-.128s' must be in the database directory or be readable by all"
est: "Fail '%-.128s' peab asuma andmebaasi kataloogis või olema kõigile loetav"

# ER_FILE_EXISTS_ERROR
source: "File '%-.200s' already exists"
est: "Fail '%-.200s' juba eksisteerib"

# ER_LOAD_INFO
source: "Records: %ld Deleted: %ld Skipped: %ld Warnings: %ld"
est: "Kirjeid: %ld Kustutatud: %ld Vahele jäetud: %ld Hoiatusi: %ld"

# ER_ALTER_INFO
source: "Records: %ld Duplicates: %ld"
est: "Kirjeid: %ld Kattuvaid: %ld"

# ER_WRONG_SUB_KEY
source: "Incorrect prefix key; the used key part isn't a string, the used length is longer than the key part, or the storage engine doesn't support unique prefix keys"
est: "Vigane võtme osa. Kasutatud võtmeosa ei ole string tüüpi, määratud pikkus on pikem kui võtmeosa või tabelihandler ei toeta seda tüüpi võtmeid"

# ER_CANT_REMOVE_ALL_FIELDS 42000
source: "You can't delete all columns with ALTER TABLE; use DROP TABLE instead"
est: "ALTER TABLE kasutades ei saa kustutada kõiki tulpasid. Kustuta tabel DROP TABLE abil"

# ER_CANT_DROP_FIELD_OR_KEY 42000
source: "Can't DROP %s %`-.192s; check that it exists"
est: "Ei suuda kustutada (DROP %s) %`-.192s. Kontrolli kas tulp/võti eksisteerib"

# ER_INSERT_INFO
source: "Records: %ld Duplicates: %ld Warnings: %ld"
est: "Kirjeid: %ld Kattuvaid: %ld Hoiatusi: %ld"

# ER_NO_SUCH_THREAD
source: "Unknown thread id: %lu"
est: "Tundmatu lõim: %lu"

# ER_KILL_DENIED_ERROR
source: "You are not owner of thread %lld"
est: "Ei ole lõime %lld omanik"

# ER_NO_TABLES_USED
source: "No tables used"
est: "Ühtegi tabelit pole kasutusel"

# ER_TOO_BIG_SET
source: "Too many strings for column %-.192s and SET"
est: "Liiga palju string tulbale %-.192s tüübile SET"

# ER_NO_UNIQUE_LOGFILE
source: "Can't generate a unique log-filename %-.200s.(1-999)\n"
est: "Ei suuda luua unikaalset logifaili nime %-.200s.(1-999)\n"

# ER_TABLE_NOT_LOCKED_FOR_WRITE
source: "Table '%-.192s' was locked with a READ lock and can't be updated"
est: "Tabel '%-.192s' on lukustatud READ lukuga ning ei ole muudetav"

# ER_TABLE_NOT_LOCKED
source: "Table '%-.192s' was not locked with LOCK TABLES"
est: "Tabel '%-.192s' ei ole lukustatud käsuga LOCK TABLES"

# ER_WRONG_DB_NAME 42000
source: "Incorrect database name '%-.100T'"
est: "Vigane andmebaasi nimi '%-.100T'"

# ER_WRONG_TABLE_NAME 42000
source: "Incorrect table name '%-.100s'"
est: "Vigane tabeli nimi '%-.100s'"

# ER_TOO_BIG_SELECT 42000
source: "The SELECT would examine more than MAX_JOIN_SIZE rows; check your WHERE and use SET SQL_BIG_SELECTS=1 or SET MAX_JOIN_SIZE=# if the SELECT is okay"
est: "SELECT lause peab läbi vaatama suure hulga kirjeid ja võtaks tõenäoliselt liiga kaua aega. Tasub kontrollida WHERE klauslit ja vajadusel kasutada käsku SET SQL_BIG_SELECTS=1"

# ER_UNKNOWN_ERROR
source: "Unknown error"
est: "Tundmatu viga"

# ER_UNKNOWN_PROCEDURE 42000
source: "Unknown procedure '%-.192s'"
est: "Tundmatu protseduur '%-.192s'"

# ER_WRONG_PARAMCOUNT_TO_PROCEDURE 42000
source: "Incorrect parameter count to procedure '%-.192s'"
est: "Vale parameetrite hulk protseduurile '%-.192s'"

# ER_WRONG_PARAMETERS_TO_PROCEDURE
source: "Incorrect parameters to procedure '%-.192s'"
est: "Vigased parameetrid protseduurile '%-.192s'"

# ER_UNKNOWN_TABLE 42S02
source: "Unknown table '%-.192s' in %-.32s"
est: "Tundmatu tabel '%-.192s' %-.32s-s"

# ER_FIELD_SPECIFIED_TWICE 42000
source: "Column '%-.192s' specified twice"
est: "Tulp '%-.192s' on määratletud topelt"

# ER_INVALID_GROUP_FUNC_USE
source: "Invalid use of group function"
est: "Vigane grupeerimisfunktsiooni kasutus"

# ER_UNSUPPORTED_EXTENSION 42000
source: "Table '%-.192s' uses an extension that doesn't exist in this MariaDB version"
est: "Tabel '%-.192s' kasutab laiendust, mis ei eksisteeri antud MariaDB versioonis"

# ER_TABLE_MUST_HAVE_COLUMNS 42000
source: "A table must have at least 1 column"
est: "Tabelis peab olema vähemalt üks tulp"

# ER_RECORD_FILE_FULL
source: "The table '%-.192s' is full"
est: "Tabel '%-.192s' on täis"

# ER_UNKNOWN_CHARACTER_SET 42000
source: "Unknown character set: '%-.64s'"
est: "Vigane kooditabel '%-.64s'"

# ER_TOO_MANY_TABLES
source: "Too many tables; MariaDB can only use %d tables in a join"
est: "Liiga palju tabeleid. MariaDB suudab JOINiga ühendada kuni %d tabelit"

# ER_TOO_MANY_FIELDS
source: "Too many columns"
est: "Liiga palju tulpasid"

# ER_TOO_BIG_ROWSIZE 42000
source: "Row size too large. The maximum row size for the used table type, not counting BLOBs, is %ld. This includes storage overhead, check the manual. You have to change some columns to TEXT or BLOBs"
est: "Liiga pikk kirje. Kirje maksimumpikkus arvestamata BLOB-tüüpi välju on %ld. Muuda mõned väljad BLOB-tüüpi väljadeks"

# ER_WRONG_OUTER_JOIN 42000
source: "Cross dependency found in OUTER JOIN; examine your ON conditions"
est: "Ristsõltuvus OUTER JOIN klauslis. Kontrolli oma ON tingimusi"

# ER_CANT_FIND_UDF
source: "Can't load function '%-.192s'"
est: "Ei suuda avada funktsiooni '%-.192s'"

# ER_CANT_INITIALIZE_UDF
source: "Can't initialize function '%-.192s'; %-.80s"
est: "Ei suuda algväärtustada funktsiooni '%-.192s'; %-.80s"

# ER_UDF_NO_PATHS
source: "No paths allowed for shared library"
est: "Teegi nimes ei tohi olla kataloogi"

# ER_UDF_EXISTS
source: "Function '%-.192s' already exists"
est: "Funktsioon '%-.192s' juba eksisteerib"

# ER_CANT_OPEN_LIBRARY
source: "Can't open shared library '%-.192s' (errno: %d, %-.128s)"
est: "Ei suuda avada jagatud teeki '%-.192s' (veakood: %d, %-.128s)"

# ER_CANT_FIND_DL_ENTRY
source: "Can't find symbol '%-.128s' in library"
est: "Ei leia funktsiooni '%-.128s' antud teegis"

# ER_FUNCTION_NOT_DEFINED
source: "Function '%-.192s' is not defined"
est: "Funktsioon '%-.192s' ei ole defineeritud"

# ER_HOST_IS_BLOCKED
source: "Host '%-.64s' is blocked because of many connection errors; unblock with 'mariadb-admin flush-hosts'"
est: "Masin '%-.64s' on blokeeritud hulgaliste ühendusvigade tõttu. Blokeeringu saab tühistada 'mariadb-admin flush-hosts' käsuga"

# ER_HOST_NOT_PRIVILEGED
source: "Host '%-.64s' is not allowed to connect to this MariaDB server"
est: "Masinal '%-.64s' puudub ligipääs sellele MariaDB serverile"

# ER_PASSWORD_ANONYMOUS_USER 42000
source: "You are using MariaDB as an anonymous user and anonymous users are not allowed to modify user settings"
est: "Te kasutate MariaDB-i anonüümse kasutajana, kelledel pole parooli muutmise õigust"

# ER_PASSWORD_NOT_ALLOWED 42000
source: "You must have privileges to update tables in the mysql database to be able to change passwords for others"
est: "Teiste paroolide muutmiseks on nõutav tabelite muutmisõigus 'mysql' andmebaasis"

# ER_PASSWORD_NO_MATCH 28000
source: "Can't find any matching row in the user table"
est: "Ei leia vastavat kirjet kasutajate tabelis"

# ER_UPDATE_INFO
source: "Rows matched: %ld Changed: %ld Warnings: %ld"
est: "Sobinud kirjeid: %ld Muudetud: %ld Hoiatusi: %ld"

# ER_CANT_CREATE_THREAD
source: "Can't create a new thread (errno %M); if you are not out of available memory, you can consult the manual for a possible OS-dependent bug"
est: "Ei suuda luua uut lõime (veakood %M). Kui mälu ei ole otsas, on tõenäoliselt tegemist operatsioonisüsteemispetsiifilise veaga"

# ER_WRONG_VALUE_COUNT_ON_ROW 21S01
source: "Column count doesn't match value count at row %lu"
est: "Tulpade hulk erineb väärtuste hulgast real %lu"

# ER_CANT_REOPEN_TABLE
source: "Can't reopen table: '%-.192s'"
est: "Ei suuda taasavada tabelit '%-.192s'"

# ER_INVALID_USE_OF_NULL 22004
source: "Invalid use of NULL value"
est: "NULL väärtuse väärkasutus"

# ER_REGEXP_ERROR 42000
source: "Regex error '%s'"
est: "regexp tagastas vea: %s"

# ER_MIX_OF_GROUP_FUNC_AND_FIELDS 42000
source: "Mixing of GROUP columns (MIN(),MAX(),COUNT(),...) with no GROUP columns is illegal if there is no GROUP BY clause"
est: "GROUP tulpade (MIN(),MAX(),COUNT()...) kooskasutamine tavaliste tulpadega ilma GROUP BY klauslita ei ole lubatud"

# ER_NONEXISTING_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s'"
est: "Sellist õigust ei ole defineeritud kasutajale '%-.48s' masinast '%-.64s'"

# ER_TABLEACCESS_DENIED_ERROR 42000
source: "%-.100T command denied to user '%s'@'%s' for table '%-.192s'"
est: "%-.100T käsk ei ole lubatud kasutajale '%s'@'%s' tabelis '%-.192s'"

# ER_COLUMNACCESS_DENIED_ERROR 42000
source: "%-.32s command denied to user '%s'@'%s' for column '%-.192s' in table '%-.192s'"
est: "%-.32s käsk ei ole lubatud kasutajale '%s'@'%s' tulbale '%-.192s' tabelis '%-.192s'"

# ER_ILLEGAL_GRANT_FOR_TABLE 42000
source: "Illegal GRANT/REVOKE command; please consult the manual to see which privileges can be used"
est: "Vigane GRANT/REVOKE käsk. Tutvu kasutajajuhendiga"

# ER_GRANT_WRONG_HOST_OR_USER 42000
source: "The host or user argument to GRANT is too long"
est: "Masina või kasutaja nimi GRANT lauses on liiga pikk"

# ER_NO_SUCH_TABLE 42S02
source: "Table '%-.192s.%-.192s' doesn't exist"
est: "Tabelit '%-.192s.%-.192s' ei eksisteeri"

# ER_NONEXISTING_TABLE_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s' on table '%-.192s'"
est: "Sellist õigust ei ole defineeritud kasutajale '%-.48s' masinast '%-.64s' tabelile '%-.192s'"

# ER_NOT_ALLOWED_COMMAND 42000
source: "The used command is not allowed with this MariaDB version"
est: "Antud käsk ei ole lubatud käesolevas MariaDB versioonis"

# ER_SYNTAX_ERROR 42000
source: "You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use"
est: "Viga SQL süntaksis"

# ER_DELAYED_CANT_CHANGE_LOCK
source: "Delayed insert thread couldn't get requested lock for table %-.192s"
est: "INSERT DELAYED lõim ei suutnud saada soovitud lukku tabelile %-.192s"

# ER_TOO_MANY_DELAYED_THREADS
source: "Too many delayed threads in use"
est: "Liiga palju DELAYED lõimesid kasutusel"

# ER_ABORTING_CONNECTION 08S01
source: "Aborted connection %ld to db: '%-.192s' user: '%-.48s' (%-.64s)"
est: "Ühendus katkestatud %ld andmebaasile: '%-.192s' kasutajale: '%-.48s' (%-.64s)"

# ER_NET_PACKET_TOO_LARGE 08S01
source: "Got a packet bigger than 'max_allowed_packet' bytes"
est: "Saabus suurem pakett kui lubatud 'max_allowed_packet' muutujaga"

# ER_NET_READ_ERROR_FROM_PIPE 08S01
source: "Got a read error from the connection pipe"
est: "Viga ühendustoru lugemisel"

# ER_NET_FCNTL_ERROR 08S01
source: "Got an error from fcntl()"
est: "fcntl() tagastas vea"

# ER_NET_PACKETS_OUT_OF_ORDER 08S01
source: "Got packets out of order"
est: "Paketid saabusid vales järjekorras"

# ER_NET_UNCOMPRESS_ERROR 08S01
source: "Couldn't uncompress communication packet"
est: "Viga andmepaketi lahtipakkimisel"

# ER_NET_READ_ERROR 08S01
source: "Got an error reading communication packets"
est: "Viga andmepaketi lugemisel"

# ER_NET_READ_INTERRUPTED 08S01
source: "Got timeout reading communication packets"
est: "Kontrollaja ületamine andmepakettide lugemisel"

# ER_NET_ERROR_ON_WRITE 08S01
source: "Got an error writing communication packets"
est: "Viga andmepaketi kirjutamisel"

# ER_NET_WRITE_INTERRUPTED 08S01
source: "Got timeout writing communication packets"
est: "Kontrollaja ületamine andmepakettide kirjutamisel"

# ER_TOO_LONG_STRING 42000
source: "Result string is longer than 'max_allowed_packet' bytes"
est: "Tulemus on pikem kui lubatud 'max_allowed_packet' muutujaga"

# ER_TABLE_CANT_HANDLE_BLOB 42000
source: "Storage engine %s doesn't support BLOB/TEXT columns"
est: "Valitud tabelitüüp (%s) ei toeta BLOB/TEXT tüüpi välju"

# ER_TABLE_CANT_HANDLE_AUTO_INCREMENT 42000
source: "Storage engine %s doesn't support AUTO_INCREMENT columns"
est: "Valitud tabelitüüp (%s) ei toeta AUTO_INCREMENT tüüpi välju"

# ER_DELAYED_INSERT_TABLE_LOCKED
source: "INSERT DELAYED can't be used with table '%-.192s' because it is locked with LOCK TABLES"
est: "INSERT DELAYED ei saa kasutada tabeli '%-.192s' peal, kuna see on lukustatud LOCK TABLES käsuga"

# ER_WRONG_COLUMN_NAME 42000
source: "Incorrect column name '%-.100s'"
est: "Vigane tulba nimi '%-.100s'"

# ER_WRONG_MRG_TABLE
source: "Unable to open underlying table which is differently defined or of non-MyISAM type or doesn't exist"
est: "Kõik tabelid MERGE tabeli määratluses ei ole identsed"

# ER_DUP_UNIQUE 23000
source: "Can't write, because of unique constraint, to table '%-.192s'"
est: "Ei suuda kirjutada tabelisse '%-.192s', kuna see rikub ühesuse kitsendust"

# ER_BLOB_KEY_WITHOUT_LENGTH 42000
source: "BLOB/TEXT column '%-.192s' used in key specification without a key length"
est: "BLOB-tüüpi tulp '%-.192s' on kasutusel võtmes ilma pikkust määratlemata"

# ER_PRIMARY_CANT_HAVE_NULL 42000
source: "All parts of a PRIMARY KEY must be NOT NULL; if you need NULL in a key, use UNIQUE instead"
est: "Kõik PRIMARY KEY peavad olema määratletud NOT NULL piiranguga; vajadusel kasuta UNIQUE tüüpi võtit"

# ER_TOO_MANY_ROWS 42000
source: "Result consisted of more than one row"
est: "Tulemis oli rohkem kui üks kirje"

# ER_REQUIRES_PRIMARY_KEY 42000
source: "This table type requires a primary key"
est: "Antud tabelitüüp nõuab primaarset võtit"

# ER_NO_RAID_COMPILED
source: "This version of MariaDB is not compiled with RAID support"
est: "Antud MariaDB versioon on kompileeritud ilma RAID toeta"

# ER_UPDATE_WITHOUT_KEY_IN_SAFE_MODE
source: "You are using safe update mode and you tried to update a table without a WHERE that uses a KEY column"
est: "Katse muuta tabelit turvalises rezhiimis ilma WHERE klauslita"
