Repository: vladbogo/test-translation
Catalog: est.xlf
Languages: est

# ER_KEY_DOES_NOT_EXISTS 42000 S1009
source: "Key '%-.192s' doesn't exist in table '%-.192s'"
est: "Võti '%-.192s' ei eksisteeri tabelis '%-.192s'"

# ER_CHECK_NO_SUCH_TABLE 42000
source: "Can't open table"
est: "Ei suuda avada tabelit"

# ER_CHECK_NOT_IMPLEMENTED 42000
source: "The storage engine for the table doesn't support %s"
est: "Antud tabelitüüp ei toeta %s käske"

# ER_CANT_DO_THIS_DURING_AN_TRANSACTION 25000
source: "You are not allowed to execute this command in a transaction"
est: "Seda käsku ei saa kasutada transaktsiooni sees"

# ER_ERROR_DURING_COMMIT
source: "Got error %M during COMMIT"
est: "Viga %M käsu COMMIT täitmisel"

# ER_ERROR_DURING_ROLLBACK
source: "Got error %M during ROLLBACK"
est: "Viga %M käsu ROLLBACK täitmisel"

# ER_ERROR_DURING_FLUSH_LOGS
source: "Got error %M during FLUSH_LOGS"
est: "Viga %M käsu FLUSH_LOGS täitmisel"

# ER_ERROR_DURING_CHECKPOINT
source: "Got error %M during CHECKPOINT"
est: "Viga %M käsu CHECKPOINT täitmisel"

# ER_NEW_ABORTING_CONNECTION 08S01
source: "Aborted connection %lld to db: '%-.192s' user: '%-.48s' host: '%-.64s' (%-.64s)"
est: "Ühendus katkestatud %lld andmebaas: '%-.192s' kasutaja: '%-.48s' masin: '%-.64s' (%-.64s)"

# ER_FT_MATCHING_KEY_NOT_FOUND
source: "Can't find FULLTEXT index matching the column list"
est: "Ei suutnud leida FULLTEXT indeksit, mis kattuks kasutatud tulpadega"

# ER_LOCK_OR_ACTIVE_TRANSACTION
source: "Can't execute the given command because you have active locked tables or an active transaction"
est: "Ei suuda täita antud käsku kuna on aktiivseid lukke või käimasolev transaktsioon"

# ER_UNKNOWN_SYSTEM_VARIABLE
source: "Unknown system variable '%-.*s'"
est: "Tundmatu süsteemne muutuja '%-.*s'"

# ER_CRASHED_ON_USAGE
source: "Table '%-.192s' is marked as crashed and should be repaired"
est: "Tabel '%-.192s' on märgitud vigaseks ja tuleb parandada"

# ER_CRASHED_ON_REPAIR
source: "Table '%-.192s' is marked as crashed and last (automatic?) repair failed"
est: "Tabel '%-.192s' on märgitud vigaseks ja viimane (automaatne?) parandus ebaõnnestus"

# ER_WARNING_NOT_COMPLETE_ROLLBACK
source: "Some non-transactional changed tables couldn't be rolled back"
est: "Hoiatus: mõnesid transaktsioone mittetoetavaid tabeleid ei suudetud tagasi kerida"

# ER_TRANS_CACHE_FULL
source: "Multi-statement transaction required more than 'max_binlog_cache_size' bytes of storage; increase this mariadbd variable and try again"
est: "Mitme lausendiga transaktsioon nõudis rohkem ruumi kui lubatud 'max_binlog_cache_size' muutujaga. Suurenda muutuja väärtust ja proovi uuesti"

# ER_TOO_MANY_USER_CONNECTIONS 42000
source: "User %-.64s already has more than 'max_user_connections' active connections"
est: "Kasutajal %-.64s on juba rohkem ühendusi kui lubatud 'max_user_connections' muutujaga"

# ER_SET_CONSTANTS_ONLY
source: "You may only use constant expressions in this statement"
est: "Ainult konstantsed suurused on lubatud SET klauslis"

# ER_LOCK_WAIT_TIMEOUT
source: "Lock wait timeout exceeded; try restarting transaction"
est: "Kontrollaeg ületatud luku järel ootamisel; Proovi transaktsiooni otsast alata"

# ER_LOCK_TABLE_FULL
source: "The total number of locks exceeds the lock table size"
est: "Lukkude koguarv ületab lukutabeli suuruse"

# ER_READ_ONLY_TRANSACTION 25000
source: "Update locks cannot be acquired during a READ UNCOMMITTED transaction"
est: "Uuenduslukke ei saa kasutada READ UNCOMMITTED transaktsiooni käigus"

# ER_DROP_DB_WITH_READ_LOCK
source: "DROP DATABASE not allowed while thread is holding global read lock"
est: "DROP DATABASE ei ole lubatud kui lõim omab globaalset READ lukku"

# ER_CREATE_DB_WITH_READ_LOCK
source: "CREATE DATABASE not allowed while thread is holding global read lock"
est: "CREATE DATABASE ei ole lubatud kui lõim omab globaalset READ lukku"

# ER_WRONG_ARGUMENTS
source: "Incorrect arguments to %s"
est: "Vigased parameetrid %s-le"

# ER_NO_PERMISSION_TO_CREATE_USER 42000
source: "'%s'@'%s' is not allowed to create new users"
est: "Kasutajal '%s'@'%s' ei ole lubatud luua uusi kasutajaid"

# ER_UNION_TABLES_IN_DIFFERENT_DIR
source: "Incorrect table definition; all MERGE tables must be in the same database"
est: "Vigane tabelimääratlus; kõik MERGE tabeli liikmed peavad asuma samas andmebaasis"

# ER_LOCK_DEADLOCK 40001
source: "Deadlock found when trying to get lock; try restarting transaction"
est: "Lukustamisel tekkis tupik (deadlock); alusta transaktsiooni otsast"

# ER_TABLE_CANT_HANDLE_FT
source: "The storage engine %s doesn't support FULLTEXT indexes"
est: "Antud tabelitüüp (%s) ei toeta FULLTEXT indekseid"

# ER_ERROR_WHEN_EXECUTING_COMMAND
source: "Error when executing command %s: %-.128s"
est: "Viga käsu %s täitmisel: %-.128s"

# ER_WRONG_USAGE
source: "Incorrect usage of %s and %s"
est: "Vigane %s ja %s kasutus"

# ER_WRONG_NUMBER_OF_COLUMNS_IN_SELECT 21000
source: "The used SELECT statements have a different number of columns"
est: "Tulpade arv kasutatud SELECT lausetes ei kattu"

# ER_CANT_UPDATE_WITH_READLOCK
source: "Can't execute the query because you have a conflicting read lock"
est: "Ei suuda täita päringut konfliktse luku tõttu"

# ER_MIXING_NOT_ALLOWED
source: "Mixing of transactional and non-transactional tables is disabled"
est: "Transaktsioone toetavate ning mittetoetavate tabelite kooskasutamine ei ole lubatud"

# ER_DUP_ARGUMENT
source: "Option '%s' used twice in statement"
est: "Määrangut '%s' on lauses kasutatud topelt"

# ER_DUP_ENTRY_WITH_KEY_NAME 23000 S1009
source: "Duplicate entry '%-.64T' for key '%-.192s'"
est: "Kattuv väärtus '%-.64T' võtmele '%-.192s'"

# ER_ACCESS_DENIED_NO_PASSWORD_ERROR 28000
source: "Access denied for user '%s'@'%s'"
est: "Ligipääs keelatud kasutajale '%s'@'%s'"

# ER_DUP_UNKNOWN_IN_INDEX 23000
source: "Duplicate entry for key '%-.192s'"
est: "Kattuv väärtus võtmele '%-.192s'"
