Repository: vladbogo/test-translation
Catalog: fre.xlf
Languages: fre

# ER_NO
source: "NO"
fre: "NON"

# ER_YES
source: "YES"
fre: "OUI"

# ER_CANT_CREATE_FILE
source: "Can't create file '%-.200s' (errno: %M)"
fre: "Ne peut créer le fichier '%-.200s' (Errcode : %M)"

# ER_CANT_CREATE_TABLE
source: "Can't create table %`s.%`s (errno: %M)"
fre: "Ne peut créer la table %`s.%`s (Errcode : %M)"

# ER_CANT_CREATE_DB
source: "Can't create database '%-.192s' (errno: %M)"
fre: "Ne peut créer la base '%-.192s' (Erreur %M)"

# ER_DB_CREATE_EXISTS
source: "Can't create database '%-.192s'; database exists"
fre: "Ne peut créer la base '%-.192s' ; elle existe déjà"

# ER_DB_DROP_EXISTS
source: "Can't drop database '%-.192s'; database doesn't exist"
fre: "Ne peut effacer la base '%-.192s' ; elle n'existe pas"

# ER_DB_DROP_DELETE
source: "Error dropping database (can't delete '%-.192s', errno: %M)"
fre: "Ne peut effacer la base '%-.192s' (erreur %M)"

# ER_DB_DROP_RMDIR
source: "Error dropping database (can't rmdir '%-.192s', errno: %M)"
fre: "Erreur en effaçant la base (rmdir '%-.192s', erreur %M)"

# ER_CANT_DELETE_FILE
source: "Error on delete of '%-.192s' (errno: %M)"
fre: "Erreur en effaçant '%-.192s' (Errcode : %M)"

# ER_CANT_FIND_SYSTEM_REC
source: "Can't read record in system table"
fre: "Ne peut lire un enregistrement de la table 'system'"

# ER_CANT_GET_STAT
source: "Can't get status of '%-.200s' (errno: %M)"
fre: "Ne peut obtenir le status de '%-.200s' (Errcode : %M)"

# ER_CANT_GET_WD
source: "Can't get working directory (errno: %M)"
fre: "Ne peut obtenir le répertoire de travail (Errcode : %M)"

# ER_CANT_LOCK
source: "Can't lock file (errno: %M)"
fre: "Ne peut verrouiller le fichier (Errcode : %M)"

# ER_CANT_OPEN_FILE
source: "Can't open file: '%-.200s' (errno: %M)"
fre: "Ne peut ouvrir le fichier : '%-.200s' (Errcode : %M)"

# ER_FILE_NOT_FOUND
source: "Can't find file: '%-.200s' (errno: %M)"
fre: "Ne peut trouver le fichier : '%-.200s' (Errcode : %M)"

# ER_CANT_READ_DIR
source: "Can't read dir of '%-.192s' (errno: %M)"
fre: "Ne peut lire le répertoire de '%-.192s' (Errcode : %M)"

# ER_CANT_SET_WD
source: "Can't change dir to '%-.192s' (errno: %M)"
fre: "Ne peut changer le répertoire pour '%-.192s' (Errcode : %M)"

# ER_CHECKREAD
source: "Record has changed since last read in table '%-.192s'"
fre: "Enregistrement modifié depuis sa dernière lecture dans la table '%-.192s'"

# ER_DISK_FULL
source: "Disk full (%s); waiting for someone to free some space... (errno: %M)"
fre: "Disque plein (%s). J'attend que quelqu'un libère de l'espace... (Errcode : %M)"

# ER_DUP_KEY 23000
source: "Can't write; duplicate key in table '%-.192s'"
fre: "Écriture impossible, doublon dans une clé de la table '%-.192s'"

# ER_ERROR_ON_CLOSE
source: "Error on close of '%-.192s' (errno: %M)"
fre: "Erreur a la fermeture de '%-.192s' (Errcode : %M)"

# ER_ERROR_ON_READ
source: "Error reading file '%-.200s' (errno: %M)"
fre: "Erreur en lecture du fichier '%-.200s' (Errcode : %M)"

# ER_ERROR_ON_RENAME
source: "Error on rename of '%-.210s' to '%-.210s' (errno: %M)"
fre: "Erreur en renommant '%-.210s' en '%-.210s' (Errcode : %M)"

# ER_ERROR_ON_WRITE
source: "Error writing file '%-.200s' (errno: %M)"
fre: "Erreur d'écriture du fichier '%-.200s' (Errcode : %M)"

# ER_FILE_USED
source: "'%-.192s' is locked against change"
fre: "'%-.192s' est verrouillé contre les modifications"

# ER_FILSORT_ABORT
source: "Sort aborted"
fre: "Tri alphabétique abandonné"

# ER_FORM_NOT_FOUND
source: "View '%-.192s' doesn't exist for '%-.192s'"
fre: "La vue (View) '%-.192s' n'existe pas pour '%-.192s'"

# ER_GET_ERRNO
source: "Got error %M from storage engine %s"
fre: "Reçu l'erreur %M du handler de la table %s"

# ER_KEY_NOT_FOUND
source: "Can't find record in '%-.192s'"
fre: "Ne peut trouver l'enregistrement dans '%-.192s'"

# ER_NOT_FORM_FILE
source: "Incorrect information in file: '%-.200s'"
fre: "Information erronnée dans le fichier: '%-.200s'"

# ER_NOT_KEYFILE
source: "Index for table '%-.200s' is corrupt; try to repair it"
fre: "Index corrompu dans la table: '%-.200s'; essayez de le réparer"

# ER_OLD_KEYFILE
source: "Old key file for table '%-.192s'; repair it!"
fre: "Vieux fichier d'index pour la table '%-.192s'; réparez le!"

# ER_OPEN_AS_READONLY
source: "Table '%-.192s' is read only"
fre: "'%-.192s' est en lecture seulement"

# ER_OUTOFMEMORY HY001 S1001
source: "Out of memory; restart server and try again (needed %d bytes)"
fre: "Manque de mémoire. Redémarrez le démon et ré-essayez (%d octets nécessaires)"

# ER_OUT_OF_SORTMEMORY HY001 S1001
source: "Out of sort memory, consider increasing server sort buffer size"
fre: "Manque de mémoire pour le tri. Augmentez-la"

# ER_UNEXPECTED_EOF
source: "Unexpected EOF found when reading file '%-.192s' (errno: %M)"
fre: "Fin de fichier inattendue en lisant '%-.192s' (Errcode: %M)"

# ER_CON_COUNT_ERROR 08004
source: "Too many connections"
fre: "Trop de connexions"

# ER_OUT_OF_RESOURCES
source: "Out of memory."
fre: "Manque de 'threads'/mémoire"

# ER_BAD_HOST_ERROR 08S01
source: "Can't get hostname for your address"
fre: "Ne peut obtenir de hostname pour votre adresse"

# ER_HANDSHAKE_ERROR 08S01
source: "Bad handshake"
fre: "Mauvais 'handshake'"

# ER_DBACCESS_DENIED_ERROR 42000
source: "Access denied for user '%s'@'%s' to database '%-.192s'"
fre: "Accès refusé pour l'utilisateur: '%s'@'%s'. Base '%-.192s'"

# ER_ACCESS_DENIED_ERROR 28000
source: "Access denied for user '%s'@'%s' (using password: %s)"
fre: "Accès refusé pour l'utilisateur: '%s'@'%s' (mot de passe: %s)"

# ER_NO_DB_ERROR 3D000
source: "No database selected"
fre: "Aucune base n'a été sélectionnée"

# ER_UNKNOWN_COM_ERROR 08S01
source: "Unknown command"
fre: "Commande inconnue"

# ER_BAD_NULL_ERROR 23000
source: "Column '%-.192s' cannot be null"
fre: "Le champ '%-.192s' ne peut être vide (null)"

# ER_BAD_DB_ERROR 42000
source: "Unknown database '%-.192s'"
fre: "Base '%-.192s' inconnue"

# ER_TABLE_EXISTS_ERROR 42S01
source: "Table '%-.192s' already exists"
fre: "La table '%-.192s' existe déjà"

# ER_BAD_TABLE_ERROR 42S02
source: "Unknown table '%-.100T'"
fre: "Table '%-.100T' inconnue"

# ER_NON_UNIQ_ERROR 23000
source: "Column '%-.192s' in %-.192s is ambiguous"
fre: "Champ: '%-.192s' dans %-.192s est ambigu"

# ER_SERVER_SHUTDOWN 08S01
source: "Server shutdown in progress"
fre: "Arrêt du serveur en cours"

# ER_BAD_FIELD_ERROR 42S22 S0022
source: "Unknown column '%-.192s' in '%-.192s'"
fre: "Champ '%-.192s' inconnu dans %-.192s"

# ER_WRONG_FIELD_WITH_GROUP 42000 S1009
source: "'%-.192s' isn't in GROUP BY"
fre: "'%-.192s' n'est pas dans 'group by'"

# ER_WRONG_GROUP_FIELD 42000 S1009
source: "Can't group on '%-.192s'"
fre: "Ne peut regrouper '%-.192s'"

# ER_WRONG_SUM_SELECT 42000 S1009
source: "Statement has sum functions and columns in same statement"
fre: "Vous demandez la fonction sum() et des champs dans la même commande"

# ER_TOO_LONG_IDENT 42000 S1009
source: "Identifier name '%-.100T' is too long"
fre: "Le nom de l'identificateur '%-.100T' est trop long"

# ER_DUP_FIELDNAME 42S21 S1009
source: "Duplicate column name '%-.192s'"
fre: "Nom du champ '%-.192s' déjà utilisé"

# ER_DUP_KEYNAME 42000 S1009
source: "Duplicate key name '%-.192s'"
fre: "Nom de clef '%-.192s' déjà utilisé"

# ER_DUP_ENTRY 23000 S1009
source: "Duplicate entry '%-.192T' for key %d"
fre: "Duplicata du champ '%-.192T' pour la clef %d"

# ER_WRONG_FIELD_SPEC 42000 S1009
source: "Incorrect column specifier for column '%-.192s'"
fre: "Mauvais paramètre de champ pour le champ '%-.192s'"

# ER_PARSE_ERROR 42000 s1009
source: "%s near '%-.80T' at line %d"
fre: "%s près de '%-.80T' à la ligne %d"

# ER_EMPTY_QUERY 42000
source: "Query was empty"
fre: "Query est vide"

# ER_NONUNIQ_TABLE 42000 S1009
source: "Not unique table/alias: '%-.192s'"
fre: "Table/alias: '%-.192s' non unique"

# ER_INVALID_DEFAULT 42000 S1009
source: "Invalid default value for '%-.192s'"
fre: "Valeur par défaut invalide pour '%-.192s'"

# ER_MULTIPLE_PRI_KEY 42000 S1009
source: "Multiple primary key defined"
fre: "Plusieurs clefs primaires définies"

# ER_TOO_MANY_KEYS 42000 S1009
source: "Too many keys specified; max %d keys allowed"
fre: "Trop de clefs sont définies. Maximum de %d clefs alloué"

# ER_TOO_MANY_KEY_PARTS 42000 S1009
source: "Too many key parts specified; max %d parts allowed"
fre: "Trop de parties specifiées dans la clef. Maximum de %d parties"

# ER_TOO_LONG_KEY 42000 S1009
source: "Specified key was too long; max key length is %d bytes"
fre: "La clé est trop longue. Longueur maximale: %d"

# ER_KEY_COLUMN_DOES_NOT_EXIST 42000 S1009
source: "Key column '%-.192s' doesn't exist in table"
fre: "La clé '%-.192s' n'existe pas dans la table"

# ER_TOO_BIG_FIELDLENGTH 42000 S1009
source: "Column length too big for column '%-.192s' (max = %lu); use BLOB or TEXT instead"
fre: "Champ '%-.192s' trop long (max = %lu). Utilisez un BLOB"

# ER_WRONG_AUTO_KEY 42000 S1009
source: "Incorrect table definition; there can be only one auto column and it must be defined as a key"
fre: "Un seul champ automatique est permis et il doit être indexé"

# ER_NORMAL_SHUTDOWN
source: "%s (initiated by: %s): Normal shutdown"
fre: "%s (%s): Arrêt normal du serveur"

# ER_GOT_SIGNAL
source: "%s: Got signal %d. Aborting!\n"
fre: "%s: Reçu le signal %d. Abandonne!\n"

# ER_SHUTDOWN_COMPLETE
source: "%s: Shutdown complete\n"
fre: "%s: Arrêt du serveur terminé\n"

# ER_FORCING_CLOSE 08S01
source: "%s: Forcing close of thread %ld user: '%-.48s'\n"
fre: "%s: Arrêt forcé de la tâche (thread) %ld utilisateur: '%-.48s'\n"

# ER_IPSOCK_ERROR 08S01
source: "Can't create IP socket"
fre: "Ne peut créer la connexion IP (socket)"

# ER_NO_SUCH_INDEX 42S12 S1009
source: "Table '%-.192s' has no index like the one used in CREATE INDEX; recreate the table"
fre: "La table '%-.192s' n'a pas d'index comme celle utilisée dans CREATE INDEX. Recréez la table"

# ER_WRONG_FIELD_TERMINATORS 42000 S1009
source: "Field separator argument is not what is expected; check the manual"
fre: "Séparateur de champs inconnu. Vérifiez dans le manuel"

# ER_BLOBS_AND_NO_TERMINATED 42000 S1009
source: "You can't use fixed rowlength with BLOBs; please use 'fields terminated by'"
fre: "Vous ne pouvez utiliser des lignes de longueur fixe avec des BLOBs. Utiliser 'fields terminated by'"

# ER_TEXTFILE_NOT_READABLE
source: "The file '%-.128s' must be in the database directory or be readable by all"
fre: "Le fichier '%-.128s' doit être dans le répertoire de la base et lisible par tous"

# ER_FILE_EXISTS_ERROR
source: "File '%-.200s' already exists"
fre: "Le fichier '%-.200s' existe déjà"

# ER_LOAD_INFO
source: "Records: %ld Deleted: %ld Skipped: %ld Warnings: %ld"
fre: "Enregistrements: %ld Effacés: %ld Non traités: %ld Avertissements: %ld"

# ER_ALTER_INFO
source: "Records: %ld Duplicates: %ld"
fre: "Enregistrements: %ld Doublons: %ld"

# ER_WRONG_SUB_KEY
source: "Incorrect prefix key; the used key part isn't a string, the used length is longer than the key part, or the storage engine doesn't support unique prefix keys"
fre: "Mauvaise sous-clef. Ce n'est pas un 'string' ou la longueur dépasse celle définie dans la clef"

# ER_CANT_REMOVE_ALL_FIELDS 42000
source: "You can't delete all columns with ALTER TABLE; use DROP TABLE instead"
fre: "Vous ne pouvez effacer tous les champs avec ALTER TABLE. Utilisez DROP TABLE"

# ER_CANT_DROP_FIELD_OR_KEY 42000
source: "Can't DROP %s %`-.192s; check that it exists"
fre: "Ne peut effacer (DROP %s) %`-.192s. Vérifiez s'il existe"

# ER_INSERT_INFO
source: "Records: %ld Duplicates: %ld Warnings: %ld"
fre: "Enregistrements: %ld Doublons: %ld Avertissements: %ld"

# ER_NO_SUCH_THREAD
source: "Unknown thread id: %lu"
fre: "Numéro de tâche inconnu: %lu"

# ER_KILL_DENIED_ERROR
source: "You are not owner of thread %lld"
fre: "Vous n'êtes pas propriétaire de la tâche no: %lld"

# ER_NO_TABLES_USED
source: "No tables used"
fre: "Aucune table utilisée"

# ER_TOO_BIG_SET
source: "Too many strings for column %-.192s and SET"
fre: "Trop de chaînes dans la colonne %-.192s avec SET"

# ER_NO_UNIQUE_LOGFILE
source: "Can't generate a unique log-filename %-.200s.(1-999)\n"
fre: "Ne peut générer un unique nom de journal %-.200s.(1-999)\n"

# ER_TABLE_NOT_LOCKED_FOR_WRITE
source: "Table '%-.192s' was locked with a READ lock and can't be updated"
fre: "Table '%-.192s' verrouillée lecture (READ): modification impossible"

# ER_TABLE_NOT_LOCKED
source: "Table '%-.192s' was not locked with LOCK TABLES"
fre: "Table '%-.192s' non verrouillée: utilisez LOCK TABLES"

# ER_WRONG_DB_NAME 42000
source: "Incorrect database name '%-.100T'"
fre: "Nom de base de donnée illégal: '%-.100T'"

# ER_WRONG_TABLE_NAME 42000
source: "Incorrect table name '%-.100s'"
fre: "Nom de table illégal: '%-.100s'"

# ER_TOO_BIG_SELECT 42000
source: "The SELECT would examine more than MAX_JOIN_SIZE rows; check your WHERE and use SET SQL_BIG_SELECTS=1 or SET MAX_JOIN_SIZE=# if the SELECT is okay"
fre: "SELECT va devoir examiner beaucoup d'enregistrements ce qui va prendre du temps. Vérifiez la clause WHERE et utilisez SET SQL_BIG_SELECTS=1 si SELECT se passe bien"

# ER_UNKNOWN_ERROR
source: "Unknown error"
fre: "Erreur inconnue"

# ER_UNKNOWN_PROCEDURE 42000
source: "Unknown procedure '%-.192s'"
fre: "Procédure %-.192s inconnue"

# ER_WRONG_PARAMCOUNT_TO_PROCEDURE 42000
source: "Incorrect parameter count to procedure '%-.192s'"
fre: "Mauvais nombre de paramètres pour la procedure %-.192s"

# ER_WRONG_PARAMETERS_TO_PROCEDURE
source: "Incorrect parameters to procedure '%-.192s'"
fre: "Paramètre erroné pour la procedure %-.192s"

# ER_UNKNOWN_TABLE 42S02
source: "Unknown table '%-.192s' in %-.32s"
fre: "Table inconnue '%-.192s' dans %-.32s"

# ER_FIELD_SPECIFIED_TWICE 42000
source: "Column '%-.192s' specified twice"
fre: "Champ '%-.192s' spécifié deux fois"

# ER_INVALID_GROUP_FUNC_USE
source: "Invalid use of group function"
fre: "Utilisation invalide de la clause GROUP"

# ER_UNSUPPORTED_EXTENSION 42000
source: "Table '%-.192s' uses an extension that doesn't exist in this MariaDB version"
fre: "Table '%-.192s' : utilise une extension invalide pour cette version de MariaDB"

# ER_TABLE_MUST_HAVE_COLUMNS 42000
source: "A table must have at least 1 column"
fre: "Une table doit comporter au moins une colonne"

# ER_RECORD_FILE_FULL
source: "The table '%-.192s' is full"
fre: "La table '%-.192s' est pleine"

# ER_UNKNOWN_CHARACTER_SET 42000
source: "Unknown character set: '%-.64s'"
fre: "Jeu de caractères inconnu: '%-.64s'"

# ER_TOO_MANY_TABLES
source: "Too many tables; MariaDB can only use %d tables in a join"
fre: "Trop de tables. MariaDB ne peut utiliser que %d tables dans un JOIN"

# ER_TOO_MANY_FIELDS
source: "Too many columns"
fre: "Trop de champs"

# ER_TOO_BIG_ROWSIZE 42000
source: "Row size too large. The maximum row size for the used table type, not counting BLOBs, is %ld. This includes storage overhead, check the manual. You have to change some columns to TEXT or BLOBs"
fre: "Ligne trop grande. Le taille maximale d'une ligne, sauf les BLOBs, est %ld. Changez le type de quelques colonnes en BLOB"

# ER_STACK_OVERRUN
source: "Thread stack overrun: Used: %ld of a %ld stack. Use 'mariadbd --thread_stack=#' to specify a bigger stack if needed"
fre: "Débordement de la pile des tâches (Thread stack). Utilisées: %ld pour une pile de %ld. Essayez 'mariadbd --thread_stack=#' pour indiquer une plus grande valeur"

# ER_WRONG_OUTER_JOIN 42000
source: "Cross dependency found in OUTER JOIN; examine your ON conditions"
fre: "Dépendance croisée dans une clause OUTER JOIN. Vérifiez la condition ON"

# ER_CANT_FIND_UDF
source: "Can't load function '%-.192s'"
fre: "Imposible de charger la fonction '%-.192s'"

# ER_CANT_INITIALIZE_UDF
source: "Can't initialize function '%-.192s'; %-.80s"
fre: "Impossible d'initialiser la fonction '%-.192s'; %-.80s"

# ER_UDF_NO_PATHS
source: "No paths allowed for shared library"
fre: "Chemin interdit pour les bibliothèques partagées"

# ER_UDF_EXISTS
source: "Function '%-.192s' already exists"
fre: "La fonction '%-.192s' existe déjà"

# ER_CANT_OPEN_LIBRARY
source: "Can't open shared library '%-.192s' (errno: %d, %-.128s)"
fre: "Impossible d'ouvrir la bibliothèque partagée '%-.192s' (errno: %d, %-.128s)"

# ER_CANT_FIND_DL_ENTRY
source: "Can't find symbol '%-.128s' in library"
fre: "Impossible de trouver la fonction '%-.128s' dans la bibliothèque"

# ER_FUNCTION_NOT_DEFINED
source: "Function '%-.192s' is not defined"
fre: "La fonction '%-.192s' n'est pas définie"

# ER_HOST_IS_BLOCKED
source: "Host '%-.64s' is blocked because of many connection errors; unblock with 'mariadb-admin flush-hosts'"
fre: "L'hôte '%-.64s' est bloqué à cause d'un trop grand nombre d'erreur de connexion. Débloquer le par 'mariadb-admin flush-hosts'"

# ER_HOST_NOT_PRIVILEGED
source: "Host '%-.64s' is not allowed to connect to this MariaDB server"
fre: "Le hôte '%-.64s' n'est pas authorisé à se connecter à ce serveur MariaDB"

# ER_PASSWORD_ANONYMOUS_USER 42000
source: "You are using MariaDB as an anonymous user and anonymous users are not allowed to modify user settings"
fre: "Vous utilisez un utilisateur anonyme et les utilisateurs anonymes ne sont pas autorisés à changer les mots de passe"

# ER_PASSWORD_NOT_ALLOWED 42000
source: "You must have privileges to update tables in the mysql database to be able to change passwords for others"
fre: "Vous devez avoir le privilège update sur les tables de la base de donnée mysql pour pouvoir changer les mots de passe des autres"

# ER_PASSWORD_NO_MATCH 28000
source: "Can't find any matching row in the user table"
fre: "Impossible de trouver un enregistrement correspondant dans la table user"

# ER_UPDATE_INFO
source: "Rows matched: %ld Changed: %ld Warnings: %ld"
fre: "Enregistrements correspondants: %ld Modifiés: %ld Warnings: %ld"

# ER_CANT_CREATE_THREAD
source: "Can't create a new thread (errno %M); if you are not out of available memory, you can consult the manual for a possible OS-dependent bug"
fre: "Impossible de créer une nouvelle tâche (errno %M). S'il reste de la mémoire libre, consultez le manual pour trouver un éventuel bug dépendant de l'OS"

# ER_CANT_REOPEN_TABLE
source: "Can't reopen table: '%-.192s'"
fre: "Impossible de réouvrir la table: '%-.192s"

# ER_INVALID_USE_OF_NULL 22004
source: "Invalid use of NULL value"
fre: "Utilisation incorrecte de la valeur NULL"

# ER_REGEXP_ERROR 42000
source: "Regex error '%s'"
fre: "Erreur '%s' provenant de regexp"

# ER_MIX_OF_GROUP_FUNC_AND_FIELDS 42000
source: "Mixing of GROUP columns (MIN(),MAX(),COUNT(),...) with no GROUP columns is illegal if there is no GROUP BY clause"
fre: "Mélanger les colonnes GROUP (MIN(),MAX(),COUNT()...) avec des colonnes normales est interdit s'il n'y a pas de clause GROUP BY"

# ER_NONEXISTING_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s'"
fre: "Un tel droit n'est pas défini pour l'utilisateur '%-.48s' sur l'hôte '%-.64s'"

# ER_TABLEACCESS_DENIED_ERROR 42000
source: "%-.100T command denied to user '%s'@'%s' for table '%-.192s'"
fre: "La commande '%-.100T' est interdite à l'utilisateur: '%s'@'%s' sur la table '%-.192s'"

# ER_COLUMNACCESS_DENIED_ERROR 42000
source: "%-.32s command denied to user '%s'@'%s' for column '%-.192s' in table '%-.192s'"
fre: "La commande '%-.32s' est interdite à l'utilisateur: '%s'@'%s' sur la colonne '%-.192s' de la table '%-.192s'"

# ER_ILLEGAL_GRANT_FOR_TABLE 42000
source: "Illegal GRANT/REVOKE command; please consult the manual to see which privileges can be used"
fre: "Commande GRANT/REVOKE incorrecte. Consultez le manuel"

# ER_GRANT_WRONG_HOST_OR_USER 42000
source: "The host or user argument to GRANT is too long"
fre: "L'hôte ou l'utilisateur donné en argument à GRANT est trop long"

# ER_NO_SUCH_TABLE 42S02
source: "Table '%-.192s.%-.192s' doesn't exist"
fre: "La table '%-.192s.%-.192s' n'existe pas"

# ER_NONEXISTING_TABLE_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s' on table '%-.192s'"
fre: "Un tel droit n'est pas défini pour l'utilisateur '%-.48s' sur l'hôte '%-.64s' sur la table '%-.192s'"

# ER_NOT_ALLOWED_COMMAND 42000
source: "The used command is not allowed with this MariaDB version"
fre: "Cette commande n'existe pas dans cette version de MariaDB"

# ER_SYNTAX_ERROR 42000
source: "You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use"
fre: "Erreur de syntaxe"

# ER_DELAYED_CANT_CHANGE_LOCK
source: "Delayed insert thread couldn't get requested lock for table %-.192s"
fre: "La tâche 'delayed insert' n'a pas pu obtenir le verrou démandé sur la table %-.192s"

# ER_TOO_MANY_DELAYED_THREADS
source: "Too many delayed threads in use"
fre: "Trop de tâche 'delayed' en cours"

# ER_ABORTING_CONNECTION 08S01
source: "Aborted connection %ld to db: '%-.192s' user: '%-.48s' (%-.64s)"
fre: "Connection %ld avortée vers la bd: '%-.192s' utilisateur: '%-.48s' (%-.64s)"

# ER_NET_PACKET_TOO_LARGE 08S01
source: "Got a packet bigger than 'max_allowed_packet' bytes"
fre: "Paquet plus grand que 'max_allowed_packet' reçu"

# ER_NET_READ_ERROR_FROM_PIPE 08S01
source: "Got a read error from the connection pipe"
fre: "Erreur de lecture reçue du pipe de connexion"

# ER_NET_FCNTL_ERROR 08S01
source: "Got an error from fcntl()"
fre: "Erreur reçue de fcntl() "

# ER_NET_PACKETS_OUT_OF_ORDER 08S01
source: "Got packets out of order"
fre: "Paquets reçus dans le désordre"

# ER_NET_UNCOMPRESS_ERROR 08S01
source: "Couldn't uncompress communication packet"
fre: "Impossible de décompresser le paquet reçu"

# ER_NET_READ_ERROR 08S01
source: "Got an error reading communication packets"
fre: "Erreur de lecture des paquets reçus"

# ER_NET_READ_INTERRUPTED 08S01
source: "Got timeout reading communication packets"
fre: "Timeout en lecture des paquets reçus"

# ER_NET_ERROR_ON_WRITE 08S01
source: "Got an error writing communication packets"
fre: "Erreur d'écriture des paquets envoyés"

# ER_NET_WRITE_INTERRUPTED 08S01
source: "Got timeout writing communication packets"
fre: "Timeout d'écriture des paquets envoyés"

# ER_TOO_LONG_STRING 42000
source: "Result string is longer than 'max_allowed_packet' bytes"
fre: "La chaîne résultat est plus grande que 'max_allowed_packet'"

# ER_TABLE_CANT_HANDLE_BLOB 42000
source: "Storage engine %s doesn't support BLOB/TEXT columns"
fre: "Ce type de table (%s) ne supporte pas les colonnes BLOB/TEXT"

# ER_TABLE_CANT_HANDLE_AUTO_INCREMENT 42000
source: "Storage engine %s doesn't support AUTO_INCREMENT columns"
fre: "Ce type de table (%s) ne supporte pas les colonnes AUTO_INCREMENT"

# ER_DELAYED_INSERT_TABLE_LOCKED
source: "INSERT DELAYED can't be used with table '%-.192s' because it is locked with LOCK TABLES"
fre: "INSERT DELAYED ne peut être utilisé avec la table '%-.192s', car elle est verrouée avec LOCK TABLES"

# ER_WRONG_COLUMN_NAME 42000
source: "Incorrect column name '%-.100s'"
fre: "Nom de colonne '%-.100s' incorrect"

# ER_WRONG_MRG_TABLE
source: "Unable to open underlying table which is differently defined or of non-MyISAM type or doesn't exist"
fre: "Toutes les tables de la table de type MERGE n'ont pas la même définition"

# ER_DUP_UNIQUE 23000
source: "Can't write, because of unique constraint, to table '%-.192s'"
fre: "Écriture impossible à cause d'un index UNIQUE sur la table '%-.192s'"

# ER_BLOB_KEY_WITHOUT_LENGTH 42000
source: "BLOB/TEXT column '%-.192s' used in key specification without a key length"
fre: "La colonne '%-.192s' de type BLOB est utilisée dans une définition d'index sans longueur d'index"

# ER_PRIMARY_CANT_HAVE_NULL 42000
source: "All parts of a PRIMARY KEY must be NOT NULL; if you need NULL in a key, use UNIQUE instead"
fre: "Toutes les parties d'un index PRIMARY KEY doivent être NOT NULL; Si vous avez besoin d'un NULL dans l'index, utilisez un index UNIQUE"
