Repository: vladbogo/test-translation
Catalog: fre.xlf
Languages: fre

# ER_TOO_MANY_ROWS 42000
source: "Result consisted of more than one row"
fre: "Le résultat contient plus d'un enregistrement"

# ER_REQUIRES_PRIMARY_KEY 42000
source: "This table type requires a primary key"
fre: "Ce type de table nécessite une clé primaire (PRIMARY KEY)"

# ER_NO_RAID_COMPILED
source: "This version of MariaDB is not compiled with RAID support"
fre: "Cette version de MariaDB n'est pas compilée avec le support RAID"

# ER_UPDATE_WITHOUT_KEY_IN_SAFE_MODE
source: "You are using safe update mode and you tried to update a table without a WHERE that uses a KEY column"
fre: "Vous êtes en mode 'safe update' et vous essayez de faire un UPDATE sans clause WHERE utilisant un index"

# ER_KEY_DOES_NOT_EXISTS 42000 S1009
source: "Key '%-.192s' doesn't exist in table '%-.192s'"
fre: "L'index '%-.192s' n'existe pas sur la table '%-.192s'"

# ER_CHECK_NO_SUCH_TABLE 42000
source: "Can't open table"
fre: "Impossible d'ouvrir la table"

# ER_CHECK_NOT_IMPLEMENTED 42000
source: "The storage engine for the table doesn't support %s"
fre: "Ce type de table ne supporte pas les %s"

# ER_CANT_DO_THIS_DURING_AN_TRANSACTION 25000
source: "You are not allowed to execute this command in a transaction"
fre: "Vous n'êtes pas autorisé à exécute cette commande dans une transaction"

# ER_ERROR_DURING_COMMIT
source: "Got error %M during COMMIT"
fre: "Erreur %M lors du COMMIT"

# ER_ERROR_DURING_ROLLBACK
source: "Got error %M during ROLLBACK"
fre: "Erreur %M lors du ROLLBACK"

# ER_ERROR_DURING_FLUSH_LOGS
source: "Got error %M during FLUSH_LOGS"
fre: "Erreur %M lors du FLUSH_LOGS"

# ER_ERROR_DURING_CHECKPOINT
source: "Got error %M during CHECKPOINT"
fre: "Erreur %M lors du CHECKPOINT"

# ER_NEW_ABORTING_CONNECTION 08S01
source: "Aborted connection %lld to db: '%-.192s' user: '%-.48s' host: '%-.64s' (%-.64s)"
fre: "Connection %lld avortée vers la bd: '%-.192s' utilisateur: '%-.48s' hôte: '%-.64s' (%-.64s)"

# ER_INDEX_REBUILD
source: "Failed rebuilding the index of dumped table '%-.192s'"
fre: "La reconstruction de l'index de la table copiée '%-.192s' a échoué"

# ER_MASTER
source: "Error from master: '%-.64s'"
fre: "Erreur reçue du maître: '%-.64s'"

# ER_MASTER_NET_READ 08S01
source: "Net error reading from master"
fre: "Erreur de lecture réseau reçue du maître"

# ER_MASTER_NET_WRITE 08S01
source: "Net error writing to master"
fre: "Erreur d'écriture réseau reçue du maître"

# ER_FT_MATCHING_KEY_NOT_FOUND
source: "Can't find FULLTEXT index matching the column list"
fre: "Impossible de trouver un index FULLTEXT correspondant à cette liste de colonnes"

# ER_LOCK_OR_ACTIVE_TRANSACTION
source: "Can't execute the given command because you have active locked tables or an active transaction"
fre: "Impossible d'exécuter la commande car vous avez des tables verrouillées ou une transaction active"

# ER_UNKNOWN_SYSTEM_VARIABLE
source: "Unknown system variable '%-.*s'"
fre: "Variable système '%-.*s' inconnue"

# ER_CRASHED_ON_USAGE
source: "Table '%-.192s' is marked as crashed and should be repaired"
fre: "La table '%-.192s' est marquée 'crashed' et devrait être réparée"

# ER_CRASHED_ON_REPAIR
source: "Table '%-.192s' is marked as crashed and last (automatic?) repair failed"
fre: "La table '%-.192s' est marquée 'crashed' et le dernier 'repair' a échoué"

# ER_WARNING_NOT_COMPLETE_ROLLBACK
source: "Some non-transactional changed tables couldn't be rolled back"
fre: "Attention: certaines tables ne supportant pas les transactions ont été changées et elles ne pourront pas être restituées"

# ER_TRANS_CACHE_FULL
source: "Multi-statement transaction required more than 'max_binlog_cache_size' bytes of storage; increase this mariadbd variable and try again"
fre: "Cette transaction à commandes multiples nécessite plus de 'max_binlog_cache_size' octets de stockage, augmentez cette variable de mariadbd et réessayez"

# ER_SLAVE_MUST_STOP
source: "This operation cannot be performed as you have a running slave '%2$*1$s'; run STOP SLAVE '%2$*1$s' first"
fre: "Cette opération ne peut être réalisée avec un esclave '%2$*1$s' actif, faites STOP SLAVE '%2$*1$s' d'abord"

# ER_SLAVE_NOT_RUNNING
source: "This operation requires a running slave; configure slave and do START SLAVE"
fre: "Cette opération nécessite un esclave actif, configurez les esclaves et faites START SLAVE"

# ER_BAD_SLAVE
source: "The server is not configured as slave; fix in config file or with CHANGE MASTER TO"
fre: "Le server n'est pas configuré comme un esclave, changez le fichier de configuration ou utilisez CHANGE MASTER TO"

# ER_MASTER_INFO
source: "Could not initialize master info structure for '%.*s'; more error messages can be found in the MariaDB error log"
fre: "Impossible d'initialiser les structures d'information de maître '%.*s', vous trouverez des messages d'erreur supplémentaires dans le journal des erreurs de MariaDB"

# ER_SLAVE_THREAD
source: "Could not create slave thread; check system resources"
fre: "Impossible de créer une tâche esclave, vérifiez les ressources système"

# ER_TOO_MANY_USER_CONNECTIONS 42000
source: "User %-.64s already has more than 'max_user_connections' active connections"
fre: "L'utilisateur %-.64s possède déjà plus de 'max_user_connections' connexions actives"

# ER_SET_CONSTANTS_ONLY
source: "You may only use constant expressions in this statement"
fre: "Seules les expressions constantes sont autorisées avec SET"

# ER_LOCK_WAIT_TIMEOUT
source: "Lock wait timeout exceeded; try restarting transaction"
fre: "Timeout sur l'obtention du verrou"

# ER_LOCK_TABLE_FULL
source: "The total number of locks exceeds the lock table size"
fre: "Le nombre total de verrou dépasse la taille de la table des verrous"

# ER_READ_ONLY_TRANSACTION 25000
source: "Update locks cannot be acquired during a READ UNCOMMITTED transaction"
fre: "Un verrou en update ne peut être acquit pendant une transaction READ UNCOMMITTED"

# ER_DROP_DB_WITH_READ_LOCK
source: "DROP DATABASE not allowed while thread is holding global read lock"
fre: "DROP DATABASE n'est pas autorisée pendant qu'une tâche possède un verrou global en lecture"

# ER_CREATE_DB_WITH_READ_LOCK
source: "CREATE DATABASE not allowed while thread is holding global read lock"
fre: "CREATE DATABASE n'est pas autorisée pendant qu'une tâche possède un verrou global en lecture"

# ER_WRONG_ARGUMENTS
source: "Incorrect arguments to %s"
fre: "Mauvais arguments à %s"

# ER_NO_PERMISSION_TO_CREATE_USER 42000
source: "'%s'@'%s' is not allowed to create new users"
fre: "'%s'@'%s' n'est pas autorisé à créer de nouveaux utilisateurs"

# ER_UNION_TABLES_IN_DIFFERENT_DIR
source: "Incorrect table definition; all MERGE tables must be in the same database"
fre: "Définition de table incorrecte; toutes les tables MERGE doivent être dans la même base de donnée"

# ER_LOCK_DEADLOCK 40001
source: "Deadlock found when trying to get lock; try restarting transaction"
fre: "Deadlock découvert en essayant d'obtenir les verrous : essayez de redémarrer la transaction"

# ER_TABLE_CANT_HANDLE_FT
source: "The storage engine %s doesn't support FULLTEXT indexes"
fre: "Le type de table utilisé (%s) ne supporte pas les index FULLTEXT"

# ER_CANNOT_ADD_FOREIGN
source: "Cannot add foreign key constraint for `%s`"
fre: "Impossible d'ajouter des contraintes d'index externe à `%s`"

# ER_NO_REFERENCED_ROW 23000
source: "Cannot add or update a child row: a foreign key constraint fails"
fre: "Impossible d'ajouter un enregistrement fils : une constrainte externe l'empèche"

# ER_ROW_IS_REFERENCED 23000
source: "Cannot delete or update a parent row: a foreign key constraint fails"
fre: "Impossible de supprimer un enregistrement père : une constrainte externe l'empèche"

# ER_DUP_ENTRY_WITH_KEY_NAME 23000 S1009
source: "Duplicate entry '%-.64T' for key '%-.192s'"
fre: "Duplicata du champ '%-.64T' pour la clef '%-.192s'"

# ER_ACCESS_DENIED_NO_PASSWORD_ERROR 28000
source: "Access denied for user '%s'@'%s'"
fre: "Accès refusé pour l'utilisateur: '%s'@'%s'"

# ER_DUP_UNKNOWN_IN_INDEX 23000
source: "Duplicate entry for key '%-.192s'"
fre: "Duplicata du champ pour la clef '%-.192s'"
