Repository: vladbogo/test-translation
Catalog: ger.xlf
Languages: ger

# ER_EVENT_CANNOT_ALTER_IN_THE_PAST
source: "Event execution time is in the past and ON COMPLETION NOT PRESERVE is set. The event was not changed. Specify a time in the future"
ger: "Execution Zeitpunkt des Ereignisses in der Vergangenheit liegt, und es war NACH ABSCHLUSS Set nicht erhalten. Die Veranstaltung wurde nicht verändert. Geben Sie einen Zeitpunkt in der Zukunft"

# ER_SLAVE_INCIDENT
source: "The incident %s occurred on the master. Message: %-.64s"
ger: "Der Vorfall %s passierte auf dem Master. Meldung: %-.64s"

# ER_NO_PARTITION_FOR_GIVEN_VALUE_SILENT
source: "Table has no partition for some existing values"
ger: "Tabelle hat für einige bestehende Werte keine Partition"

# ER_BINLOG_UNSAFE_STATEMENT
source: "Unsafe statement written to the binary log using statement format since BINLOG_FORMAT = STATEMENT. %s"
ger: "Unsichere Anweisung ins Binärlog geschrieben, weil Anweisungsformat BINLOG_FORMAT = STATEMENT. %s"

# ER_SLAVE_FATAL_ERROR
source: "Fatal error: %s"
ger: "Fataler Fehler: %s"

# ER_SLAVE_RELAY_LOG_READ_FAILURE
source: "Relay log read failure: %s"
ger: "Relaylog-Lesefehler: %s"

# ER_SLAVE_RELAY_LOG_WRITE_FAILURE
source: "Relay log write failure: %s"
ger: "Relaylog-Schreibfehler: %s"

# ER_SLAVE_CREATE_EVENT_FAILURE
source: "Failed to create %s"
ger: "Erzeugen von %s fehlgeschlagen"

# ER_SLAVE_MASTER_COM_FAILURE
source: "Master command %s failed: %s"
ger: "Master-Befehl %s fehlgeschlagen: %s"

# ER_BINLOG_LOGGING_IMPOSSIBLE
source: "Binary logging not possible. Message: %s"
ger: "Binärlogging nicht möglich. Meldung: %s"

# ER_VIEW_NO_CREATION_CTX
source: "View %`s.%`s has no creation context"
ger: "View %`s.%`s hat keinen Erzeugungskontext"

# ER_VIEW_INVALID_CREATION_CTX
source: "Creation context of view %`s.%`s is invalid"
ger: "Erzeugungskontext des Views%`s.%`s ist ungültig"

# ER_SR_INVALID_CREATION_CTX
source: "Creation context of stored routine %`s.%`s is invalid"
ger: "Erzeugungskontext der gespeicherten Routine%`s.%`s ist ungültig"

# ER_TRG_CORRUPTED_FILE
source: "Corrupted TRG file for table %`s.%`s"
ger: "Beschädigte TRG-Datei für Tabelle %`s.%`s"

# ER_TRG_NO_CREATION_CTX
source: "Triggers for table %`s.%`s have no creation context"
ger: "Trigger für Tabelle %`s.%`s haben keinen Erzeugungskontext"

# ER_TRG_INVALID_CREATION_CTX
source: "Trigger creation context of table %`s.%`s is invalid"
ger: "Trigger-Erzeugungskontext der Tabelle %`s.%`s ist ungültig"

# ER_EVENT_INVALID_CREATION_CTX
source: "Creation context of event %`s.%`s is invalid"
ger: "Erzeugungskontext des Events %`s.%`s ist ungültig"

# ER_TRG_CANT_OPEN_TABLE
source: "Cannot open table for trigger %`s.%`s"
ger: "Kann Tabelle für den Trigger %`s.%`s nicht öffnen"

# ER_CANT_CREATE_SROUTINE
source: "Cannot create stored routine %`s. Check warnings"
ger: "Kann gespeicherte Routine %`s nicht erzeugen. Beachten Sie die Warnungen"

# ER_NO_FORMAT_DESCRIPTION_EVENT_BEFORE_BINLOG_STATEMENT
source: "The BINLOG statement of type %s was not preceded by a format description BINLOG statement"
ger: "Der BINLOG-Anweisung vom Typ %s ging keine BINLOG-Anweisung zur Formatbeschreibung voran"

# ER_SLAVE_CORRUPT_EVENT
source: "Corrupted replication event was detected"
ger: "Beschädigtes Replikationsereignis entdeckt"

# ER_LOAD_DATA_INVALID_COLUMN
source: "Invalid column reference (%-.64s) in LOAD DATA"
ger: "Ungültige Spaltenreferenz (%-.64s) bei LOAD DATA"

# ER_LOG_PURGE_NO_FILE
source: "Being purged log %s was not found"
ger: "Zu bereinigende Logdatei %s wurde nicht gefunden"

# ER_XA_RBTIMEOUT XA106
source: "XA_RBTIMEOUT: Transaction branch was rolled back: took too long"
ger: "XA_RBTIMEOUT: Transaktionszweig wurde zurückgerollt: Zeitüberschreitung"

# ER_XA_RBDEADLOCK XA102
source: "XA_RBDEADLOCK: Transaction branch was rolled back: deadlock was detected"
ger: "XA_RBDEADLOCK: Transaktionszweig wurde zurückgerollt: Deadlock entdeckt"

# ER_NEED_REPREPARE
source: "Prepared statement needs to be re-prepared"
ger: "Vorbereitete Anweisungen müssen noch einmal vorbereitet werden"

# ER_DELAYED_NOT_SUPPORTED
source: "DELAYED option not supported for table '%-.192s'"
ger: "Die DELAYED-Option wird für Tabelle '%-.192s' nicht unterstützt"

# WARN_NO_MASTER_INFO
source: "There is no master connection '%.*s'"
ger: "Die Master-Info-Struktur existiert nicht '%.*s'"

# WARN_OPTION_IGNORED
source: "<%-.64s> option ignored"
ger: "Option <%-.64s> ignoriert"

# ER_PLUGIN_DELETE_BUILTIN
source: "Built-in plugins cannot be deleted"
ger: "Eingebaute Plugins können nicht gelöscht werden"

# WARN_PLUGIN_BUSY
source: "Plugin is busy and will be uninstalled on shutdown"
ger: "Plugin wird verwendet und wird erst beim Herunterfahren deinstalliert"

# ER_VARIABLE_IS_READONLY
source: "%s variable '%s' is read-only. Use SET %s to assign the value"
ger: "%s Variable '%s' ist nur lesbar. Benutzen Sie SET %s, um einen Wert zuzuweisen"

# ER_WARN_ENGINE_TRANSACTION_ROLLBACK
source: "Storage engine %s does not support rollback for this statement. Transaction rolled back and must be restarted"
ger: "Speicher-Engine %s unterstützt für diese Anweisung kein Rollback. Transaktion wurde zurückgerollt und muss neu gestartet werden"

# ER_SLAVE_HEARTBEAT_FAILURE
source: "Unexpected master's heartbeat data: %s"
ger: "Unerwartete Daten vom Heartbeat des Masters: %s"

# ER_CONFLICT_FN_PARSE_ERROR
source: "Error in parsing conflict function. Message: %-.64s"
ger: "Fehler beim Parsen einer Konflikt-Funktion. Meldung: %-.64s"

# ER_EXCEPTIONS_WRITE_ERROR
source: "Write to exceptions table failed. Message: %-.128s""
ger: "Schreiben in Ausnahme-Tabelle fehlgeschlagen. Meldung: %-.128s""

# ER_TOO_LONG_TABLE_COMMENT
source: "Comment for table '%-.64s' is too long (max = %u)"
ger: "Kommentar für Tabelle '%-.64s' ist zu lang (max = %u)"

# ER_TOO_LONG_FIELD_COMMENT
source: "Comment for field '%-.64s' is too long (max = %u)"
ger: "Kommentar für Feld '%-.64s' ist zu lang (max = %u)"

# ER_FUNC_INEXISTENT_NAME_COLLISION 42000
source: "FUNCTION %s does not exist. Check the 'Function Name Parsing and Resolution' section in the Reference Manual"
ger: "FUNCTION %s existiert nicht. Erläuterungen im Abschnitt 'Function Name Parsing and Resolution' im Referenzhandbuch"

# ER_DATABASE_NAME
source: "Database"
ger: "Datenbank"

# ER_TABLE_NAME
source: "Table"
ger: "Tabelle"

# ER_SUBPARTITION_NAME
source: "Subpartition"
ger: "Unterpartition"

# ER_TEMPORARY_NAME
source: "Temporary"
ger: "Temporär"

# ER_RENAMED_NAME
source: "Renamed"
ger: "Umbenannt"

# ER_TOO_MANY_CONCURRENT_TRXS
source: "Too many active concurrent transactions"
ger: "Zu viele aktive simultane Transaktionen"

# WARN_NON_ASCII_SEPARATOR_NOT_IMPLEMENTED
source: "Non-ASCII separator arguments are not fully supported"
ger: "Nicht-ASCII-Trennargumente werden nicht vollständig unterstützt"

# ER_DEBUG_SYNC_TIMEOUT
source: "debug sync point wait timed out"
ger: "Debug Sync Point Wartezeit überschritten"

# ER_DEBUG_SYNC_HIT_LIMIT
source: "debug sync point hit limit reached"
ger: "Debug Sync Point Hit Limit erreicht"

# ER_DUP_SIGNAL_SET 42000
source: "Duplicate condition information item '%s'"
ger: "Informationselement '%s' für Duplikatbedingung"

# ER_SIGNAL_WARN 01000
source: "Unhandled user-defined warning condition"
ger: "Unbehandelte benutzerdefinierte Warnbedingung"

# ER_SIGNAL_NOT_FOUND 02000
source: "Unhandled user-defined not found condition"
ger: "Unbehandelte benutzerdefinierte Nicht-gefunden-Bedingung"

# ER_SIGNAL_EXCEPTION HY000
source: "Unhandled user-defined exception condition"
ger: "Unbehandelte benutzerdefinierte Ausnahmebedingung"

# ER_RESIGNAL_WITHOUT_ACTIVE_HANDLER 0K000
source: "RESIGNAL when handler not active"
ger: "RESIGNAL bei nicht aktivem Handler"

# ER_SIGNAL_BAD_CONDITION_TYPE
source: "SIGNAL/RESIGNAL can only use a CONDITION defined with SQLSTATE"
ger: "SIGNAL/RESIGNAL kann nur mit einer Bedingung (CONDITION) benutzt werden, die bei SQLSTATE definiert wurde"

# WARN_COND_ITEM_TRUNCATED
source: "Data truncated for condition item '%s'"
ger: "Daten gekürzt für Bedingungselement '%s'"

# ER_COND_ITEM_TOO_LONG
source: "Data too long for condition item '%s'"
ger: "Daten zu lang für Bedingungselement '%s'"

# ER_UNKNOWN_LOCALE
source: "Unknown locale: '%-.64s'"
ger: "Unbekannte Locale: '%-.64s'"

# ER_SLAVE_IGNORE_SERVER_IDS
source: "The requested server id %d clashes with the slave startup option --replicate-same-server-id"
ger: "Die angeforderte Server-ID %d steht im Konflikt mit der Startoption --replicate-same-server-id für den Slave"

# ER_SAME_NAME_PARTITION_FIELD
source: "Duplicate partition field name '%-.192s'"
ger: "Partitionsfeld '%-.192s' ist ein Duplikat"

# ER_PARTITION_COLUMN_LIST_ERROR
source: "Inconsistency in usage of column lists for partitioning"
ger: "Inkonsistenz bei der Benutzung von Spaltenlisten für Partitionierung"

# ER_WRONG_TYPE_COLUMN_VALUE_ERROR
source: "Partition column values of incorrect type"
ger: "Partitionsspaltenwerte sind vom falschen Typ"

# ER_TOO_MANY_PARTITION_FUNC_FIELDS_ERROR
source: "Too many fields in '%-.192s'"
ger: "Zu viele Felder in '%-.192s'"

# ER_MAXVALUE_IN_VALUES_IN
source: "Cannot use MAXVALUE as value in VALUES IN"
ger: "MAXVALUE kann nicht als Wert in VALUES IN verwendet werden"

# ER_TOO_MANY_VALUES_ERROR
source: "Cannot have more than one value for this type of %-.64s partitioning"
ger: "Für den Partionierungstyp %-.64s darf es nicht mehr als einen Wert geben"

# ER_ROW_SINGLE_PARTITION_FIELD_ERROR
source: "Row expressions in VALUES IN only allowed for multi-field column partitioning"
ger: "Zeilenausdrücke in VALUES IN sind nur für Mehrfeld-Spaltenpartionierung erlaubt"

# ER_FIELD_TYPE_NOT_ALLOWED_AS_PARTITION_FIELD
source: "Field '%-.192s' is of a not allowed type for this type of partitioning"
ger: "Feld '%-.192s' ist für diese Art von Partitionierung von einem nicht zulässigen Typ"

# ER_PARTITION_FIELDS_TOO_LONG
source: "The total length of the partitioning fields is too large"
ger: "Die Gesamtlänge der Partitionsfelder ist zu groß"

# ER_WARN_DEPRECATED_SYNTAX_NO_REPLACEMENT
source: "'%s' is deprecated and will be removed in a future release"
ger: "'%s' ist veraltet und wird in einer zukünftigen Version entfernt werden"

# ER_SPATIAL_MUST_HAVE_GEOM_COL 42000
source: "A SPATIAL index may only contain a geometrical type column"
ger: "Ein raumbezogener Index (SPATIAL) darf nur Spalten geometrischen Typs enthalten"

# ER_ACCESS_DENIED_NO_PASSWORD_ERROR 28000
source: "Access denied for user '%s'@'%s'"
ger: "Benutzer '%s'@'%s' hat keine Zugriffsberechtigung"

# ER_CANNOT_LOAD_FROM_TABLE_V2
source: "Cannot load from %s.%s. The table is probably corrupted"
ger: "Kann %s.%s nicht einlesen. Tabelle ist wahrscheinlich beschädigt"

# ER_FOREIGN_DUPLICATE_KEY_WITH_CHILD_INFO 23000 S1009
source: "Foreign key constraint for table '%.192s', record '%-.192s' would lead to a duplicate entry in table '%.192s', key '%.192s'"
ger: "Fremdschlüssel-Beschränkung für Tabelle '%.192s', Datensatz '%-.192s' würde zu einem doppelten Eintrag in Tabelle '%.192s', Schlüssel '%.192s' führen"

# ER_FOREIGN_DUPLICATE_KEY_WITHOUT_CHILD_INFO 23000 S1009
source: "Foreign key constraint for table '%.192s', record '%-.192s' would lead to a duplicate entry in a child table"
ger: "Fremdschlüssel-Beschränkung für Tabelle '%.192s', Datensatz '%-.192s' würde zu einem doppelten Eintrag in einer Kind-Tabelle führen"

# ER_COL_COUNT_DOESNT_MATCH_CORRUPTED_V2
source: "Column count of %s.%s is wrong. Expected %d, found %d. The table is probably corrupted"
ger: "Spaltenanzahl von %s.%s falsch. %d erwartet, aber %d gefunden. Tabelle ist wahrscheinlich beschädigt"

# ER_FK_COLUMN_CANNOT_DROP
source: "Cannot drop column '%-.192s': needed in a foreign key constraint '%-.192s'"
ger: "Kann Spalte '%-.192s' nicht löschen: wird für eine Fremdschlüsselbeschränkung '%-.192s' benötigt"

# ER_FK_COLUMN_CANNOT_DROP_CHILD
source: "Cannot drop column '%-.192s': needed in a foreign key constraint '%-.192s' of table %-.192s"
ger: "Kann Spalte '%-.192s' nicht löschen: wird für eine Fremdschlüsselbeschränkung '%-.192s' der Tabelle %-.192s benötigt"

# ER_FK_COLUMN_NOT_NULL
source: "Column '%-.192s' cannot be NOT NULL: needed in a foreign key constraint '%-.192s' SET NULL"
ger: "Spalte '%-.192s' kann nicht NOT NULL sein: wird für eine Fremdschlüsselbeschränkung '%-.192s' SET NULL benötigt"

# ER_DUP_UNKNOWN_IN_INDEX 23000
source: "Duplicate entry for key '%-.192s'"
ger: "Doppelter Eintrag für Schlüssel '%-.192s'"

# ER_GTID_OPEN_TABLE_FAILED
source: "Failed to open %s.%s"
ger: "Öffnen von %s.%s fehlgeschlagen"

# ER_NO_SUCH_QUERY
source: "Unknown query id: %lld"
ger: "Unbekannte Abfrage-ID: %lld"

# ER_KILL_QUERY_DENIED_ERROR
source: "You are not owner of query %lu"
ger: "Sie sind nicht Eigentümer von Abfrage %lu"

# ER_COL_COUNT_DOESNT_MATCH_PLEASE_UPDATE_V2
source: "Column count of %s.%s is wrong. Expected %d, found %d. Created with MariaDB %d, now running %d. Please use mariadb-upgrade to fix this error."
ger: "Spaltenanzahl von %s.%s falsch. %d erwartet, aber %d erhalten. Erzeugt mit MariaDB %d, jetzt unter %d. Bitte benutzen Sie mariadb-upgrade, um den Fehler zu beheben"

# ER_CONSTRAINT_FAILED 23000
source: "CONSTRAINT %`s failed for %`-.192s.%`-.192s"
ger: "CONSTRAINT %`s fehlgeschlagen: %`-.192s.%`-.192s"

# ER_SLAVE_IGNORED_SHARED_TABLE
source: "Slave SQL thread ignored the '%s' because table is shared"
ger: "Slave-SQL-Thread hat die Abfrage '%s' ignoriert"
