Repository: vladbogo/test-translation
Catalog: ger.xlf
Languages: ger

# ER_NO
source: "NO"
ger: "Nein"

# ER_YES
source: "YES"
ger: "Ja"

# ER_CANT_CREATE_FILE
source: "Can't create file '%-.200s' (errno: %M)"
ger: "Kann Datei '%-.200s' nicht erzeugen (Fehler: %M)"

# ER_CANT_CREATE_TABLE
source: "Can't create table %`s.%`s (errno: %M)"
ger: "Kann Tabelle %`s.%`s nicht erzeugen (Fehler: %M)"

# ER_CANT_CREATE_DB
source: "Can't create database '%-.192s' (errno: %M)"
ger: "Kann Datenbank '%-.192s' nicht erzeugen (Fehler: %M)"

# ER_DB_CREATE_EXISTS
source: "Can't create database '%-.192s'; database exists"
ger: "Kann Datenbank '%-.192s' nicht erzeugen. Datenbank existiert bereits"

# ER_DB_DROP_EXISTS
source: "Can't drop database '%-.192s'; database doesn't exist"
ger: "Kann Datenbank '%-.192s' nicht löschen; Datenbank nicht vorhanden"

# ER_DB_DROP_DELETE
source: "Error dropping database (can't delete '%-.192s', errno: %M)"
ger: "Fehler beim Löschen der Datenbank ('%-.192s' kann nicht gelöscht werden, Fehler: %M)"

# ER_DB_DROP_RMDIR
source: "Error dropping database (can't rmdir '%-.192s', errno: %M)"
ger: "Fehler beim Löschen der Datenbank (Verzeichnis '%-.192s' kann nicht gelöscht werden, Fehler: %M)"

# ER_CANT_DELETE_FILE
source: "Error on delete of '%-.192s' (errno: %M)"
ger: "Fehler beim Löschen von '%-.192s' (Fehler: %M)"

# ER_CANT_FIND_SYSTEM_REC
source: "Can't read record in system table"
ger: "Datensatz in der Systemtabelle nicht lesbar"

# ER_CANT_GET_STAT
source: "Can't get status of '%-.200s' (errno: %M)"
ger: "Kann Status von '%-.200s' nicht ermitteln (Fehler: %M)"

# ER_CANT_GET_WD
source: "Can't get working directory (errno: %M)"
ger: "Kann Arbeitsverzeichnis nicht ermitteln (Fehler: %M)"

# ER_CANT_LOCK
source: "Can't lock file (errno: %M)"
ger: "Datei kann nicht gesperrt werden (Fehler: %M)"

# ER_CANT_OPEN_FILE
source: "Can't open file: '%-.200s' (errno: %M)"
ger: "Kann Datei '%-.200s' nicht öffnen (Fehler: %M)"

# ER_FILE_NOT_FOUND
source: "Can't find file: '%-.200s' (errno: %M)"
ger: "Kann Datei '%-.200s' nicht finden (Fehler: %M)"

# ER_CANT_READ_DIR
source: "Can't read dir of '%-.192s' (errno: %M)"
ger: "Verzeichnis von '%-.192s' nicht lesbar (Fehler: %M)"

# ER_CANT_SET_WD
source: "Can't change dir to '%-.192s' (errno: %M)"
ger: "Kann nicht in das Verzeichnis '%-.192s' wechseln (Fehler: %M)"

# ER_CHECKREAD
source: "Record has changed since last read in table '%-.192s'"
ger: "Datensatz hat sich seit dem letzten Zugriff auf Tabelle '%-.192s' geändert"

# ER_DISK_FULL
source: "Disk full (%s); waiting for someone to free some space... (errno: %M)"
ger: "Festplatte voll (%s). Warte, bis jemand Platz schafft ... (Fehler: %M)"

# ER_DUP_KEY 23000
source: "Can't write; duplicate key in table '%-.192s'"
ger: "Kann nicht speichern, Grund: doppelter Schlüssel in Tabelle '%-.192s'"

# ER_ERROR_ON_CLOSE
source: "Error on close of '%-.192s' (errno: %M)"
ger: "Fehler beim Schließen von '%-.192s' (Fehler: %M)"

# ER_ERROR_ON_READ
source: "Error reading file '%-.200s' (errno: %M)"
ger: "Fehler beim Lesen der Datei '%-.200s' (Fehler: %M)"

# ER_ERROR_ON_RENAME
source: "Error on rename of '%-.210s' to '%-.210s' (errno: %M)"
ger: "Fehler beim Umbenennen von '%-.210s' in '%-.210s' (Fehler: %M)"

# ER_ERROR_ON_WRITE
source: "Error writing file '%-.200s' (errno: %M)"
ger: "Fehler beim Speichern der Datei '%-.200s' (Fehler: %M)"

# ER_FILE_USED
source: "'%-.192s' is locked against change"
ger: "'%-.192s' ist für Änderungen gesperrt"

# ER_FILSORT_ABORT
source: "Sort aborted"
ger: "Sortiervorgang abgebrochen"

# ER_FORM_NOT_FOUND
source: "View '%-.192s' doesn't exist for '%-.192s'"
ger: "View '%-.192s' existiert für '%-.192s' nicht"

# ER_GET_ERRNO
source: "Got error %M from storage engine %s"
ger: "Fehler %M von Speicher-Engine %s"

# ER_ILLEGAL_HA
source: "Storage engine %s of the table %`s.%`s doesn't have this option"
ger: "Diese Option gibt es nicht in Speicher-Engine %s für %`s.%`s"

# ER_KEY_NOT_FOUND
source: "Can't find record in '%-.192s'"
ger: "Kann Datensatz in '%-.192s' nicht finden"

# ER_NOT_FORM_FILE
source: "Incorrect information in file: '%-.200s'"
ger: "Falsche Information in Datei '%-.200s'"

# ER_NOT_KEYFILE
source: "Index for table '%-.200s' is corrupt; try to repair it"
ger: "Fehlerhafte Index-Datei für Tabelle '%-.200s'; versuche zu reparieren"

# ER_OLD_KEYFILE
source: "Old key file for table '%-.192s'; repair it!"
ger: "Alte Index-Datei für Tabelle '%-.192s'. Bitte reparieren"

# ER_OPEN_AS_READONLY
source: "Table '%-.192s' is read only"
ger: "Tabelle '%-.192s' ist nur lesbar"

# ER_OUTOFMEMORY HY001 S1001
source: "Out of memory; restart server and try again (needed %d bytes)"
ger: "Kein Speicher vorhanden (%d Bytes benötigt). Bitte Server neu starten"

# ER_OUT_OF_SORTMEMORY HY001 S1001
source: "Out of sort memory, consider increasing server sort buffer size"
ger: "Kein Speicher zum Sortieren vorhanden. sort_buffer_size sollte im Server erhöht werden"

# ER_UNEXPECTED_EOF
source: "Unexpected EOF found when reading file '%-.192s' (errno: %M)"
ger: "Unerwartetes Ende beim Lesen der Datei '%-.192s' (Fehler: %M)"

# ER_CON_COUNT_ERROR 08004
source: "Too many connections"
ger: "Zu viele Verbindungen"

# ER_OUT_OF_RESOURCES
source: "Out of memory."
ger: "Kein Speicher mehr vorhanden."

# ER_BAD_HOST_ERROR 08S01
source: "Can't get hostname for your address"
ger: "Kann Hostnamen für diese Adresse nicht erhalten"

# ER_HANDSHAKE_ERROR 08S01
source: "Bad handshake"
ger: "Ungültiger Handshake"

# ER_DBACCESS_DENIED_ERROR 42000
source: "Access denied for user '%s'@'%s' to database '%-.192s'"
ger: "Benutzer '%s'@'%s' hat keine Zugriffsberechtigung für Datenbank '%-.192s'"

# ER_ACCESS_DENIED_ERROR 28000
source: "Access denied for user '%s'@'%s' (using password: %s)"
ger: "Benutzer '%s'@'%s' hat keine Zugriffsberechtigung (verwendetes Passwort: %s)"

# ER_NO_DB_ERROR 3D000
source: "No database selected"
ger: "Keine Datenbank ausgewählt"

# ER_UNKNOWN_COM_ERROR 08S01
source: "Unknown command"
ger: "Unbekannter Befehl"

# ER_BAD_NULL_ERROR 23000
source: "Column '%-.192s' cannot be null"
ger: "Feld '%-.192s' darf nicht NULL sein"

# ER_BAD_DB_ERROR 42000
source: "Unknown database '%-.192s'"
ger: "Unbekannte Datenbank '%-.192s'"

# ER_TABLE_EXISTS_ERROR 42S01
source: "Table '%-.192s' already exists"
ger: "Tabelle '%-.192s' bereits vorhanden"

# ER_BAD_TABLE_ERROR 42S02
source: "Unknown table '%-.100T'"
ger: "Unbekannte Tabelle '%-.100T'"

# ER_NON_UNIQ_ERROR 23000
source: "Column '%-.192s' in %-.192s is ambiguous"
ger: "Feld '%-.192s' in %-.192s ist nicht eindeutig"

# ER_SERVER_SHUTDOWN 08S01
source: "Server shutdown in progress"
ger: "Der Server wird heruntergefahren"

# ER_BAD_FIELD_ERROR 42S22 S0022
source: "Unknown column '%-.192s' in '%-.192s'"
ger: "Unbekanntes Tabellenfeld '%-.192s' in %-.192s"

# ER_WRONG_FIELD_WITH_GROUP 42000 S1009
source: "'%-.192s' isn't in GROUP BY"
ger: "'%-.192s' ist nicht in GROUP BY vorhanden"

# ER_WRONG_GROUP_FIELD 42000 S1009
source: "Can't group on '%-.192s'"
ger: "Gruppierung über '%-.192s' nicht möglich"

# ER_WRONG_SUM_SELECT 42000 S1009
source: "Statement has sum functions and columns in same statement"
ger: "Die Verwendung von Summierungsfunktionen und Spalten im selben Befehl ist nicht erlaubt"

# ER_WRONG_VALUE_COUNT 21S01
source: "Column count doesn't match value count"
ger: "Die Anzahl der Spalten entspricht nicht der Anzahl der Werte"

# ER_TOO_LONG_IDENT 42000 S1009
source: "Identifier name '%-.100T' is too long"
ger: "Name des Bezeichners '%-.100T' ist zu lang"

# ER_DUP_FIELDNAME 42S21 S1009
source: "Duplicate column name '%-.192s'"
ger: "Doppelter Spaltenname: '%-.192s'"

# ER_DUP_KEYNAME 42000 S1009
source: "Duplicate key name '%-.192s'"
ger: "Doppelter Name für Schlüssel vorhanden: '%-.192s'"

# ER_DUP_ENTRY 23000 S1009
source: "Duplicate entry '%-.192T' for key %d"
ger: "Doppelter Eintrag '%-.192T' für Schlüssel %d"

# ER_WRONG_FIELD_SPEC 42000 S1009
source: "Incorrect column specifier for column '%-.192s'"
ger: "Falsche Spezifikation für Feld '%-.192s'"

# ER_PARSE_ERROR 42000 s1009
source: "%s near '%-.80T' at line %d"
ger: "%s bei '%-.80T' in Zeile %d"

# ER_EMPTY_QUERY 42000
source: "Query was empty"
ger: "Leere Abfrage"

# ER_NONUNIQ_TABLE 42000 S1009
source: "Not unique table/alias: '%-.192s'"
ger: "Tabellenname/Alias '%-.192s' nicht eindeutig"

# ER_INVALID_DEFAULT 42000 S1009
source: "Invalid default value for '%-.192s'"
ger: "Fehlerhafter Vorgabewert (DEFAULT) für '%-.192s'"

# ER_MULTIPLE_PRI_KEY 42000 S1009
source: "Multiple primary key defined"
ger: "Mehrere Primärschlüssel (PRIMARY KEY) definiert"

# ER_TOO_MANY_KEYS 42000 S1009
source: "Too many keys specified; max %d keys allowed"
ger: "Zu viele Schlüssel definiert. Maximal %d Schlüssel erlaubt"

# ER_TOO_MANY_KEY_PARTS 42000 S1009
source: "Too many key parts specified; max %d parts allowed"
ger: "Zu viele Teilschlüssel definiert. Maximal %d Teilschlüssel erlaubt"

# ER_TOO_LONG_KEY 42000 S1009
source: "Specified key was too long; max key length is %d bytes"
ger: "Schlüssel ist zu lang. Die maximale Schlüssellänge beträgt %d"

# ER_KEY_COLUMN_DOES_NOT_EXIST 42000 S1009
source: "Key column '%-.192s' doesn't exist in table"
ger: "In der Tabelle gibt es kein Schlüsselfeld '%-.192s'"

# ER_BLOB_USED_AS_KEY 42000 S1009
source: "BLOB column %`s can't be used in key specification in the %s table"
ger: "BLOB-Feld %`s kann beim %s Tabellen nicht als Schlüssel verwendet werden"

# ER_TOO_BIG_FIELDLENGTH 42000 S1009
source: "Column length too big for column '%-.192s' (max = %lu); use BLOB or TEXT instead"
ger: "Feldlänge für Feld '%-.192s' zu groß (maximal %lu). BLOB- oder TEXT-Spaltentyp verwenden!"

# ER_WRONG_AUTO_KEY 42000 S1009
source: "Incorrect table definition; there can be only one auto column and it must be defined as a key"
ger: "Falsche Tabellendefinition. Es darf nur eine AUTO_INCREMENT-Spalte geben, und diese muss als Schlüssel definiert werden"

# ER_NORMAL_SHUTDOWN
source: "%s (initiated by: %s): Normal shutdown"
ger: "%s (%s): Normal heruntergefahren"

# ER_GOT_SIGNAL
source: "%s: Got signal %d. Aborting!\n"
ger: "%s: Signal %d erhalten. Abbruch!\n"

# ER_SHUTDOWN_COMPLETE
source: "%s: Shutdown complete\n"
ger: "%s: Herunterfahren beendet\n"

# ER_FORCING_CLOSE 08S01
source: "%s: Forcing close of thread %ld user: '%-.48s'\n"
ger: "%s: Thread %ld zwangsweise beendet. Benutzer: '%-.48s'\n"

# ER_IPSOCK_ERROR 08S01
source: "Can't create IP socket"
ger: "Kann IP-Socket nicht erzeugen"

# ER_NO_SUCH_INDEX 42S12 S1009
source: "Table '%-.192s' has no index like the one used in CREATE INDEX; recreate the table"
ger: "Tabelle '%-.192s' besitzt keinen wie den in CREATE INDEX verwendeten Index. Tabelle neu anlegen"

# ER_WRONG_FIELD_TERMINATORS 42000 S1009
source: "Field separator argument is not what is expected; check the manual"
ger: "Feldbegrenzer-Argument ist nicht in der erwarteten Form. Bitte im Handbuch nachlesen"

# ER_BLOBS_AND_NO_TERMINATED 42000 S1009
source: "You can't use fixed rowlength with BLOBs; please use 'fields terminated by'"
ger: "Eine feste Zeilenlänge kann für BLOB-Felder nicht verwendet werden. Bitte 'fields terminated by' verwenden"

# ER_TEXTFILE_NOT_READABLE
source: "The file '%-.128s' must be in the database directory or be readable by all"
ger: "Datei '%-.128s' muss im Datenbank-Verzeichnis vorhanden oder lesbar für alle sein"

# ER_FILE_EXISTS_ERROR
source: "File '%-.200s' already exists"
ger: "Datei '%-.200s' bereits vorhanden"

# ER_LOAD_INFO
source: "Records: %ld Deleted: %ld Skipped: %ld Warnings: %ld"
ger: "Datensätze: %ld Gelöscht: %ld Ausgelassen: %ld Warnungen: %ld"

# ER_ALTER_INFO
source: "Records: %ld Duplicates: %ld"
ger: "Datensätze: %ld Duplikate: %ld"

# ER_WRONG_SUB_KEY
source: "Incorrect prefix key; the used key part isn't a string, the used length is longer than the key part, or the storage engine doesn't support unique prefix keys"
ger: "Falscher Unterteilschlüssel. Der verwendete Schlüsselteil ist entweder kein String, die verwendete Länge ist länger als der Teilschlüssel oder die Speicher-Engine unterstützt keine Unterteilschlüssel"

# ER_CANT_REMOVE_ALL_FIELDS 42000
source: "You can't delete all columns with ALTER TABLE; use DROP TABLE instead"
ger: "Mit ALTER TABLE können nicht alle Felder auf einmal gelöscht werden. Dafür DROP TABLE verwenden"

# ER_CANT_DROP_FIELD_OR_KEY 42000
source: "Can't DROP %s %`-.192s; check that it exists"
ger: "DROP %s: Kann %`-.192s nicht löschen. Existiert es?"

# ER_INSERT_INFO
source: "Records: %ld Duplicates: %ld Warnings: %ld"
ger: "Datensätze: %ld Duplikate: %ld Warnungen: %ld"

# ER_NO_SUCH_THREAD
source: "Unknown thread id: %lu"
ger: "Unbekannte Thread-ID: %lu"

# ER_KILL_DENIED_ERROR
source: "You are not owner of thread %lld"
ger: "Sie sind nicht Eigentümer von Thread %lld"

# ER_NO_TABLES_USED
source: "No tables used"
ger: "Keine Tabellen verwendet"

# ER_TOO_BIG_SET
source: "Too many strings for column %-.192s and SET"
ger: "Zu viele Strings für Feld %-.192s und SET angegeben"

# ER_NO_UNIQUE_LOGFILE
source: "Can't generate a unique log-filename %-.200s.(1-999)\n"
ger: "Kann keinen eindeutigen Dateinamen für die Logdatei %-.200s(1-999) erzeugen\n"

# ER_TABLE_NOT_LOCKED_FOR_WRITE
source: "Table '%-.192s' was locked with a READ lock and can't be updated"
ger: "Tabelle '%-.192s' ist mit Lesesperre versehen und kann nicht aktualisiert werden"

# ER_TABLE_NOT_LOCKED
source: "Table '%-.192s' was not locked with LOCK TABLES"
ger: "Tabelle '%-.192s' wurde nicht mit LOCK TABLES gesperrt"

# ER_WRONG_DB_NAME 42000
source: "Incorrect database name '%-.100T'"
ger: "Unerlaubter Datenbankname '%-.100T'"

# ER_WRONG_TABLE_NAME 42000
source: "Incorrect table name '%-.100s'"
ger: "Unerlaubter Tabellenname '%-.100s'"

# ER_TOO_BIG_SELECT 42000
source: "The SELECT would examine more than MAX_JOIN_SIZE rows; check your WHERE and use SET SQL_BIG_SELECTS=1 or SET MAX_JOIN_SIZE=# if the SELECT is okay"
ger: "Die Ausführung des SELECT würde zu viele Datensätze untersuchen und wahrscheinlich sehr lange dauern. Bitte WHERE-Klausel überprüfen und gegebenenfalls SET SQL_BIG_SELECTS=1 oder SET MAX_JOIN_SIZE=# verwenden"

# ER_UNKNOWN_ERROR
source: "Unknown error"
ger: "Unbekannter Fehler"

# ER_UNKNOWN_PROCEDURE 42000
source: "Unknown procedure '%-.192s'"
ger: "Unbekannte Prozedur '%-.192s'"

# ER_WRONG_PARAMCOUNT_TO_PROCEDURE 42000
source: "Incorrect parameter count to procedure '%-.192s'"
ger: "Falsche Parameterzahl für Prozedur '%-.192s'"

# ER_WRONG_PARAMETERS_TO_PROCEDURE
source: "Incorrect parameters to procedure '%-.192s'"
ger: "Falsche Parameter für Prozedur '%-.192s'"

# ER_UNKNOWN_TABLE 42S02
source: "Unknown table '%-.192s' in %-.32s"
ger: "Unbekannte Tabelle '%-.192s' in '%-.32s'"

# ER_FIELD_SPECIFIED_TWICE 42000
source: "Column '%-.192s' specified twice"
ger: "Feld '%-.192s' wurde zweimal angegeben"

# ER_INVALID_GROUP_FUNC_USE
source: "Invalid use of group function"
ger: "Falsche Verwendung einer Gruppierungsfunktion"

# ER_UNSUPPORTED_EXTENSION 42000
source: "Table '%-.192s' uses an extension that doesn't exist in this MariaDB version"
ger: "Tabelle '%-.192s' verwendet eine Erweiterung, die in dieser MariaDB-Version nicht verfügbar ist"

# ER_TABLE_MUST_HAVE_COLUMNS 42000
source: "A table must have at least 1 column"
ger: "Eine Tabelle muss mindestens eine Spalte besitzen"

# ER_RECORD_FILE_FULL
source: "The table '%-.192s' is full"
ger: "Tabelle '%-.192s' ist voll"

# ER_UNKNOWN_CHARACTER_SET 42000
source: "Unknown character set: '%-.64s'"
ger: "Unbekannter Zeichensatz: '%-.64s'"

# ER_TOO_MANY_TABLES
source: "Too many tables; MariaDB can only use %d tables in a join"
ger: "Zu viele Tabellen. MariaDB kann in einem Join maximal %d Tabellen verwenden"

# ER_TOO_MANY_FIELDS
source: "Too many columns"
ger: "Zu viele Felder"

# ER_TOO_BIG_ROWSIZE 42000
source: "Row size too large. The maximum row size for the used table type, not counting BLOBs, is %ld. This includes storage overhead, check the manual. You have to change some columns to TEXT or BLOBs"
ger: "Zeilenlänge zu groß. Die maximale Zeilenlänge für den verwendeten Tabellentyp (ohne BLOB-Felder) beträgt %ld. Einige Felder müssen in BLOB oder TEXT umgewandelt werden"

# ER_STACK_OVERRUN
source: "Thread stack overrun: Used: %ld of a %ld stack. Use 'mariadbd --thread_stack=#' to specify a bigger stack if needed"
ger: "Thread-Stack-Überlauf. Benutzt: %ld von %ld Stack. 'mariadbd --thread_stack=#' verwenden, um bei Bedarf einen größeren Stack anzulegen"

# ER_WRONG_OUTER_JOIN 42000
source: "Cross dependency found in OUTER JOIN; examine your ON conditions"
ger: "OUTER JOIN enthält fehlerhafte Abhängigkeiten. In ON verwendete Bedingungen überprüfen"

# ER_CANT_FIND_UDF
source: "Can't load function '%-.192s'"
ger: "Kann Funktion '%-.192s' nicht laden"

# ER_CANT_INITIALIZE_UDF
source: "Can't initialize function '%-.192s'; %-.80s"
ger: "Kann Funktion '%-.192s' nicht initialisieren: %-.80s"

# ER_UDF_NO_PATHS
source: "No paths allowed for shared library"
ger: "Keine Pfade gestattet für Shared Library"

# ER_UDF_EXISTS
source: "Function '%-.192s' already exists"
ger: "Funktion '%-.192s' existiert schon"

# ER_CANT_OPEN_LIBRARY
source: "Can't open shared library '%-.192s' (errno: %d, %-.128s)"
ger: "Kann Shared Library '%-.192s' nicht öffnen (Fehler: %d, %-.128s)"

# ER_CANT_FIND_DL_ENTRY
source: "Can't find symbol '%-.128s' in library"
ger: "Kann Funktion '%-.128s' in der Library nicht finden"

# ER_FUNCTION_NOT_DEFINED
source: "Function '%-.192s' is not defined"
ger: "Funktion '%-.192s' ist nicht definiert"

# ER_HOST_IS_BLOCKED
source: "Host '%-.64s' is blocked because of many connection errors; unblock with 'mariadb-admin flush-hosts'"
ger: "Host '%-.64s' blockiert wegen zu vieler Verbindungsfehler. Aufheben der Blockierung mit 'mariadb-admin flush-hosts'"

# ER_HOST_NOT_PRIVILEGED
source: "Host '%-.64s' is not allowed to connect to this MariaDB server"
ger: "Host '%-.64s' hat keine Berechtigung, sich mit diesem MariaDB-Server zu verbinden"

# ER_PASSWORD_ANONYMOUS_USER 42000
source: "You are using MariaDB as an anonymous user and anonymous users are not allowed to modify user settings"
ger: "Sie benutzen MariaDB als anonymer Benutzer und dürfen daher keine Passwörter ändern"

# ER_PASSWORD_NOT_ALLOWED 42000
source: "You must have privileges to update tables in the mysql database to be able to change passwords for others"
ger: "Sie benötigen die Berechtigung zum Aktualisieren von Tabellen in der Datenbank 'mysql', um die Passwörter anderer Benutzer ändern zu können"

# ER_PASSWORD_NO_MATCH 28000
source: "Can't find any matching row in the user table"
ger: "Kann keinen passenden Datensatz in Tabelle 'user' finden"

# ER_UPDATE_INFO
source: "Rows matched: %ld Changed: %ld Warnings: %ld"
ger: "Datensätze gefunden: %ld Geändert: %ld Warnungen: %ld"

# ER_CANT_CREATE_THREAD
source: "Can't create a new thread (errno %M); if you are not out of available memory, you can consult the manual for a possible OS-dependent bug"
ger: "Kann keinen neuen Thread erzeugen (Fehler: %M). Sollte noch Speicher verfügbar sein, bitte im Handbuch wegen möglicher Fehler im Betriebssystem nachschlagen"

# ER_WRONG_VALUE_COUNT_ON_ROW 21S01
source: "Column count doesn't match value count at row %lu"
ger: "Anzahl der Felder stimmt nicht mit der Anzahl der Werte in Zeile %lu überein"

# ER_CANT_REOPEN_TABLE
source: "Can't reopen table: '%-.192s'"
ger: "Kann Tabelle'%-.192s' nicht erneut öffnen"

# ER_INVALID_USE_OF_NULL 22004
source: "Invalid use of NULL value"
ger: "Unerlaubte Verwendung eines NULL-Werts"

# ER_REGEXP_ERROR 42000
source: "Regex error '%s'"
ger: "Regexp Fehler %s"

# ER_MIX_OF_GROUP_FUNC_AND_FIELDS 42000
source: "Mixing of GROUP columns (MIN(),MAX(),COUNT(),...) with no GROUP columns is illegal if there is no GROUP BY clause"
ger: "Das Vermischen von GROUP-Feldern (MIN(),MAX(),COUNT()...) mit Nicht-GROUP-Feldern ist nicht zulässig, wenn keine GROUP-BY-Klausel vorhanden ist"

# ER_NONEXISTING_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s'"
ger: "Für Benutzer '%-.48s' auf Host '%-.64s' gibt es keine solche Berechtigung"

# ER_TABLEACCESS_DENIED_ERROR 42000
source: "%-.100T command denied to user '%s'@'%s' for table '%-.192s'"
ger: "%-.100T Befehl nicht erlaubt für Benutzer '%s'@'%s' auf Tabelle '%-.192s'"

# ER_COLUMNACCESS_DENIED_ERROR 42000
source: "%-.32s command denied to user '%s'@'%s' for column '%-.192s' in table '%-.192s'"
ger: "%-.32s Befehl nicht erlaubt für Benutzer '%s'@'%s' und Feld '%-.192s' in Tabelle '%-.192s'"

# ER_ILLEGAL_GRANT_FOR_TABLE 42000
source: "Illegal GRANT/REVOKE command; please consult the manual to see which privileges can be used"
ger: "Unzulässiger GRANT- oder REVOKE-Befehl. Verfügbare Berechtigungen sind im Handbuch aufgeführt"

# ER_GRANT_WRONG_HOST_OR_USER 42000
source: "The host or user argument to GRANT is too long"
ger: "Das Host- oder User-Argument für GRANT ist zu lang"

# ER_NO_SUCH_TABLE 42S02
source: "Table '%-.192s.%-.192s' doesn't exist"
ger: "Tabelle '%-.192s.%-.192s' existiert nicht"

# ER_NONEXISTING_TABLE_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s' on table '%-.192s'"
ger: "Eine solche Berechtigung ist für User '%-.48s' auf Host '%-.64s' an Tabelle '%-.192s' nicht definiert"

# ER_NOT_ALLOWED_COMMAND 42000
source: "The used command is not allowed with this MariaDB version"
ger: "Der verwendete Befehl ist in dieser MariaDB-Version nicht zulässig"

# ER_SYNTAX_ERROR 42000
source: "You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use"
ger: "Fehler in der SQL-Syntax. Bitte die korrekte Syntax im Handbuch nachschlagen"

# ER_DELAYED_CANT_CHANGE_LOCK
source: "Delayed insert thread couldn't get requested lock for table %-.192s"
ger: "Verzögerter (DELAYED) Einfüge-Thread konnte die angeforderte Sperre für Tabelle '%-.192s' nicht erhalten"

# ER_TOO_MANY_DELAYED_THREADS
source: "Too many delayed threads in use"
ger: "Zu viele verzögerte (DELAYED) Threads in Verwendung"

# ER_ABORTING_CONNECTION 08S01
source: "Aborted connection %ld to db: '%-.192s' user: '%-.48s' (%-.64s)"
ger: "Abbruch der Verbindung %ld zur Datenbank '%-.192s'. Benutzer: '%-.48s' (%-.64s)"

# ER_NET_PACKET_TOO_LARGE 08S01
source: "Got a packet bigger than 'max_allowed_packet' bytes"
ger: "Empfangenes Paket ist größer als 'max_allowed_packet' Bytes"

# ER_NET_READ_ERROR_FROM_PIPE 08S01
source: "Got a read error from the connection pipe"
ger: "Lese-Fehler bei einer Verbindungs-Pipe"

# ER_NET_FCNTL_ERROR 08S01
source: "Got an error from fcntl()"
ger: "fcntl() lieferte einen Fehler"

# ER_NET_PACKETS_OUT_OF_ORDER 08S01
source: "Got packets out of order"
ger: "Pakete nicht in der richtigen Reihenfolge empfangen"

# ER_NET_UNCOMPRESS_ERROR 08S01
source: "Couldn't uncompress communication packet"
ger: "Kommunikationspaket lässt sich nicht entpacken"

# ER_NET_READ_ERROR 08S01
source: "Got an error reading communication packets"
ger: "Fehler beim Lesen eines Kommunikationspakets"

# ER_NET_READ_INTERRUPTED 08S01
source: "Got timeout reading communication packets"
ger: "Zeitüberschreitung beim Lesen eines Kommunikationspakets"

# ER_NET_ERROR_ON_WRITE 08S01
source: "Got an error writing communication packets"
ger: "Fehler beim Schreiben eines Kommunikationspakets"

# ER_NET_WRITE_INTERRUPTED 08S01
source: "Got timeout writing communication packets"
ger: "Zeitüberschreitung beim Schreiben eines Kommunikationspakets"

# ER_TOO_LONG_STRING 42000
source: "Result string is longer than 'max_allowed_packet' bytes"
ger: "Ergebnis-String ist länger als 'max_allowed_packet' Bytes"

# ER_TABLE_CANT_HANDLE_BLOB 42000
source: "Storage engine %s doesn't support BLOB/TEXT columns"
ger: "Der verwendete Tabellentyp (%s) unterstützt keine BLOB- und TEXT-Felder"
