Repository: vladbogo/test-translation
Catalog: ger.xlf
Languages: ger

# ER_TABLE_CANT_HANDLE_AUTO_INCREMENT 42000
source: "Storage engine %s doesn't support AUTO_INCREMENT columns"
ger: "Der verwendete Tabellentyp (%s) unterstützt keine AUTO_INCREMENT-Felder"

# ER_DELAYED_INSERT_TABLE_LOCKED
source: "INSERT DELAYED can't be used with table '%-.192s' because it is locked with LOCK TABLES"
ger: "INSERT DELAYED kann für Tabelle '%-.192s' nicht verwendet werden, da sie mit LOCK TABLES gesperrt ist"

# ER_WRONG_COLUMN_NAME 42000
source: "Incorrect column name '%-.100s'"
ger: "Falscher Spaltenname '%-.100s'"

# ER_WRONG_KEY_COLUMN 42000
source: "The storage engine %s can't index column %`s"
ger: "Die Speicher-Engine %s kann die Spalte %`s nicht indizieren"

# ER_WRONG_MRG_TABLE
source: "Unable to open underlying table which is differently defined or of non-MyISAM type or doesn't exist"
ger: "Nicht alle Tabellen in der MERGE-Tabelle sind gleich definiert"

# ER_DUP_UNIQUE 23000
source: "Can't write, because of unique constraint, to table '%-.192s'"
ger: "Schreiben in Tabelle '%-.192s' nicht möglich wegen einer Eindeutigkeitsbeschränkung (unique constraint)"

# ER_BLOB_KEY_WITHOUT_LENGTH 42000
source: "BLOB/TEXT column '%-.192s' used in key specification without a key length"
ger: "BLOB- oder TEXT-Spalte '%-.192s' wird in der Schlüsseldefinition ohne Schlüssellängenangabe verwendet"

# ER_PRIMARY_CANT_HAVE_NULL 42000
source: "All parts of a PRIMARY KEY must be NOT NULL; if you need NULL in a key, use UNIQUE instead"
ger: "Alle Teile eines PRIMARY KEY müssen als NOT NULL definiert sein. Wenn NULL in einem Schlüssel benötigt wird, muss ein UNIQUE-Schlüssel verwendet werden"

# ER_TOO_MANY_ROWS 42000
source: "Result consisted of more than one row"
ger: "Ergebnis besteht aus mehr als einer Zeile"

# ER_REQUIRES_PRIMARY_KEY 42000
source: "This table type requires a primary key"
ger: "Dieser Tabellentyp benötigt einen Primärschlüssel (PRIMARY KEY)"

# ER_NO_RAID_COMPILED
source: "This version of MariaDB is not compiled with RAID support"
ger: "Diese MariaDB-Version ist nicht mit RAID-Unterstützung kompiliert"

# ER_UPDATE_WITHOUT_KEY_IN_SAFE_MODE
source: "You are using safe update mode and you tried to update a table without a WHERE that uses a KEY column"
ger: "MariaDB läuft im sicheren Aktualisierungsmodus (safe update mode). Sie haben versucht, eine Tabelle zu aktualisieren, ohne in der WHERE-Klausel ein KEY-Feld anzugeben"

# ER_KEY_DOES_NOT_EXISTS 42000 S1009
source: "Key '%-.192s' doesn't exist in table '%-.192s'"
ger: "Schlüssel '%-.192s' existiert in der Tabelle '%-.192s' nicht"

# ER_CHECK_NO_SUCH_TABLE 42000
source: "Can't open table"
ger: "Kann Tabelle nicht öffnen"

# ER_CHECK_NOT_IMPLEMENTED 42000
source: "The storage engine for the table doesn't support %s"
ger: "Die Speicher-Engine für diese Tabelle unterstützt kein %s"

# ER_CANT_DO_THIS_DURING_AN_TRANSACTION 25000
source: "You are not allowed to execute this command in a transaction"
ger: "Sie dürfen diesen Befehl nicht in einer Transaktion ausführen"

# ER_ERROR_DURING_COMMIT
source: "Got error %M during COMMIT"
ger: "Fehler %M beim COMMIT"

# ER_ERROR_DURING_ROLLBACK
source: "Got error %M during ROLLBACK"
ger: "Fehler %M beim ROLLBACK"

# ER_ERROR_DURING_FLUSH_LOGS
source: "Got error %M during FLUSH_LOGS"
ger: "Fehler %M bei FLUSH_LOGS"

# ER_ERROR_DURING_CHECKPOINT
source: "Got error %M during CHECKPOINT"
ger: "Fehler %M bei CHECKPOINT"

# ER_NEW_ABORTING_CONNECTION 08S01
source: "Aborted connection %lld to db: '%-.192s' user: '%-.48s' host: '%-.64s' (%-.64s)"
ger: "Abbruch der Verbindung %lld zur Datenbank '%-.192s'. Benutzer: '%-.48s', Host: '%-.64s' (%-.64s)"

# ER_FLUSH_MASTER_BINLOG_CLOSED
source: "Binlog closed, cannot RESET MASTER"
ger: "Binlog geschlossen. Kann RESET MASTER nicht ausführen"

# ER_INDEX_REBUILD
source: "Failed rebuilding the index of dumped table '%-.192s'"
ger: "Neuerstellung des Index der Dump-Tabelle '%-.192s' fehlgeschlagen"

# ER_MASTER
source: "Error from master: '%-.64s'"
ger: "Fehler vom Master: '%-.64s'"

# ER_MASTER_NET_READ 08S01
source: "Net error reading from master"
ger: "Netzfehler beim Lesen vom Master"

# ER_MASTER_NET_WRITE 08S01
source: "Net error writing to master"
ger: "Netzfehler beim Schreiben zum Master"

# ER_FT_MATCHING_KEY_NOT_FOUND
source: "Can't find FULLTEXT index matching the column list"
ger: "Kann keinen FULLTEXT-Index finden, der der Feldliste entspricht"

# ER_LOCK_OR_ACTIVE_TRANSACTION
source: "Can't execute the given command because you have active locked tables or an active transaction"
ger: "Kann den angegebenen Befehl wegen einer aktiven Tabellensperre oder einer aktiven Transaktion nicht ausführen"

# ER_UNKNOWN_SYSTEM_VARIABLE
source: "Unknown system variable '%-.*s'"
ger: "Unbekannte Systemvariable '%-.*s'"

# ER_CRASHED_ON_USAGE
source: "Table '%-.192s' is marked as crashed and should be repaired"
ger: "Tabelle '%-.192s' ist als defekt markiert und sollte repariert werden"

# ER_CRASHED_ON_REPAIR
source: "Table '%-.192s' is marked as crashed and last (automatic?) repair failed"
ger: "Tabelle '%-.192s' ist als defekt markiert und der letzte (automatische?) Reparaturversuch schlug fehl"

# ER_WARNING_NOT_COMPLETE_ROLLBACK
source: "Some non-transactional changed tables couldn't be rolled back"
ger: "Änderungen an einigen nicht transaktionalen Tabellen konnten nicht zurückgerollt werden"

# ER_TRANS_CACHE_FULL
source: "Multi-statement transaction required more than 'max_binlog_cache_size' bytes of storage; increase this mariadbd variable and try again"
ger: "Transaktionen, die aus mehreren Befehlen bestehen, benötigten mehr als 'max_binlog_cache_size' Bytes an Speicher. Btte vergrössern Sie diese Server-Variable versuchen Sie es noch einmal"

# ER_SLAVE_MUST_STOP
source: "This operation cannot be performed as you have a running slave '%2$*1$s'; run STOP SLAVE '%2$*1$s' first"
ger: "Diese Operation kann bei einem aktiven Slave '%2$*1$s' nicht durchgeführt werden. Bitte zuerst STOP SLAVE '%2$*1$s' ausführen"

# ER_SLAVE_NOT_RUNNING
source: "This operation requires a running slave; configure slave and do START SLAVE"
ger: "Diese Operation benötigt einen aktiven Slave. Bitte Slave konfigurieren und mittels START SLAVE aktivieren"

# ER_BAD_SLAVE
source: "The server is not configured as slave; fix in config file or with CHANGE MASTER TO"
ger: "Der Server ist nicht als Slave konfiguriert. Bitte in der Konfigurationsdatei oder mittels CHANGE MASTER TO beheben"

# ER_MASTER_INFO
source: "Could not initialize master info structure for '%.*s'; more error messages can be found in the MariaDB error log"
ger: "Konnte Master-Info-Struktur '%.*s' nicht initialisieren. Weitere Fehlermeldungen können im MariaDB-Error-Log eingesehen werden"

# ER_SLAVE_THREAD
source: "Could not create slave thread; check system resources"
ger: "Konnte Slave-Thread nicht starten. Bitte System-Ressourcen überprüfen"

# ER_TOO_MANY_USER_CONNECTIONS 42000
source: "User %-.64s already has more than 'max_user_connections' active connections"
ger: "Benutzer '%-.64s' hat mehr als 'max_user_connections' aktive Verbindungen"

# ER_SET_CONSTANTS_ONLY
source: "You may only use constant expressions in this statement"
ger: "Bei diesem Befehl dürfen nur konstante Ausdrücke verwendet werden"

# ER_LOCK_WAIT_TIMEOUT
source: "Lock wait timeout exceeded; try restarting transaction"
ger: "Beim Warten auf eine Sperre wurde die zulässige Wartezeit überschritten. Bitte versuchen Sie, die Transaktion neu zu starten"

# ER_LOCK_TABLE_FULL
source: "The total number of locks exceeds the lock table size"
ger: "Die Gesamtzahl der Sperren überschreitet die Größe der Sperrtabelle"

# ER_READ_ONLY_TRANSACTION 25000
source: "Update locks cannot be acquired during a READ UNCOMMITTED transaction"
ger: "Während einer READ-UNCOMMITTED-Transaktion können keine UPDATE-Sperren angefordert werden"

# ER_DROP_DB_WITH_READ_LOCK
source: "DROP DATABASE not allowed while thread is holding global read lock"
ger: "DROP DATABASE ist nicht erlaubt, solange der Thread eine globale Lesesperre hält"

# ER_CREATE_DB_WITH_READ_LOCK
source: "CREATE DATABASE not allowed while thread is holding global read lock"
ger: "CREATE DATABASE ist nicht erlaubt, solange der Thread eine globale Lesesperre hält"

# ER_WRONG_ARGUMENTS
source: "Incorrect arguments to %s"
ger: "Falsche Argumente für %s"

# ER_NO_PERMISSION_TO_CREATE_USER 42000
source: "'%s'@'%s' is not allowed to create new users"
ger: "'%s'@'%s' ist nicht berechtigt, neue Benutzer hinzuzufügen"

# ER_UNION_TABLES_IN_DIFFERENT_DIR
source: "Incorrect table definition; all MERGE tables must be in the same database"
ger: "Falsche Tabellendefinition. Alle MERGE-Tabellen müssen sich in derselben Datenbank befinden"

# ER_LOCK_DEADLOCK 40001
source: "Deadlock found when trying to get lock; try restarting transaction"
ger: "Beim Versuch, eine Sperre anzufordern, ist ein Deadlock aufgetreten. Versuchen Sie, die Transaktion neu zu starten"

# ER_TABLE_CANT_HANDLE_FT
source: "The storage engine %s doesn't support FULLTEXT indexes"
ger: "Der verwendete Tabellentyp (%s) unterstützt keine FULLTEXT-Indizes"

# ER_CANNOT_ADD_FOREIGN
source: "Cannot add foreign key constraint for `%s`"
ger: "Fremdschlüssel-Beschränkung kann nicht hinzugefügt werden für `%s`"

# ER_NO_REFERENCED_ROW 23000
source: "Cannot add or update a child row: a foreign key constraint fails"
ger: "Hinzufügen oder Aktualisieren eines Kind-Datensatzes schlug aufgrund einer Fremdschlüssel-Beschränkung fehl"

# ER_ROW_IS_REFERENCED 23000
source: "Cannot delete or update a parent row: a foreign key constraint fails"
ger: "Löschen oder Aktualisieren eines Eltern-Datensatzes schlug aufgrund einer Fremdschlüssel-Beschränkung fehl"

# ER_CONNECT_TO_MASTER 08S01
source: "Error connecting to master: %-.128s"
ger: "Fehler bei der Verbindung zum Master: %-.128s"

# ER_QUERY_ON_MASTER
source: "Error running query on master: %-.128s"
ger: "Beim Ausführen einer Abfrage auf dem Master trat ein Fehler auf: %-.128s"

# ER_ERROR_WHEN_EXECUTING_COMMAND
source: "Error when executing command %s: %-.128s"
ger: "Fehler beim Ausführen des Befehls %s: %-.128s"

# ER_WRONG_USAGE
source: "Incorrect usage of %s and %s"
ger: "Falsche Verwendung von %s und %s"

# ER_WRONG_NUMBER_OF_COLUMNS_IN_SELECT 21000
source: "The used SELECT statements have a different number of columns"
ger: "Die verwendeten SELECT-Befehle liefern unterschiedliche Anzahlen von Feldern zurück"

# ER_CANT_UPDATE_WITH_READLOCK
source: "Can't execute the query because you have a conflicting read lock"
ger: "Augrund eines READ-LOCK-Konflikts kann die Abfrage nicht ausgeführt werden"

# ER_MIXING_NOT_ALLOWED
source: "Mixing of transactional and non-transactional tables is disabled"
ger: "Die gleichzeitige Verwendung von Tabellen mit und ohne Transaktionsunterstützung ist deaktiviert"

# ER_DUP_ARGUMENT
source: "Option '%s' used twice in statement"
ger: "Option '%s' wird im Befehl zweimal verwendet"

# ER_USER_LIMIT_REACHED 42000
source: "User '%-.64s' has exceeded the '%s' resource (current value: %ld)"
ger: "Benutzer '%-.64s' hat die Ressourcenbeschränkung '%s' überschritten (aktueller Wert: %ld)"

# ER_SPECIFIC_ACCESS_DENIED_ERROR 42000
source: "Access denied; you need (at least one of) the %-.128s privilege(s) for this operation"
ger: "Kein Zugriff. Hierfür wird die Berechtigung %-.128s benötigt"

# ER_LOCAL_VARIABLE
source: "Variable '%-.64s' is a SESSION variable and can't be used with SET GLOBAL"
ger: "Variable '%-.64s' ist eine lokale Variable und kann nicht mit SET GLOBAL verändert werden"

# ER_GLOBAL_VARIABLE
source: "Variable '%-.64s' is a GLOBAL variable and should be set with SET GLOBAL"
ger: "Variable '%-.64s' ist eine globale Variable und muss mit SET GLOBAL verändert werden"

# ER_NO_DEFAULT 42000
source: "Variable '%-.64s' doesn't have a default value"
ger: "Variable '%-.64s' hat keinen Vorgabewert"

# ER_WRONG_VALUE_FOR_VAR 42000
source: "Variable '%-.64s' can't be set to the value of '%-.200T'"
ger: "Variable '%-.64s' kann nicht auf '%-.200T' gesetzt werden"

# ER_WRONG_TYPE_FOR_VAR 42000
source: "Incorrect argument type to variable '%-.64s'"
ger: "Falscher Argumenttyp für Variable '%-.64s'"

# ER_VAR_CANT_BE_READ
source: "Variable '%-.64s' can only be set, not read"
ger: "Variable '%-.64s' kann nur verändert, nicht gelesen werden"

# ER_CANT_USE_OPTION_HERE 42000
source: "Incorrect usage/placement of '%s'"
ger: "Falsche Verwendung oder Platzierung von '%s'"

# ER_NOT_SUPPORTED_YET 42000
source: "This version of MariaDB doesn't yet support '%s'"
ger: "Diese MariaDB-Version unterstützt '%s' nicht"

# ER_MASTER_FATAL_ERROR_READING_BINLOG
source: "Got fatal error %d from master when reading data from binary log: '%-.320s'"
ger: "Schwerer Fehler %d: '%-.320s vom Master beim Lesen des binären Logs"

# ER_SLAVE_IGNORED_TABLE
source: "Slave SQL thread ignored the query because of replicate-*-table rules"
ger: "Slave-SQL-Thread hat die Abfrage aufgrund von replicate-*-table-Regeln ignoriert"

# ER_INCORRECT_GLOBAL_LOCAL_VAR
source: "Variable '%-.192s' is a %s variable"
ger: "Variable '%-.192s' ist eine %s-Variable"

# ER_WRONG_FK_DEF 42000
source: "Incorrect foreign key definition for '%-.192s': %s"
ger: "Falsche Fremdschlüssel-Definition für '%-.192s': %s"

# ER_KEY_REF_DO_NOT_MATCH_TABLE_REF
source: "Key reference and table reference don't match"
ger: "Schlüssel- und Tabellenverweis passen nicht zusammen"

# ER_OPERAND_COLUMNS 21000
source: "Operand should contain %d column(s)"
ger: "Operand sollte %d Spalte(n) enthalten"

# ER_SUBQUERY_NO_1_ROW 21000
source: "Subquery returns more than 1 row"
ger: "Unterabfrage lieferte mehr als einen Datensatz zurück"

# ER_UNKNOWN_STMT_HANDLER
source: "Unknown prepared statement handler (%.*s) given to %s"
ger: "Unbekannter Prepared-Statement-Handler (%.*s) für %s angegeben"

# ER_CORRUPT_HELP_DB
source: "Help database is corrupt or does not exist"
ger: "Die Hilfe-Datenbank ist beschädigt oder existiert nicht"

# ER_CYCLIC_REFERENCE
source: "Cyclic reference on subqueries"
ger: "Zyklischer Verweis in Unterabfragen"

# ER_AUTO_CONVERT
source: "Converting column '%s' from %s to %s"
ger: "Feld '%s' wird von %s nach %s umgewandelt"

# ER_ILLEGAL_REFERENCE 42S22
source: "Reference '%-.64s' not supported (%s)"
ger: "Verweis '%-.64s' wird nicht unterstützt (%s)"

# ER_DERIVED_MUST_HAVE_ALIAS 42000
source: "Every derived table must have its own alias"
ger: "Für jede abgeleitete Tabelle muss ein eigener Alias angegeben werden"

# ER_SELECT_REDUCED 01000
source: "Select %u was reduced during optimization"
ger: "Select %u wurde während der Optimierung reduziert"

# ER_TABLENAME_NOT_ALLOWED_HERE 42000
source: "Table '%-.192s' from one of the SELECTs cannot be used in %-.32s"
ger: "Tabelle '%-.192s', die in einem der SELECT-Befehle verwendet wurde, kann nicht in %-.32s verwendet werden"

# ER_NOT_SUPPORTED_AUTH_MODE 08004
source: "Client does not support authentication protocol requested by server; consider upgrading MariaDB client"
ger: "Client unterstützt das vom Server erwartete Authentifizierungsprotokoll nicht. Bitte aktualisieren Sie Ihren MariaDB-Client"

# ER_SPATIAL_CANT_HAVE_NULL 42000
source: "All parts of a SPATIAL index must be NOT NULL"
ger: "Alle Teile eines SPATIAL-Index müssen als NOT NULL deklariert sein"

# ER_COLLATION_CHARSET_MISMATCH 42000
source: "COLLATION '%s' is not valid for CHARACTER SET '%s'"
ger: "COLLATION '%s' ist für CHARACTER SET '%s' ungültig"

# ER_SLAVE_WAS_RUNNING
source: "Slave is already running"
ger: "Slave läuft bereits"

# ER_SLAVE_WAS_NOT_RUNNING
source: "Slave already has been stopped"
ger: "Slave wurde bereits angehalten"

# ER_TOO_BIG_FOR_UNCOMPRESS
source: "Uncompressed data size too large; the maximum size is %d (probably, length of uncompressed data was corrupted)"
ger: "Unkomprimierte Daten sind zu groß. Die maximale Größe beträgt %d (wahrscheinlich wurde die Länge der unkomprimierten Daten beschädigt)"

# ER_ZLIB_Z_MEM_ERROR
source: "ZLIB: Not enough memory"
ger: "ZLIB: Nicht genug Speicher"

# ER_ZLIB_Z_BUF_ERROR
source: "ZLIB: Not enough room in the output buffer (probably, length of uncompressed data was corrupted)"
ger: "ZLIB: Im Ausgabepuffer ist nicht genug Platz vorhanden (wahrscheinlich wurde die Länge der unkomprimierten Daten beschädigt)"

# ER_ZLIB_Z_DATA_ERROR
source: "ZLIB: Input data corrupted"
ger: "ZLIB: Eingabedaten beschädigt"

# ER_WARN_TOO_FEW_RECORDS 01000
source: "Row %lu doesn't contain data for all columns"
ger: "Zeile %lu enthält nicht für alle Felder Daten"

# ER_WARN_TOO_MANY_RECORDS 01000
source: "Row %lu was truncated; it contained more data than there were input columns"
ger: "Zeile %lu gekürzt, die Zeile enthielt mehr Daten, als es Eingabefelder gibt"

# ER_WARN_NULL_TO_NOTNULL 22004
source: "Column set to default value; NULL supplied to NOT NULL column '%s' at row %lu"
ger: "Feld auf Vorgabewert gesetzt, da NULL für NOT-NULL-Feld '%s' in Zeile %lu angegeben"

# WARN_DATA_TRUNCATED 01000
source: "Data truncated for column '%s' at row %lu"
ger: "Daten abgeschnitten für Feld '%s' in Zeile %lu"

# ER_WARN_USING_OTHER_HANDLER
source: "Using storage engine %s for table '%s'"
ger: "Speicher-Engine %s wird für Tabelle '%s' benutzt"

# ER_CANT_AGGREGATE_2COLLATIONS
source: "Illegal mix of collations (%s,%s) and (%s,%s) for operation '%s'"
ger: "Unerlaubte Mischung von Sortierreihenfolgen (%s, %s) und (%s, %s) für Operation '%s'"

# ER_DROP_USER
source: "Cannot drop one or more of the requested users"
ger: "Kann einen oder mehrere der angegebenen Benutzer nicht löschen"

# ER_REVOKE_GRANTS
source: "Can't revoke all privileges for one or more of the requested users"
ger: "Kann nicht alle Berechtigungen widerrufen, die für einen oder mehrere Benutzer gewährt wurden"

# ER_CANT_AGGREGATE_3COLLATIONS
source: "Illegal mix of collations (%s,%s), (%s,%s), (%s,%s) for operation '%s'"
ger: "Unerlaubte Mischung von Sortierreihenfolgen (%s, %s), (%s, %s), (%s, %s) für Operation '%s'"

# ER_CANT_AGGREGATE_NCOLLATIONS
source: "Illegal mix of collations for operation '%s'"
ger: "Unerlaubte Mischung von Sortierreihenfolgen für Operation '%s'"

# ER_VARIABLE_IS_NOT_STRUCT
source: "Variable '%-.64s' is not a variable component (can't be used as XXXX.variable_name)"
ger: "Variable '%-.64s' ist keine Variablen-Komponente (kann nicht als XXXX.variablen_name verwendet werden)"

# ER_UNKNOWN_COLLATION
source: "Unknown collation: '%-.64s'"
ger: "Unbekannte Sortierreihenfolge: '%-.64s'"

# ER_SLAVE_IGNORED_SSL_PARAMS
source: "SSL parameters in CHANGE MASTER are ignored because this MariaDB slave was compiled without SSL support; they can be used later if MariaDB slave with SSL is started"
ger: "SSL-Parameter in CHANGE MASTER werden ignoriert, weil dieser MariaDB-Slave ohne SSL-Unterstützung kompiliert wurde. Sie können aber später verwendet werden, wenn ein MariaDB-Slave mit SSL gestartet wird"

# ER_SERVER_IS_IN_SECURE_AUTH_MODE
source: "Server is running in --secure-auth mode, but '%s'@'%s' has a password in the old format; please change the password to the new format"
ger: "Server läuft im Modus --secure-auth, aber '%s'@'%s' hat ein Passwort im alten Format. Bitte Passwort ins neue Format ändern"

# ER_WARN_FIELD_RESOLVED
source: "Field or reference '%-.192s%s%-.192s%s%-.192s' of SELECT #%d was resolved in SELECT #%d"
ger: "Feld oder Verweis '%-.192s%s%-.192s%s%-.192s' im SELECT-Befehl Nr. %d wurde im SELECT-Befehl Nr. %d aufgelöst"

# ER_BAD_SLAVE_UNTIL_COND
source: "Incorrect parameter or combination of parameters for START SLAVE UNTIL"
ger: "Falscher Parameter oder falsche Kombination von Parametern für START SLAVE UNTIL"

# ER_MISSING_SKIP_SLAVE
source: "It is recommended to use --skip-slave-start when doing step-by-step replication with START SLAVE UNTIL; otherwise, you will get problems if you get an unexpected slave's mariadbd restart"
ger: "Es wird empfohlen, mit --skip-slave-start zu starten, wenn mit START SLAVE UNTIL eine Schritt-für-Schritt-Replikation ausgeführt wird. Ansonsten gibt es Probleme, wenn ein Slave-Server unerwartet neu startet"

# ER_UNTIL_COND_IGNORED
source: "SQL thread is not to be started so UNTIL options are ignored"
ger: "SQL-Thread soll nicht gestartet werden. Daher werden UNTIL-Optionen ignoriert"

# ER_WRONG_NAME_FOR_INDEX 42000
source: "Incorrect index name '%-.100s'"
ger: "Falscher Indexname '%-.100s'"

# ER_WRONG_NAME_FOR_CATALOG 42000
source: "Incorrect catalog name '%-.100s'"
ger: "Falscher Katalogname '%-.100s'"

# ER_WARN_QC_RESIZE
source: "Query cache failed to set size %llu; new query cache size is %lu"
ger: "Änderung der Query-Cache-Größe auf %llu fehlgeschlagen; neue Query-Cache-Größe ist %lu"

# ER_BAD_FT_COLUMN
source: "Column '%-.192s' cannot be part of FULLTEXT index"
ger: "Feld '%-.192s' kann nicht Teil eines FULLTEXT-Index sein"

# ER_UNKNOWN_KEY_CACHE
source: "Unknown key cache '%-.100s'"
ger: "Unbekannter Schlüssel-Cache '%-.100s'"

# ER_WARN_HOSTNAME_WONT_WORK
source: "MariaDB is started in --skip-name-resolve mode; you must restart it without this switch for this grant to work"
ger: "MariaDB wurde mit --skip-name-resolve gestartet. Diese Option darf nicht verwendet werden, damit diese Rechtevergabe möglich ist"

# ER_UNKNOWN_STORAGE_ENGINE 42000
source: "Unknown storage engine '%s'"
ger: "Unbekannte Speicher-Engine '%s'"

# ER_WARN_DEPRECATED_SYNTAX
source: "'%s' is deprecated and will be removed in a future release. Please use %s instead"
ger: "'%s' ist veraltet. Bitte benutzen Sie '%s'"

# ER_NON_UPDATABLE_TABLE
source: "The target table %-.100s of the %s is not updatable"
ger: "Die Zieltabelle %-.100s von %s ist nicht aktualisierbar"

# ER_FEATURE_DISABLED
source: "The '%s' feature is disabled; you need MariaDB built with '%s' to have it working"
ger: "Das Feature '%s' ist ausgeschaltet, Sie müssen MariaDB mit '%s' übersetzen, damit es verfügbar ist"

# ER_OPTION_PREVENTS_STATEMENT
source: "The MariaDB server is running with the %s option so it cannot execute this statement"
ger: "Der MariaDB-Server läuft mit der Option %s und kann diese Anweisung deswegen nicht ausführen"

# ER_DUPLICATED_VALUE_IN_TYPE
source: "Column '%-.100s' has duplicated value '%-.64s' in %s"
ger: "Feld '%-.100s' hat doppelten Wert '%-.64s' in %s"

# ER_TRUNCATED_WRONG_VALUE 22007
source: "Truncated incorrect %-.32T value: '%-.128T'"
ger: "Falscher %-.32T-Wert gekürzt: '%-.128T'"

# ER_TOO_MUCH_AUTO_TIMESTAMP_COLS
source: "Incorrect table definition; there can be only one TIMESTAMP column with CURRENT_TIMESTAMP in DEFAULT or ON UPDATE clause"
ger: "Fehlerhafte Tabellendefinition. Es kann nur eine einzige TIMESTAMP-Spalte mit CURRENT_TIMESTAMP als DEFAULT oder in einer ON-UPDATE-Klausel geben"

# ER_INVALID_ON_UPDATE
source: "Invalid ON UPDATE clause for '%-.192s' column"
ger: "Ungültige ON-UPDATE-Klausel für Spalte '%-.192s'"

# ER_UNSUPPORTED_PS
source: "This command is not supported in the prepared statement protocol yet"
ger: "Dieser Befehl wird im Protokoll für vorbereitete Anweisungen noch nicht unterstützt"

# ER_GET_ERRMSG
source: "Got error %d '%-.200s' from %s"
ger: "Fehler %d '%-.200s' von %s"

# ER_GET_TEMPORARY_ERRMSG
source: "Got temporary error %d '%-.200s' from %s"
ger: "Temporärer Fehler %d '%-.200s' von %s"

# ER_UNKNOWN_TIME_ZONE
source: "Unknown or incorrect time zone: '%-.64s'"
ger: "Unbekannte oder falsche Zeitzone: '%-.64s'"

# ER_WARN_INVALID_TIMESTAMP
source: "Invalid TIMESTAMP value in column '%s' at row %lu"
ger: "Ungültiger TIMESTAMP-Wert in Feld '%s', Zeile %lu"

# ER_INVALID_CHARACTER_STRING
source: "Invalid %s character string: '%.64T'"
ger: "Ungültiger %s-Zeichen-String: '%.64T'"

# ER_WARN_ALLOWED_PACKET_OVERFLOWED
source: "Result of %s() was larger than max_allowed_packet (%ld) - truncated"
ger: "Ergebnis von %s() war größer als max_allowed_packet (%ld) Bytes und wurde deshalb gekürzt"
