Repository: vladbogo/test-translation
Catalog: ger.xlf
Languages: ger

# ER_NO_SUCH_USER
source: "The user specified as a definer ('%-.64s'@'%-.64s') does not exist"
ger: "Der als Definierer angegebene Benutzer ('%-.64s'@'%-.64s') existiert nicht"

# ER_FORBID_SCHEMA_CHANGE
source: "Changing schema from '%-.192s' to '%-.192s' is not allowed"
ger: "Wechsel des Schemas von '%-.192s' auf '%-.192s' ist nicht erlaubt"

# ER_ROW_IS_REFERENCED_2 23000
source: "Cannot delete or update a parent row: a foreign key constraint fails (%.192s)"
ger: "Kann Eltern-Zeile nicht löschen oder aktualisieren: eine Fremdschlüsselbedingung schlägt fehl (%.192s)"

# ER_NO_REFERENCED_ROW_2 23000
source: "Cannot add or update a child row: a foreign key constraint fails (%.192s)"
ger: "Kann Kind-Zeile nicht hinzufügen oder aktualisieren: eine Fremdschlüsselbedingung schlägt fehl (%.192s)"

# ER_SP_BAD_VAR_SHADOW 42000
source: "Variable '%-.64s' must be quoted with `...`, or renamed"
ger: "Variable '%-.64s' muss mit `...` geschützt oder aber umbenannt werden"

# ER_TRG_NO_DEFINER
source: "No definer attribute for trigger '%-.192s'.'%-.192s'. The trigger will be activated under the authorization of the invoker, which may have insufficient privileges. Please recreate the trigger"
ger: "Kein Definierer-Attribut für Trigger '%-.192s'.'%-.192s'. Der Trigger wird mit der Autorisierung des Aufrufers aktiviert, der möglicherweise keine zureichenden Berechtigungen hat. Bitte legen Sie den Trigger neu an"

# ER_OLD_FILE_FORMAT
source: "'%-.192s' has an old format, you should re-create the '%s' object(s)"
ger: "'%-.192s' hat altes Format, Sie sollten die '%s'-Objekt(e) neu erzeugen"

# ER_SP_RECURSION_LIMIT
source: "Recursive limit %d (as set by the max_sp_recursion_depth variable) was exceeded for routine %.192s"
ger: "Rekursionsgrenze %d (durch Variable max_sp_recursion_depth gegeben) wurde für Routine %.192s überschritten"

# ER_SP_PROC_TABLE_CORRUPT
source: "Failed to load routine %-.192s (internal code %d). For more details, run SHOW WARNINGS"
ger: "Routine %-.192s (interner Code %d) konnte nicht geladen werden. Weitere Einzelheiten erhalten Sie, wenn Sie SHOW WARNINGS ausführen"

# ER_SP_WRONG_NAME 42000
source: "Incorrect routine name '%-.192s'"
ger: "Ungültiger Routinenname '%-.192s'"

# ER_TABLE_NEEDS_UPGRADE
source: "Upgrade required. Please do \"REPAIR %s %`s\" or dump/reload to fix it!"
ger: "Aktualisierung erforderlich. Bitte zum Reparieren \"REPAIR %s %`s\" eingeben!"

# ER_SP_NO_AGGREGATE 42000
source: "AGGREGATE is not supported for stored functions"
ger: "AGGREGATE wird bei gespeicherten Funktionen nicht unterstützt"

# ER_MAX_PREPARED_STMT_COUNT_REACHED 42000
source: "Can't create more than max_prepared_stmt_count statements (current value: %u)"
ger: "Kann nicht mehr Anweisungen als max_prepared_stmt_count erzeugen (aktueller Wert: %u)"

# ER_VIEW_RECURSIVE
source: "%`s.%`s contains view recursion"
ger: "%`s.%`s enthält View-Rekursion"

# ER_NON_GROUPING_FIELD_USED 42000
source: "Non-grouping field '%-.192s' is used in %-.64s clause"
ger: "In der %-.192s-Klausel wird das die Nicht-Gruppierungsspalte '%-.64s' verwendet"

# ER_TABLE_CANT_HANDLE_SPKEYS
source: "The storage engine %s doesn't support SPATIAL indexes"
ger: "Der verwendete Tabellentyp (%s) unterstützt keine SPATIAL-Indizes"

# ER_NO_TRIGGERS_ON_SYSTEM_SCHEMA
source: "Triggers can not be created on system tables"
ger: "Trigger können nicht auf Systemtabellen erzeugt werden"

# ER_REMOVED_SPACES
source: "Leading spaces are removed from name '%s'"
ger: "Führende Leerzeichen werden aus dem Namen '%s' entfernt"

# ER_AUTOINC_READ_FAILED
source: "Failed to read auto-increment value from storage engine"
ger: "Lesen des Autoincrement-Werts von der Speicher-Engine fehlgeschlagen"

# ER_USERNAME
source: "user name"
ger: "Benutzername"

# ER_WRONG_STRING_LENGTH
source: "String '%-.70T' is too long for %s (should be no longer than %d)"
ger: "String '%-.70T' ist zu lang für %s (sollte nicht länger sein als %d)"

# ER_NON_INSERTABLE_TABLE
source: "The target table %-.100s of the %s is not insertable-into"
ger: "Die Zieltabelle %-.100s von %s ist nicht einfügbar"

# ER_ADMIN_WRONG_MRG_TABLE
source: "Table '%-.64s' is differently defined or of non-MyISAM type or doesn't exist"
ger: "Tabelle '%-.64s' ist unterschiedlich definiert, nicht vom Typ MyISAM oder existiert nicht"

# ER_TOO_HIGH_LEVEL_OF_NESTING_FOR_SELECT
source: "Too high level of nesting for select"
ger: "Zu tief verschachtelte SELECT-Anweisungen"

# ER_NAME_BECOMES_EMPTY
source: "Name '%-.64s' has become ''"
ger: "Name '%-.64s' wurde zu ''"

# ER_AMBIGUOUS_FIELD_TERM
source: "First character of the FIELDS TERMINATED string is ambiguous; please use non-optional and non-empty FIELDS ENCLOSED BY"
ger: "Das erste Zeichen der Zeichenkette FIELDS TERMINATED ist mehrdeutig; bitte benutzen Sie nicht optionale und nicht leere FIELDS ENCLOSED BY"

# ER_FOREIGN_SERVER_EXISTS
source: "The foreign server, %s, you are trying to create already exists"
ger: "Der entfernte Server %s, den Sie versuchen zu erzeugen, existiert schon"

# ER_FOREIGN_SERVER_DOESNT_EXIST
source: "The foreign server name you are trying to reference does not exist. Data source error: %-.64s"
ger: "Die externe Verbindung, auf die Sie zugreifen wollen, existiert nicht. Datenquellenfehlermeldung: %-.64s"

# ER_ILLEGAL_HA_CREATE_OPTION
source: "Table storage engine '%-.64s' does not support the create option '%.64s'"
ger: "Speicher-Engine '%-.64s' der Tabelle unterstützt die Option '%.64s' nicht"

# ER_PARTITION_REQUIRES_VALUES_ERROR
source: "Syntax error: %-.64s PARTITIONING requires definition of VALUES %-.64s for each partition"
ger: "Fehler in der SQL-Syntax: %-.64s-PARTITIONierung erfordert Definition von VALUES %-.64s für jede Partition"

# ER_PARTITION_WRONG_VALUES_ERROR
source: "Only %-.64s PARTITIONING can use VALUES %-.64s in partition definition"
ger: "Nur %-.64s-PARTITIONierung kann VALUES %-.64s in der Partitionsdefinition verwenden"

# ER_PARTITION_MAXVALUE_ERROR
source: "MAXVALUE can only be used in last partition definition"
ger: "MAXVALUE kann nur für die Definition der letzten Partition verwendet werden"

# ER_PARTITION_SUBPARTITION_ERROR
source: "Subpartitions can only be hash partitions and by key"
ger: "Unterpartitionen dürfen nur HASH- oder KEY-Partitionen sein"

# ER_PARTITION_SUBPART_MIX_ERROR
source: "Must define subpartitions on all partitions if on one partition"
ger: "Wenn Sie Unterpartitionen auf einer Partition definieren, müssen Sie das für alle Partitionen tun"

# ER_PARTITION_WRONG_NO_PART_ERROR
source: "Wrong number of partitions defined, mismatch with previous setting"
ger: "Falsche Anzahl von Partitionen definiert, stimmt nicht mit vorherigen Einstellungen überein"

# ER_PARTITION_WRONG_NO_SUBPART_ERROR
source: "Wrong number of subpartitions defined, mismatch with previous setting"
ger: "Falsche Anzahl von Unterpartitionen definiert, stimmt nicht mit vorherigen Einstellungen überein"

# ER_WRONG_EXPR_IN_PARTITION_FUNC_ERROR
source: "Constant, random or timezone-dependent expressions in (sub)partitioning function are not allowed"
ger: "Konstante oder Random-Ausdrücke in (Unter-)Partitionsfunktionen sind nicht erlaubt"

# ER_NOT_CONSTANT_EXPRESSION
source: "Expression in %s must be constant"
ger: "Ausdrücke in %s müssen konstant sein"

# ER_FIELD_NOT_FOUND_PART_ERROR
source: "Field in list of fields for partition function not found in table"
ger: "Felder in der Feldliste der Partitionierungsfunktion wurden in der Tabelle nicht gefunden"

# ER_LIST_OF_FIELDS_ONLY_IN_HASH_ERROR
source: "List of fields is only allowed in KEY partitions"
ger: "Eine Feldliste ist nur in KEY-Partitionen erlaubt"

# ER_INCONSISTENT_PARTITION_INFO_ERROR
source: "The partition info in the frm file is not consistent with what can be written into the frm file"
ger: "Die Partitionierungsinformationen in der frm-Datei stimmen nicht mit dem überein, was in die frm-Datei geschrieben werden kann"

# ER_PARTITION_FUNC_NOT_ALLOWED_ERROR
source: "The %-.192s function returns the wrong type"
ger: "Die %-.192s-Funktion gibt einen falschen Typ zurück"

# ER_PARTITIONS_MUST_BE_DEFINED_ERROR
source: "For %-.64s partitions each partition must be defined"
ger: "Für %-.64s-Partitionen muss jede Partition definiert sein"

# ER_RANGE_NOT_INCREASING_ERROR
source: "VALUES LESS THAN value must be strictly increasing for each partition"
ger: "Werte in VALUES LESS THAN müssen für jede Partition strikt aufsteigend sein"

# ER_INCONSISTENT_TYPE_OF_FUNCTIONS_ERROR
source: "VALUES value must be of same type as partition function"
ger: "VALUES-Werte müssen vom selben Typ wie die Partitionierungsfunktion sein"

# ER_MULTIPLE_DEF_CONST_IN_LIST_PART_ERROR
source: "Multiple definition of same constant in list partitioning"
ger: "Mehrfachdefinition derselben Konstante bei Listen-Partitionierung"

# ER_PARTITION_ENTRY_ERROR
source: "Partitioning can not be used stand-alone in query"
ger: "Partitionierung kann in einer Abfrage nicht alleinstehend benutzt werden"

# ER_MIX_HANDLER_ERROR
source: "The mix of handlers in the partitions is not allowed in this version of MariaDB"
ger: "Das Vermischen von Handlern in Partitionen ist in dieser Version von MariaDB nicht erlaubt"

# ER_PARTITION_NOT_DEFINED_ERROR
source: "For the partitioned engine it is necessary to define all %-.64s"
ger: "Für die partitionierte Engine müssen alle %-.64s definiert sein"

# ER_TOO_MANY_PARTITIONS_ERROR
source: "Too many partitions (including subpartitions) were defined"
ger: "Es wurden zu vielen Partitionen (einschließlich Unterpartitionen) definiert"

# ER_SUBPARTITION_ERROR
source: "It is only possible to mix RANGE/LIST partitioning with HASH/KEY partitioning for subpartitioning"
ger: "RANGE/LIST-Partitionierung kann bei Unterpartitionen nur zusammen mit HASH/KEY-Partitionierung verwendet werden"

# ER_CANT_CREATE_HANDLER_FILE
source: "Failed to create specific handler file"
ger: "Erzeugen einer spezifischen Handler-Datei fehlgeschlagen"

# ER_BLOB_FIELD_IN_PART_FUNC_ERROR
source: "A BLOB field is not allowed in partition function"
ger: "In der Partitionierungsfunktion sind BLOB-Spalten nicht erlaubt"

# ER_NO_PARTS_ERROR
source: "Number of %-.64s = 0 is not an allowed value"
ger: "Eine Anzahl von %-.64s = 0 ist kein erlaubter Wert"

# ER_PARTITION_MGMT_ON_NONPARTITIONED
source: "Partition management on a not partitioned table is not possible"
ger: "Partitionsverwaltung einer nicht partitionierten Tabelle ist nicht möglich"

# ER_PARTITION_DOES_NOT_EXIST
source: "Wrong partition name or partition list"
ger: "Falscher Name einer Partition oder Fehler in der Partitionsliste"

# ER_DROP_LAST_PARTITION
source: "Cannot remove all partitions, use DROP TABLE instead"
ger: "Es lassen sich nicht sämtliche Partitionen löschen, benutzen Sie statt dessen DROP TABLE"

# ER_COALESCE_ONLY_ON_HASH_PARTITION
source: "COALESCE PARTITION can only be used on HASH/KEY partitions"
ger: "COALESCE PARTITION kann nur auf HASH- oder KEY-Partitionen benutzt werden"

# ER_REORG_HASH_ONLY_ON_SAME_NO
source: "REORGANIZE PARTITION can only be used to reorganize partitions not to change their numbers"
ger: "REORGANIZE PARTITION kann nur zur Reorganisation von Partitionen verwendet werden, nicht, um ihre Nummern zu ändern"

# ER_REORG_NO_PARAM_ERROR
source: "REORGANIZE PARTITION without parameters can only be used on auto-partitioned tables using HASH PARTITIONs"
ger: "REORGANIZE PARTITION ohne Parameter kann nur für auto-partitionierte Tabellen verwendet werden, die HASH-Partitionierung benutzen"

# ER_ONLY_ON_RANGE_LIST_PARTITION
source: "%-.64s PARTITION can only be used on RANGE/LIST partitions"
ger: "%-.64s PARTITION kann nur für RANGE- oder LIST-Partitionen verwendet werden"

# ER_ADD_PARTITION_SUBPART_ERROR
source: "Trying to Add partition(s) with wrong number of subpartitions"
ger: "Es wurde versucht, eine oder mehrere Partitionen mit der falschen Anzahl von Unterpartitionen hinzuzufügen"

# ER_ADD_PARTITION_NO_NEW_PARTITION
source: "At least one partition must be added"
ger: "Es muss zumindest eine Partition hinzugefügt werden"

# ER_COALESCE_PARTITION_NO_PARTITION
source: "At least one partition must be coalesced"
ger: "Zumindest eine Partition muss mit COALESCE PARTITION zusammengefügt werden"

# ER_REORG_PARTITION_NOT_EXIST
source: "More partitions to reorganize than there are partitions"
ger: "Es wurde versucht, mehr Partitionen als vorhanden zu reorganisieren"

# ER_SAME_NAME_PARTITION
source: "Duplicate partition name %-.192s"
ger: "Doppelter Partitionsname: %-.192s"

# ER_NO_BINLOG_ERROR
source: "It is not allowed to shut off binlog on this command"
ger: "Es es nicht erlaubt, bei diesem Befehl binlog abzuschalten"

# ER_CONSECUTIVE_REORG_PARTITIONS
source: "When reorganizing a set of partitions they must be in consecutive order"
ger: "Bei der Reorganisation eines Satzes von Partitionen müssen diese in geordneter Reihenfolge vorliegen"

# ER_REORG_OUTSIDE_RANGE
source: "Reorganize of range partitions cannot change total ranges except for last partition where it can extend the range"
ger: "Die Reorganisation von RANGE-Partitionen kann Gesamtbereiche nicht verändern, mit Ausnahme der letzten Partition, die den Bereich erweitern kann"

# ER_PARTITION_FUNCTION_FAILURE
source: "Partition function not supported in this version for this handler"
ger: "Partitionsfunktion in dieser Version dieses Handlers nicht unterstützt"

# ER_PART_STATE_ERROR
source: "Partition state cannot be defined from CREATE/ALTER TABLE"
ger: "Partitionszustand kann nicht von CREATE oder ALTER TABLE aus definiert werden"

# ER_LIMITED_PART_RANGE
source: "The %-.64s handler only supports 32 bit integers in VALUES"
ger: "Der Handler %-.64s unterstützt in VALUES nur 32-Bit-Integers"

# ER_PLUGIN_IS_NOT_LOADED
source: "Plugin '%-.192s' is not loaded"
ger: "Plugin '%-.192s' ist nicht geladen"

# ER_WRONG_VALUE
source: "Incorrect %-.32s value: '%-.128T'"
ger: "Falscher %-.32s-Wert: '%-.128T'"

# ER_NO_PARTITION_FOR_GIVEN_VALUE
source: "Table has no partition for value %-.64s"
ger: "Tabelle hat für den Wert %-.64s keine Partition"

# ER_FILEGROUP_OPTION_ONLY_ONCE
source: "It is not allowed to specify %s more than once"
ger: "%s darf nicht mehr als einmal angegegeben werden"

# ER_CREATE_FILEGROUP_FAILED
source: "Failed to create %s"
ger: "Anlegen von %s fehlgeschlagen"

# ER_DROP_FILEGROUP_FAILED
source: "Failed to drop %s"
ger: "Löschen von %s fehlgeschlagen"

# ER_TABLESPACE_AUTO_EXTEND_ERROR
source: "The handler doesn't support autoextend of tablespaces"
ger: "Der Handler unterstützt keine automatische Erweiterung (Autoextend) von Tablespaces"

# ER_WRONG_SIZE_NUMBER
source: "A size parameter was incorrectly specified, either number or on the form 10M"
ger: "Ein Größen-Parameter wurde unkorrekt angegeben, muss entweder Zahl sein oder im Format 10M"

# ER_SIZE_OVERFLOW_ERROR
source: "The size number was correct but we don't allow the digit part to be more than 2 billion"
ger: "Die Zahl für die Größe war korrekt, aber der Zahlanteil darf nicht größer als 2 Milliarden sein"

# ER_ALTER_FILEGROUP_FAILED
source: "Failed to alter: %s"
ger: "Änderung von %s fehlgeschlagen"

# ER_BINLOG_ROW_LOGGING_FAILED
source: "Writing one row to the row-based binary log failed"
ger: "Schreiben einer Zeilen ins zeilenbasierte Binärlog fehlgeschlagen"

# ER_BINLOG_ROW_WRONG_TABLE_DEF
source: "Table definition on master and slave does not match: %s"
ger: "Tabellendefinition auf Master und Slave stimmt nicht überein: %s"

# ER_BINLOG_ROW_RBR_TO_SBR
source: "Slave running with --log-slave-updates must use row-based binary logging to be able to replicate row-based binary log events"
ger: "Slave, die mit --log-slave-updates laufen, müssen zeilenbasiertes Loggen verwenden, um zeilenbasierte Binärlog-Ereignisse loggen zu können"

# ER_EVENT_ALREADY_EXISTS
source: "Event '%-.192s' already exists"
ger: "Event '%-.192s' existiert bereits"

# ER_EVENT_STORE_FAILED
source: "Failed to store event %s. Error code %M from storage engine"
ger: "Speichern von Event %s fehlgeschlagen. Fehlercode der Speicher-Engine: %M"

# ER_EVENT_DOES_NOT_EXIST
source: "Unknown event '%-.192s'"
ger: "Unbekanntes Event '%-.192s'"

# ER_EVENT_CANT_ALTER
source: "Failed to alter event '%-.192s'"
ger: "Ändern des Events '%-.192s' fehlgeschlagen"

# ER_EVENT_DROP_FAILED
source: "Failed to drop %s"
ger: "Löschen von %s fehlgeschlagen"

# ER_EVENT_INTERVAL_NOT_POSITIVE_OR_TOO_BIG
source: "INTERVAL is either not positive or too big"
ger: "INTERVAL ist entweder nicht positiv oder zu groß"

# ER_EVENT_ENDS_BEFORE_STARTS
source: "ENDS is either invalid or before STARTS"
ger: "ENDS ist entweder ungültig oder liegt vor STARTS"

# ER_EVENT_EXEC_TIME_IN_THE_PAST
source: "Event execution time is in the past. Event has been disabled"
ger: "Ausführungszeit des Events liegt in der Vergangenheit. Event wurde deaktiviert"

# ER_EVENT_OPEN_TABLE_FAILED
source: "Failed to open mysql.event"
ger: "Öffnen von mysql.event fehlgeschlagen"

# ER_EVENT_NEITHER_M_EXPR_NOR_M_AT
source: "No datetime expression provided"
ger: "Kein DATETIME-Ausdruck angegeben"

# ER_EVENT_CANNOT_DELETE
source: "Failed to delete the event from mysql.event"
ger: "Löschen des Events aus mysql.event fehlgeschlagen"

# ER_EVENT_COMPILE_ERROR
source: "Error during compilation of event's body"
ger: "Fehler beim Kompilieren des Event-Bodys"

# ER_EVENT_SAME_NAME
source: "Same old and new event name"
ger: "Alter und neuer Event-Name sind gleich"

# ER_EVENT_DATA_TOO_LONG
source: "Data for column '%s' too long"
ger: "Daten der Spalte '%s' zu lang"

# ER_DROP_INDEX_FK
source: "Cannot drop index '%-.192s': needed in a foreign key constraint"
ger: "Kann Index '%-.192s' nicht löschen: wird für eine Fremdschlüsselbeschränkung benötigt"

# ER_WARN_DEPRECATED_SYNTAX_WITH_VER
source: "The syntax '%s' is deprecated and will be removed in MariaDB %s. Please use %s instead"
ger: "Die Syntax '%s' ist veraltet und wird in MariaDB %s entfernt. Bitte benutzen Sie statt dessen %s"

# ER_CANT_WRITE_LOCK_LOG_TABLE
source: "You can't write-lock a log table. Only read access is possible"
ger: "Eine Log-Tabelle kann nicht schreibgesperrt werden. Es ist ohnehin nur Lesezugriff möglich"

# ER_CANT_LOCK_LOG_TABLE
source: "You can't use locks with log tables"
ger: "Log-Tabellen können nicht gesperrt werden"

# ER_COL_COUNT_DOESNT_MATCH_PLEASE_UPDATE
source: "Column count of mysql.%s is wrong. Expected %d, found %d. Created with MariaDB %d, now running %d. Please use mariadb-upgrade to fix this error"
ger: "Spaltenanzahl von mysql.%s falsch. %d erwartet, aber %d erhalten. Erzeugt mit MariaDB %d, jetzt unter %d. Bitte benutzen Sie mariadb-upgrade, um den Fehler zu beheben"

# ER_TEMP_TABLE_PREVENTS_SWITCH_OUT_OF_RBR
source: "Cannot switch out of the row-based binary log format when the session has open temporary tables"
ger: "Kann nicht aus dem zeilenbasierten Binärlog-Format herauswechseln, wenn die Sitzung offene temporäre Tabellen hat"

# ER_STORED_FUNCTION_PREVENTS_SWITCH_BINLOG_FORMAT
source: "Cannot change the binary logging format inside a stored function or trigger"
ger: "Das Binärlog-Format kann innerhalb einer gespeicherten Funktion oder eines Triggers nicht geändert werden"

# ER_PARTITION_NO_TEMPORARY
source: "Cannot create temporary table with partitions"
ger: "Anlegen temporärer Tabellen mit Partitionen nicht möglich"

# ER_PARTITION_CONST_DOMAIN_ERROR
source: "Partition constant is out of partition function domain"
ger: "Partitionskonstante liegt außerhalb der Partitionsfunktionsdomäne"

# ER_PARTITION_FUNCTION_IS_NOT_ALLOWED
source: "This partition function is not allowed"
ger: "Diese Partitionierungsfunktion ist nicht erlaubt"

# ER_DDL_LOG_ERROR
source: "Error in DDL log"
ger: "Fehler im DDL-Log"

# ER_NULL_IN_VALUES_LESS_THAN
source: "Not allowed to use NULL value in VALUES LESS THAN"
ger: "In VALUES LESS THAN dürfen keine NULL-Werte verwendet werden"

# ER_WRONG_PARTITION_NAME
source: "Incorrect partition name"
ger: "Falscher Partitionsname"

# ER_DUP_ENTRY_AUTOINCREMENT_CASE
source: "ALTER TABLE causes auto_increment resequencing, resulting in duplicate entry '%-.192T' for key '%-.192s'"
ger: "ALTER TABLE führt zur Neusequenzierung von auto_increment, wodurch der doppelte Eintrag '%-.192T' für Schlüssel '%-.192s' auftritt"

# ER_EVENT_MODIFY_QUEUE_ERROR
source: "Internal scheduler error %d"
ger: "Interner Scheduler-Fehler %d"

# ER_EVENT_SET_VAR_ERROR
source: "Error during starting/stopping of the scheduler. Error code %M"
ger: "Fehler während des Startens oder Anhalten des Schedulers. Fehlercode %M"

# ER_PARTITION_MERGE_ERROR
source: "Engine cannot be used in partitioned tables"
ger: "Engine kann in partitionierten Tabellen nicht verwendet werden"

# ER_CANT_ACTIVATE_LOG
source: "Cannot activate '%-.64s' log"
ger: "Kann Logdatei '%-.64s' nicht aktivieren"

# ER_RBR_NOT_AVAILABLE
source: "The server was not built with row-based replication"
ger: "Der Server wurde nicht mit zeilenbasierter Replikation gebaut"

# ER_BASE64_DECODE_ERROR
source: "Decoding of base64 string failed"
ger: "Der Server hat keine zeilenbasierte Replikation"

# ER_EVENT_RECURSION_FORBIDDEN
source: "Recursion of EVENT DDL statements is forbidden when body is present"
ger: "Rekursivität von EVENT-DDL-Anweisungen ist unzulässig wenn ein Hauptteil (Body) existiert"

# ER_EVENTS_DB_ERROR
source: "Cannot proceed, because event scheduler is disabled"
ger: "Die Operation kann nicht fortgesetzt werden, da Event Scheduler deaktiviert ist."

# ER_ONLY_INTEGERS_ALLOWED
source: "Only integers allowed as number here"
ger: "An dieser Stelle sind nur Ganzzahlen zulässig"

# ER_UNSUPORTED_LOG_ENGINE
source: "Storage engine %s cannot be used for log tables"
ger: "Speicher-Engine %s kann für Logtabellen nicht verwendet werden"

# ER_BAD_LOG_STATEMENT
source: "You cannot '%s' a log table if logging is enabled"
ger: "Sie können eine Logtabelle nicht '%s', wenn Loggen angeschaltet ist"

# ER_CANT_RENAME_LOG_TABLE
source: "Cannot rename '%s'. When logging enabled, rename to/from log table must rename two tables: the log table to an archive table and another table back to '%s'"
ger: "Kann '%s' nicht umbenennen. Wenn Loggen angeschaltet ist, müssen zwei Tabellen umbenannt werden: die Logtabelle zu einer Archivtabelle, und eine weitere Tabelle zu '%s'"

# ER_WRONG_PARAMCOUNT_TO_NATIVE_FCT 42000
source: "Incorrect parameter count in the call to native function '%-.192s'"
ger: "Falsche Anzahl von Parametern beim Aufruf der nativen Funktion '%-.192s'"

# ER_WRONG_PARAMETERS_TO_NATIVE_FCT 42000
source: "Incorrect parameters in the call to native function '%-.192s'"
ger: "Falscher Parameter beim Aufruf der nativen Funktion '%-.192s'"

# ER_WRONG_PARAMETERS_TO_STORED_FCT 42000
source: "Incorrect parameters in the call to stored function '%-.192s'"
ger: "Falsche Parameter beim Aufruf der gespeicherten Funktion '%-.192s'"

# ER_NATIVE_FCT_NAME_COLLISION
source: "This function '%-.192s' has the same name as a native function"
ger: "Die Funktion '%-.192s' hat denselben Namen wie eine native Funktion"

# ER_DUP_ENTRY_WITH_KEY_NAME 23000 S1009
source: "Duplicate entry '%-.64T' for key '%-.192s'"
ger: "Doppelter Eintrag '%-.64T' für Schlüssel '%-.192s'"

# ER_BINLOG_PURGE_EMFILE
source: "Too many files opened, please execute the command again"
ger: "Zu viele offene Dateien, bitte führen Sie den Befehl noch einmal aus"

# ER_EVENT_CANNOT_CREATE_IN_THE_PAST
source: "Event execution time is in the past and ON COMPLETION NOT PRESERVE is set. The event was dropped immediately after creation"
ger: "Ausführungszeit des Events liegt in der Vergangenheit, und es wurde ON COMPLETION NOT PRESERVE gesetzt. Das Event wurde unmittelbar nach Erzeugung gelöscht"
