Repository: vladbogo/test-translation
Catalog: ger.xlf
Languages: ger

# ER_CONFLICTING_DECLARATIONS
source: "Conflicting declarations: '%s%s' and '%s%s'"
ger: "Widersprüchliche Deklarationen: '%s%s' und '%s%s'"

# ER_SP_NO_RECURSIVE_CREATE 2F003
source: "Can't create a %s from within another stored routine"
ger: "Kann kein %s innerhalb einer anderen gespeicherten Routine erzeugen"

# ER_SP_ALREADY_EXISTS 42000
source: "%s %s already exists"
ger: "%s %s existiert bereits"

# ER_SP_DOES_NOT_EXIST 42000
source: "%s %s does not exist"
ger: "%s %s existiert nicht"

# ER_SP_DROP_FAILED
source: "Failed to DROP %s %s"
ger: "DROP %s %s ist fehlgeschlagen"

# ER_SP_STORE_FAILED
source: "Failed to CREATE %s %s"
ger: "CREATE %s %s ist fehlgeschlagen"

# ER_SP_LILABEL_MISMATCH 42000
source: "%s with no matching label: %s"
ger: "%s ohne passende Marke: %s"

# ER_SP_LABEL_REDEFINE 42000
source: "Redefining label %s"
ger: "Neudefinition der Marke %s"

# ER_SP_LABEL_MISMATCH 42000
source: "End-label %s without match"
ger: "Ende-Marke %s ohne zugehörigen Anfang"

# ER_SP_UNINIT_VAR 01000
source: "Referring to uninitialized variable %s"
ger: "Zugriff auf nichtinitialisierte Variable %s"

# ER_SP_BADSELECT 0A000
source: "PROCEDURE %s can't return a result set in the given context"
ger: "PROCEDURE %s kann im gegebenen Kontext keine Ergebnismenge zurückgeben"

# ER_SP_BADRETURN 42000
source: "RETURN is only allowed in a FUNCTION"
ger: "RETURN ist nur innerhalb einer FUNCTION erlaubt"

# ER_SP_BADSTATEMENT 0A000
source: "%s is not allowed in stored procedures"
ger: "%s ist in gespeicherten Prozeduren nicht erlaubt"

# ER_UPDATE_LOG_DEPRECATED_IGNORED 42000
source: "The update log is deprecated and replaced by the binary log; SET SQL_LOG_UPDATE has been ignored. This option will be removed in MariaDB 5.6"
ger: "Das Update-Log ist veraltet und wurde durch das Binär-Log ersetzt. SET SQL_LOG_UPDATE wird ignoriert. Diese Option wird in MariaDB 5.6 entfernt"

# ER_UPDATE_LOG_DEPRECATED_TRANSLATED 42000
source: "The update log is deprecated and replaced by the binary log; SET SQL_LOG_UPDATE has been translated to SET SQL_LOG_BIN. This option will be removed in MariaDB 5.6"
ger: "Das Update-Log ist veraltet und wurde durch das Binär-Log ersetzt. SET SQL_LOG_UPDATE wurde in SET SQL_LOG_BIN übersetzt. Diese Option wird in MariaDB 5.6 entfernt"

# ER_QUERY_INTERRUPTED 70100
source: "Query execution was interrupted"
ger: "Ausführung der Abfrage wurde unterbrochen"

# ER_SP_WRONG_NO_OF_ARGS 42000
source: "Incorrect number of arguments for %s %s; expected %u, got %u"
ger: "Falsche Anzahl von Argumenten für %s %s; erwarte %u, erhalte %u"

# ER_SP_COND_MISMATCH 42000
source: "Undefined CONDITION: %s"
ger: "Undefinierte CONDITION: %s"

# ER_SP_NORETURN 42000
source: "No RETURN found in FUNCTION %s"
ger: "Kein RETURN in FUNCTION %s gefunden"

# ER_SP_NORETURNEND 2F005
source: "FUNCTION %s ended without RETURN"
ger: "FUNCTION %s endete ohne RETURN"

# ER_SP_BAD_CURSOR_QUERY 42000
source: "Cursor statement must be a SELECT"
ger: "Cursor-Anweisung muss ein SELECT sein"

# ER_SP_BAD_CURSOR_SELECT 42000
source: "Cursor SELECT must not have INTO"
ger: "Cursor-SELECT darf kein INTO haben"

# ER_SP_CURSOR_MISMATCH 42000
source: "Undefined CURSOR: %s"
ger: "Undefinierter CURSOR: %s"

# ER_SP_CURSOR_ALREADY_OPEN 24000
source: "Cursor is already open"
ger: "Cursor ist schon geöffnet"

# ER_SP_CURSOR_NOT_OPEN 24000
source: "Cursor is not open"
ger: "Cursor ist nicht geöffnet"

# ER_SP_UNDECLARED_VAR 42000
source: "Undeclared variable: %s"
ger: "Nicht deklarierte Variable: %s"

# ER_SP_WRONG_NO_OF_FETCH_ARGS
source: "Incorrect number of FETCH variables"
ger: "Falsche Anzahl von FETCH-Variablen"

# ER_SP_FETCH_NO_DATA 02000
source: "No data - zero rows fetched, selected, or processed"
ger: "Keine Daten - null Zeilen geholt (fetch), ausgewählt oder verarbeitet"

# ER_SP_DUP_PARAM 42000
source: "Duplicate parameter: %s"
ger: "Doppelter Parameter: %s"

# ER_SP_DUP_VAR 42000
source: "Duplicate variable: %s"
ger: "Doppelte Variable: %s"

# ER_SP_DUP_COND 42000
source: "Duplicate condition: %s"
ger: "Doppelte Bedingung: %s"

# ER_SP_DUP_CURS 42000
source: "Duplicate cursor: %s"
ger: "Doppelter Cursor: %s"

# ER_SP_CANT_ALTER
source: "Failed to ALTER %s %s"
ger: "ALTER %s %s fehlgeschlagen"

# ER_SP_SUBSELECT_NYI 0A000
source: "Subquery value not supported"
ger: "Subquery-Wert wird nicht unterstützt"

# ER_STMT_NOT_ALLOWED_IN_SF_OR_TRG 0A000
source: "%s is not allowed in stored function or trigger"
ger: "%s ist in gespeicherten Funktionen und in Triggern nicht erlaubt"

# ER_SP_VARCOND_AFTER_CURSHNDLR 42000
source: "Variable or condition declaration after cursor or handler declaration"
ger: "Deklaration einer Variablen oder einer Bedingung nach der Deklaration eines Cursors oder eines Handlers"

# ER_SP_CURSOR_AFTER_HANDLER 42000
source: "Cursor declaration after handler declaration"
ger: "Deklaration eines Cursors nach der Deklaration eines Handlers"

# ER_SP_CASE_NOT_FOUND 20000
source: "Case not found for CASE statement"
ger: "Fall für CASE-Anweisung nicht gefunden"

# ER_FPARSER_TOO_BIG_FILE
source: "Configuration file '%-.192s' is too big"
ger: "Konfigurationsdatei '%-.192s' ist zu groß"

# ER_FPARSER_BAD_HEADER
source: "Malformed file type header in file '%-.192s'"
ger: "Nicht wohlgeformter Dateityp-Header in Datei '%-.192s'"

# ER_FPARSER_EOF_IN_COMMENT
source: "Unexpected end of file while parsing comment '%-.200s'"
ger: "Unerwartetes Dateiende beim Parsen des Kommentars '%-.200s'"

# ER_FPARSER_ERROR_IN_PARAMETER
source: "Error while parsing parameter '%-.192s' (line: '%-.192s')"
ger: "Fehler beim Parsen des Parameters '%-.192s' (Zeile: '%-.192s')"

# ER_FPARSER_EOF_IN_UNKNOWN_PARAMETER
source: "Unexpected end of file while skipping unknown parameter '%-.192s'"
ger: "Unerwartetes Dateiende beim Überspringen des unbekannten Parameters '%-.192s'"

# ER_VIEW_NO_EXPLAIN
source: "ANALYZE/EXPLAIN/SHOW can not be issued; lacking privileges for underlying table"
ger: "ANALYZE/EXPLAIN/SHOW kann nicht verlangt werden. Rechte für zugrunde liegende Tabelle fehlen"

# ER_FRM_UNKNOWN_TYPE
source: "File '%-.192s' has unknown type '%-.64s' in its header"
ger: "Datei '%-.192s' hat unbekannten Typ '%-.64s' im Header"

# ER_WRONG_OBJECT
source: "'%-.192s.%-.192s' is not of type '%s'"
ger: "'%-.192s.%-.192s' ist nicht %s"

# ER_NONUPDATEABLE_COLUMN
source: "Column '%-.192s' is not updatable"
ger: "Feld '%-.192s' ist nicht aktualisierbar"

# ER_VIEW_SELECT_DERIVED
source: "View's SELECT contains a subquery in the FROM clause"
ger: "SELECT der View enthält eine Subquery in der FROM-Klausel"

# ER_VIEW_SELECT_CLAUSE
source: "View's SELECT contains a '%s' clause"
ger: "SELECT der View enthält eine '%s'-Klausel"

# ER_VIEW_SELECT_VARIABLE
source: "View's SELECT contains a variable or parameter"
ger: "SELECT der View enthält eine Variable oder einen Parameter"

# ER_VIEW_SELECT_TMPTABLE
source: "View's SELECT refers to a temporary table '%-.192s'"
ger: "SELECT der View verweist auf eine temporäre Tabelle '%-.192s'"

# ER_VIEW_WRONG_LIST
source: "View's SELECT and view's field list have different column counts"
ger: "SELECT- und Feldliste der Views haben unterschiedliche Anzahlen von Spalten"

# ER_WARN_VIEW_MERGE
source: "View merge algorithm can't be used here for now (assumed undefined algorithm)"
ger: "View-Merge-Algorithmus kann hier momentan nicht verwendet werden (undefinierter Algorithmus wird angenommen)"

# ER_WARN_VIEW_WITHOUT_KEY
source: "View being updated does not have complete key of underlying table in it"
ger: "Die aktualisierte View enthält nicht den vollständigen Schlüssel der zugrunde liegenden Tabelle"

# ER_SP_NO_DROP_SP
source: "Can't drop or alter a %s from within another stored routine"
ger: "Kann eine %s nicht von innerhalb einer anderen gespeicherten Routine löschen oder ändern"

# ER_SP_GOTO_IN_HNDLR
source: "GOTO is not allowed in a stored procedure handler"
ger: "GOTO ist im Handler einer gespeicherten Prozedur nicht erlaubt"

# ER_TRG_ALREADY_EXISTS
source: "Trigger '%s' already exists"
ger: "Trigger '%s' existiert bereits"

# ER_TRG_DOES_NOT_EXIST
source: "Trigger does not exist"
ger: "Trigger existiert nicht"

# ER_TRG_ON_VIEW_OR_TEMP_TABLE
source: "Trigger's '%-.192s' is a view, temporary table or sequence"
ger: "'%-.192s' des Triggers ist ein View, temporäre Tabelle oder Sequence"

# ER_TRG_CANT_CHANGE_ROW
source: "Updating of %s row is not allowed in %strigger"
ger: "Aktualisieren einer %s-Zeile ist in einem %s-Trigger nicht erlaubt"

# ER_TRG_NO_SUCH_ROW_IN_TRG
source: "There is no %s row in %s trigger"
ger: "Es gibt keine %s-Zeile im %s-Trigger"

# ER_NO_DEFAULT_FOR_FIELD
source: "Field '%-.192s' doesn't have a default value"
ger: "Feld '%-.192s' hat keinen Vorgabewert"

# ER_DIVISION_BY_ZERO 22012
source: "Division by 0"
ger: "Division durch 0"

# ER_TRUNCATED_WRONG_VALUE_FOR_FIELD 22007
source: "Incorrect %-.32s value: '%-.128T' for column `%.192s`.`%.192s`.`%.192s` at row %lu"
ger: "Falscher %-.32s-Wert: '%-.128T' für Feld '`%.192s`.`%.192s`.`%.192s` in Zeile %lu"

# ER_ILLEGAL_VALUE_FOR_TYPE 22007
source: "Illegal %s '%-.192T' value found during parsing"
ger: "Nicht zulässiger %s-Wert '%-.192T' beim Parsen gefunden"

# ER_VIEW_NONUPD_CHECK
source: "CHECK OPTION on non-updatable view %`-.192s.%`-.192s"
ger: "CHECK OPTION auf nicht-aktualisierbarem View %`-.192s.%`-.192s"

# ER_VIEW_CHECK_FAILED 44000
source: "CHECK OPTION failed %`-.192s.%`-.192s"
ger: "CHECK OPTION fehlgeschlagen: %`-.192s.%`-.192s"

# ER_PROCACCESS_DENIED_ERROR 42000
source: "%-.32s command denied to user '%s'@'%s' for routine '%-.192s'"
ger: "Befehl %-.32s nicht zulässig für Benutzer '%s'@'%s' in Routine '%-.192s'"

# ER_RELAY_LOG_FAIL
source: "Failed purging old relay logs: %s"
ger: "Bereinigen alter Relais-Logs fehlgeschlagen: %s"

# ER_PASSWD_LENGTH
source: "Password hash should be a %d-digit hexadecimal number"
ger: "Passwort-Hash sollte eine Hexdaezimalzahl mit %d Stellen sein"

# ER_UNKNOWN_TARGET_BINLOG
source: "Target log not found in binlog index"
ger: "Ziel-Log im Binlog-Index nicht gefunden"

# ER_IO_ERR_LOG_INDEX_READ
source: "I/O error reading log index file"
ger: "Fehler beim Lesen der Log-Index-Datei"

# ER_BINLOG_PURGE_PROHIBITED
source: "Server configuration does not permit binlog purge"
ger: "Server-Konfiguration erlaubt keine Binlog-Bereinigung"

# ER_FSEEK_FAIL
source: "Failed on fseek()"
ger: "fseek() fehlgeschlagen"

# ER_BINLOG_PURGE_FATAL_ERR
source: "Fatal error during log purge"
ger: "Schwerwiegender Fehler bei der Log-Bereinigung"

# ER_LOG_IN_USE
source: "A purgeable log is in use, will not purge"
ger: "Ein zu bereinigendes Log wird gerade benutzt, daher keine Bereinigung"

# ER_LOG_PURGE_UNKNOWN_ERR
source: "Unknown error during log purge"
ger: "Unbekannter Fehler bei Log-Bereinigung"

# ER_RELAY_LOG_INIT
source: "Failed initializing relay log position: %s"
ger: "Initialisierung der Relais-Log-Position fehlgeschlagen: %s"

# ER_NO_BINARY_LOGGING
source: "You are not using binary logging"
ger: "Sie verwenden keine Binärlogs"

# ER_RESERVED_SYNTAX
source: "The '%-.64s' syntax is reserved for purposes internal to the MariaDB server"
ger: "Die Schreibweise '%-.64s' ist für interne Zwecke des MariaDB-Servers reserviert"

# ER_WSAS_FAILED
source: "WSAStartup Failed"
ger: "WSAStartup fehlgeschlagen"

# ER_DIFF_GROUPS_PROC
source: "Can't handle procedures with different groups yet"
ger: "Kann Prozeduren mit unterschiedlichen Gruppen noch nicht verarbeiten"

# ER_NO_GROUP_FOR_PROC
source: "Select must have a group with this procedure"
ger: "SELECT muss bei dieser Prozedur ein GROUP BY haben"

# ER_ORDER_WITH_PROC
source: "Can't use ORDER clause with this procedure"
ger: "Kann bei dieser Prozedur keine ORDER-BY-Klausel verwenden"

# ER_LOGGING_PROHIBIT_CHANGING_OF
source: "Binary logging and replication forbid changing the global server %s"
ger: "Binärlogs und Replikation verhindern Wechsel des globalen Servers %s"

# ER_NO_FILE_MAPPING
source: "Can't map file: %-.200s, errno: %M"
ger: "Kann Datei nicht abbilden: %-.200s, Fehler: %M"

# ER_WRONG_MAGIC
source: "Wrong magic in %-.64s"
ger: "Falsche magische Zahlen in %-.64s"

# ER_PS_MANY_PARAM
source: "Prepared statement contains too many placeholders"
ger: "Vorbereitete Anweisung enthält zu viele Platzhalter"

# ER_KEY_PART_0
source: "Key part '%-.192s' length cannot be 0"
ger: "Länge des Schlüsselteils '%-.192s' kann nicht 0 sein"

# ER_VIEW_CHECKSUM
source: "View text checksum failed"
ger: "View-Text-Prüfsumme fehlgeschlagen"

# ER_VIEW_MULTIUPDATE
source: "Can not modify more than one base table through a join view '%-.192s.%-.192s'"
ger: "Kann nicht mehr als eine Basistabelle über Join-View '%-.192s.%-.192s' ändern"

# ER_VIEW_NO_INSERT_FIELD_LIST
source: "Can not insert into join view '%-.192s.%-.192s' without fields list"
ger: "Kann nicht ohne Feldliste in Join-View '%-.192s.%-.192s' einfügen"

# ER_VIEW_DELETE_MERGE_VIEW
source: "Can not delete from join view '%-.192s.%-.192s'"
ger: "Kann nicht aus Join-View '%-.192s.%-.192s' löschen"

# ER_CANNOT_USER
source: "Operation %s failed for %.256s"
ger: "Operation %s schlug fehl für %.256s"

# ER_XAER_NOTA XAE04
source: "XAER_NOTA: Unknown XID"
ger: "XAER_NOTA: Unbekannte XID"

# ER_XAER_INVAL XAE05
source: "XAER_INVAL: Invalid arguments (or unsupported command)"
ger: "XAER_INVAL: Ungültige Argumente (oder nicht unterstützter Befehl)"

# ER_XAER_RMFAIL XAE07
source: "XAER_RMFAIL: The command cannot be executed when global transaction is in the %.64s state"
ger: "XAER_RMFAIL: DEr Befehl kann nicht ausgeführt werden, wenn die globale Transaktion im Zustand %.64s ist"

# ER_XAER_OUTSIDE XAE09
source: "XAER_OUTSIDE: Some work is done outside global transaction"
ger: "XAER_OUTSIDE: Einige Arbeiten werden außerhalb der globalen Transaktion verrichtet"

# ER_XAER_RMERR XAE03
source: "XAER_RMERR: Fatal error occurred in the transaction branch - check your data for consistency"
ger: "XAER_RMERR: Schwerwiegender Fehler im Transaktionszweig - prüfen Sie Ihre Daten auf Konsistenz"

# ER_XA_RBROLLBACK XA100
source: "XA_RBROLLBACK: Transaction branch was rolled back"
ger: "XA_RBROLLBACK: Transaktionszweig wurde zurückgerollt"

# ER_NONEXISTING_PROC_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s' on routine '%-.192s'"
ger: "Es gibt diese Berechtigung für Benutzer '%-.48s' auf Host '%-.64s' für Routine '%-.192s' nicht"

# ER_PROC_AUTO_GRANT_FAIL
source: "Failed to grant EXECUTE and ALTER ROUTINE privileges"
ger: "Gewährung von EXECUTE- und ALTER-ROUTINE-Rechten fehlgeschlagen"

# ER_PROC_AUTO_REVOKE_FAIL
source: "Failed to revoke all privileges to dropped routine"
ger: "Rücknahme aller Rechte für die gelöschte Routine fehlgeschlagen"

# ER_DATA_TOO_LONG 22001
source: "Data too long for column '%s' at row %lu"
ger: "Daten zu lang für Feld '%s' in Zeile %lu"

# ER_SP_BAD_SQLSTATE 42000
source: "Bad SQLSTATE: '%s'"
ger: "Ungültiger SQLSTATE: '%s'"

# ER_STARTUP
source: "%s: ready for connections.\nVersion: '%s' socket: '%s' port: %d %s"
ger: "%s: bereit für Verbindungen.\nVersion: '%s' Socket: '%s' Port: %d %s"

# ER_LOAD_FROM_FIXED_SIZE_ROWS_TO_VAR
source: "Can't load value from file with fixed size rows to variable"
ger: "Kann Wert aus Datei mit Zeilen fester Größe nicht in Variable laden"

# ER_CANT_CREATE_USER_WITH_GRANT 42000
source: "You are not allowed to create a user with GRANT"
ger: "Sie dürfen keinen Benutzer mit GRANT anlegen"

# ER_WRONG_VALUE_FOR_TYPE
source: "Incorrect %-.32s value: '%-.128T' for function %-.32s"
ger: "Falscher %-.32s-Wert: '%-.128T' für Funktion %-.32s"

# ER_TABLE_DEF_CHANGED
source: "Table definition has changed, please retry transaction"
ger: "Tabellendefinition wurde geändert, bitte starten Sie die Transaktion neu"

# ER_SP_DUP_HANDLER 42000
source: "Duplicate handler declared in the same block"
ger: "Doppelter Handler im selben Block deklariert"

# ER_SP_NOT_VAR_ARG 42000
source: "OUT or INOUT argument %d for routine %s is not a variable or NEW pseudo-variable in BEFORE trigger"
ger: "OUT- oder INOUT-Argument %d für Routine %s ist keine Variable"

# ER_SP_NO_RETSET 0A000
source: "Not allowed to return a result set from a %s"
ger: "Rückgabe einer Ergebnismenge aus einer %s ist nicht erlaubt"

# ER_CANT_CREATE_GEOMETRY_OBJECT 22003
source: "Cannot get geometry object from data you send to the GEOMETRY field"
ger: "Kann kein Geometrieobjekt aus den Daten machen, die Sie dem GEOMETRY-Feld übergeben haben"

# ER_FAILED_ROUTINE_BREAK_BINLOG
source: "A routine failed and has neither NO SQL nor READS SQL DATA in its declaration and binary logging is enabled; if non-transactional tables were updated, the binary log will miss their changes"
ger: "Eine Routine, die weder NO SQL noch READS SQL DATA in der Deklaration hat, schlug fehl und Binärlogging ist aktiv. Wenn Nicht-Transaktions-Tabellen aktualisiert wurden, enthält das Binärlog ihre Änderungen nicht"

# ER_BINLOG_UNSAFE_ROUTINE
source: "This function has none of DETERMINISTIC, NO SQL, or READS SQL DATA in its declaration and binary logging is enabled (you *might* want to use the less safe log_bin_trust_function_creators variable)"
ger: "Diese Routine hat weder DETERMINISTIC, NO SQL noch READS SQL DATA in der Deklaration und Binärlogging ist aktiv (*vielleicht* sollten Sie die weniger sichere Variable log_bin_trust_function_creators verwenden)"

# ER_BINLOG_CREATE_ROUTINE_NEED_SUPER
source: "You do not have the SUPER privilege and binary logging is enabled (you *might* want to use the less safe log_bin_trust_function_creators variable)"
ger: "Sie haben keine SUPER-Berechtigung und Binärlogging ist aktiv (*vielleicht* sollten Sie die weniger sichere Variable log_bin_trust_function_creators verwenden)"

# ER_EXEC_STMT_WITH_OPEN_CURSOR
source: "You can't execute a prepared statement which has an open cursor associated with it. Reset the statement to re-execute it"
ger: "Sie können keine vorbereitete Anweisung ausführen, die mit einem geöffneten Cursor verknüpft ist. Setzen Sie die Anweisung zurück, um sie neu auszuführen"

# ER_STMT_HAS_NO_OPEN_CURSOR
source: "The statement (%lu) has no open cursor"
ger: "Die Anweisung (%lu) hat keinen geöffneten Cursor"

# ER_COMMIT_NOT_ALLOWED_IN_SF_OR_TRG
source: "Explicit or implicit commit is not allowed in stored function or trigger"
ger: "Explizites oder implizites Commit ist in gespeicherten Funktionen und in Triggern nicht erlaubt"

# ER_NO_DEFAULT_FOR_VIEW_FIELD
source: "Field of view '%-.192s.%-.192s' underlying table doesn't have a default value"
ger: "Ein Feld der dem View '%-.192s.%-.192s' zugrundeliegenden Tabelle hat keinen Vorgabewert"

# ER_SP_NO_RECURSION
source: "Recursive stored functions and triggers are not allowed"
ger: "Rekursive gespeicherte Routinen und Triggers sind nicht erlaubt"

# ER_TOO_BIG_SCALE 42000 S1009
source: "Too big scale specified for '%-.192s'. Maximum is %u"
ger: "Zu großer Skalierungsfaktor für '%-.192s' angegeben. Maximum ist %u"

# ER_TOO_BIG_PRECISION 42000 S1009
source: "Too big precision specified for '%-.192s'. Maximum is %u"
ger: "Zu große Genauigkeit für '%-.192s' angegeben. Maximum ist %u"

# ER_M_BIGGER_THAN_D 42000 S1009
source: "For float(M,D), double(M,D) or decimal(M,D), M must be >= D (column '%-.192s')"
ger: "Für FLOAT(M,D), DOUBLE(M,D) oder DECIMAL(M,D) muss M >= D sein (Feld '%-.192s')"

# ER_WRONG_LOCK_OF_SYSTEM_TABLE
source: "You can't combine write-locking of system tables with other tables or lock types"
ger: "Sie können Schreibsperren auf der Systemtabelle nicht mit anderen Tabellen kombinieren"

# ER_CONNECT_TO_FOREIGN_DATA_SOURCE
source: "Unable to connect to foreign data source: %.64s"
ger: "Kann nicht mit Fremddatenquelle verbinden: %.64s"

# ER_QUERY_ON_FOREIGN_DATA_SOURCE
source: "There was a problem processing the query on the foreign data source. Data source error: %-.64s"
ger: "Bei der Verarbeitung der Abfrage ist in der Fremddatenquelle ein Problem aufgetreten. Datenquellenfehlermeldung: %-.64s"

# ER_FOREIGN_DATA_SOURCE_DOESNT_EXIST
source: "The foreign data source you are trying to reference does not exist. Data source error: %-.64s"
ger: "Die Fremddatenquelle, auf die Sie zugreifen wollen, existiert nicht. Datenquellenfehlermeldung: %-.64s"

# ER_FOREIGN_DATA_STRING_INVALID_CANT_CREATE
source: "Can't create federated table. The data source connection string '%-.64s' is not in the correct format"
ger: "Kann föderierte Tabelle nicht erzeugen. Der Datenquellen-Verbindungsstring '%-.64s' hat kein korrektes Format"

# ER_FOREIGN_DATA_STRING_INVALID
source: "The data source connection string '%-.64s' is not in the correct format"
ger: "Der Datenquellen-Verbindungsstring '%-.64s' hat kein korrektes Format"

# ER_CANT_CREATE_FEDERATED_TABLE
source: "Can't create federated table. Foreign data src error: %-.64s"
ger: "Kann föderierte Tabelle nicht erzeugen. Fremddatenquellenfehlermeldung: %-.64s"

# ER_TRG_IN_WRONG_SCHEMA
source: "Trigger in wrong schema"
ger: "Trigger im falschen Schema"

# ER_STACK_OVERRUN_NEED_MORE
source: "Thread stack overrun: %ld bytes used of a %ld byte stack, and %ld bytes needed. Consider increasing the thread_stack system variable."
ger: "Thread-Stack-Überlauf: %ld Bytes eines %ld-Byte-Stacks in Verwendung, und %ld Bytes benötigt. Verwenden Sie 'mariadbd --thread_stack=#', um einen größeren Stack anzugeben"

# ER_TOO_LONG_BODY 42000 S1009
source: "Routine body for '%-.100s' is too long"
ger: "Routinen-Body für '%-.100s' ist zu lang"

# ER_WARN_CANT_DROP_DEFAULT_KEYCACHE
source: "Cannot drop default keycache"
ger: "Der vorgabemäßige Schlüssel-Cache kann nicht gelöscht werden"

# ER_TOO_BIG_DISPLAYWIDTH 42000 S1009
source: "Display width out of range for '%-.192s' (max = %lu)"
ger: "Anzeigebreite außerhalb des zulässigen Bereichs für '%-.192s' (Maximum = %lu)"

# ER_XAER_DUPID XAE08
source: "XAER_DUPID: The XID already exists"
ger: "XAER_DUPID: Die XID existiert bereits"

# ER_DATETIME_FUNCTION_OVERFLOW 22008
source: "Datetime function: %-.32s field overflow"
ger: "Datetime-Funktion: %-.32s Feldüberlauf"

# ER_CANT_UPDATE_USED_TABLE_IN_SF_OR_TRG
source: "Can't update table '%-.192s' in stored function/trigger because it is already used by statement which invoked this stored function/trigger"
ger: "Kann Tabelle '%-.192s' in gespeicherter Funktion oder Trigger nicht aktualisieren, weil sie bereits von der Anweisung verwendet wird, die diese gespeicherte Funktion oder den Trigger aufrief"

# ER_VIEW_PREVENT_UPDATE
source: "The definition of table '%-.192s' prevents operation %-.192s on table '%-.192s'"
ger: "Die Definition der Tabelle '%-.192s' verhindert die Operation %-.192s auf Tabelle '%-.192s'"

# ER_PS_NO_RECURSION
source: "The prepared statement contains a stored routine call that refers to that same statement. It's not allowed to execute a prepared statement in such a recursive manner"
ger: "Die vorbereitete Anweisung enthält einen Aufruf einer gespeicherten Routine, die auf eben dieselbe Anweisung verweist. Es ist nicht erlaubt, eine vorbereitete Anweisung in solch rekursiver Weise auszuführen"

# ER_SP_CANT_SET_AUTOCOMMIT
source: "Not allowed to set autocommit from a stored function or trigger"
ger: "Es ist nicht erlaubt, innerhalb einer gespeicherten Funktion oder eines Triggers AUTOCOMMIT zu setzen"

# ER_VIEW_FRM_NO_USER
source: "View '%-.192s'.'%-.192s' has no definer information (old table format). Current user is used as definer. Please recreate the view!"
ger: "View '%-.192s'.'%-.192s' hat keine Definierer-Information (altes Tabellenformat). Der aktuelle Benutzer wird als Definierer verwendet. Bitte erstellen Sie den View neu"

# ER_VIEW_OTHER_USER
source: "You need the SUPER privilege for creation view with '%-.192s'@'%-.192s' definer"
ger: "Sie brauchen die SUPER-Berechtigung, um einen View mit dem Definierer '%-.192s'@'%-.192s' zu erzeugen"
