Repository: vladbogo/test-translation
Catalog: greek.xlf
Languages: greek

# ER_NO
source: "NO"
greek: "ΟΧΙ"

# ER_YES
source: "YES"
greek: "ΝΑΙ"

# ER_CANT_CREATE_FILE
source: "Can't create file '%-.200s' (errno: %M)"
greek: "Αδύνατη η δημιουργία του αρχείου '%-.200s' (κωδικός λάθους: %M)"

# ER_CANT_CREATE_TABLE
source: "Can't create table %`s.%`s (errno: %M)"
greek: "Αδύνατη η δημιουργία του πίνακα %`s.%`s (κωδικός λάθους: %M)"

# ER_CANT_CREATE_DB
source: "Can't create database '%-.192s' (errno: %M)"
greek: "Αδύνατη η δημιουργία της βάσης δεδομένων '%-.192s' (κωδικός λάθους: %M)"

# ER_DB_CREATE_EXISTS
source: "Can't create database '%-.192s'; database exists"
greek: "Αδύνατη η δημιουργία της βάσης δεδομένων '%-.192s'; Η βάση δεδομένων υπάρχει ήδη"

# ER_DB_DROP_EXISTS
source: "Can't drop database '%-.192s'; database doesn't exist"
greek: "Αδύνατη η διαγραφή της βάσης δεδομένων '%-.192s'. Η βάση δεδομένων δεν υπάρχει"

# ER_DB_DROP_DELETE
source: "Error dropping database (can't delete '%-.192s', errno: %M)"
greek: "Παρουσιάστηκε πρόβλημα κατά τη διαγραφή της βάσης δεδομένων (αδύνατη η διαγραφή '%-.192s', κωδικός λάθους: %M)"

# ER_DB_DROP_RMDIR
source: "Error dropping database (can't rmdir '%-.192s', errno: %M)"
greek: "Παρουσιάστηκε πρόβλημα κατά τη διαγραφή της βάσης δεδομένων (αδύνατη η διαγραφή του φακέλλου '%-.192s', κωδικός λάθους: %M)"

# ER_CANT_DELETE_FILE
source: "Error on delete of '%-.192s' (errno: %M)"
greek: "Παρουσιάστηκε πρόβλημα κατά τη διαγραφή '%-.192s' (κωδικός λάθους: %M)"

# ER_CANT_FIND_SYSTEM_REC
source: "Can't read record in system table"
greek: "Αδύνατη η ανάγνωση εγγραφής από πίνακα του συστήματος"

# ER_CANT_GET_STAT
source: "Can't get status of '%-.200s' (errno: %M)"
greek: "Αδύνατη η λήψη πληροφοριών για την κατάσταση του '%-.200s' (κωδικός λάθους: %M)"

# ER_CANT_GET_WD
source: "Can't get working directory (errno: %M)"
greek: "Ο φάκελλος εργασίας δεν βρέθηκε (κωδικός λάθους: %M)"

# ER_CANT_LOCK
source: "Can't lock file (errno: %M)"
greek: "Το αρχείο δεν μπορεί να κλειδωθεί (κωδικός λάθους: %M)"

# ER_CANT_OPEN_FILE
source: "Can't open file: '%-.200s' (errno: %M)"
greek: "Δεν είναι δυνατό να ανοιχτεί το αρχείο: '%-.200s' (κωδικός λάθους: %M)"

# ER_FILE_NOT_FOUND
source: "Can't find file: '%-.200s' (errno: %M)"
greek: "Δεν βρέθηκε το αρχείο: '%-.200s' (κωδικός λάθους: %M)"

# ER_CANT_READ_DIR
source: "Can't read dir of '%-.192s' (errno: %M)"
greek: "Δεν είναι δυνατό να διαβαστεί ο φάκελλος του '%-.192s' (κωδικός λάθους: %M)"

# ER_CANT_SET_WD
source: "Can't change dir to '%-.192s' (errno: %M)"
greek: "Αδύνατη η αλλαγή του τρέχοντος καταλόγου σε '%-.192s' (κωδικός λάθους: %M)"

# ER_CHECKREAD
source: "Record has changed since last read in table '%-.192s'"
greek: "Η εγγραφή έχει αλλάξει από την τελευταία φορά που ανασύρθηκε από τον πίνακα '%-.192s'"

# ER_DISK_FULL
source: "Disk full (%s); waiting for someone to free some space... (errno: %M)"
greek: "Δεν υπάρχει χώρος στο δίσκο (%s). Παρακαλώ, περιμένετε να ελευθερωθεί χώρος... (κωδικός λάθους: %M)"

# ER_DUP_KEY 23000
source: "Can't write; duplicate key in table '%-.192s'"
greek: "Δεν είναι δυνατή η καταχώρηση, η τιμή υπάρχει ήδη στον πίνακα '%-.192s'"

# ER_ERROR_ON_CLOSE
source: "Error on close of '%-.192s' (errno: %M)"
greek: "Παρουσιάστηκε πρόβλημα κλείνοντας το '%-.192s' (κωδικός λάθους: %M)"

# ER_ERROR_ON_READ
source: "Error reading file '%-.200s' (errno: %M)"
greek: "Πρόβλημα κατά την ανάγνωση του αρχείου '%-.200s' (κωδικός λάθους: %M)"

# ER_ERROR_ON_RENAME
source: "Error on rename of '%-.210s' to '%-.210s' (errno: %M)"
greek: "Πρόβλημα κατά την μετονομασία του αρχείου '%-.210s' to '%-.210s' (κωδικός λάθους: %M)"

# ER_ERROR_ON_WRITE
source: "Error writing file '%-.200s' (errno: %M)"
greek: "Πρόβλημα κατά την αποθήκευση του αρχείου '%-.200s' (κωδικός λάθους: %M)"

# ER_FILE_USED
source: "'%-.192s' is locked against change"
greek: "'%-.192s' δεν επιτρέπονται αλλαγές"

# ER_FILSORT_ABORT
source: "Sort aborted"
greek: "Η διαδικασία ταξινόμισης ακυρώθηκε"

# ER_FORM_NOT_FOUND
source: "View '%-.192s' doesn't exist for '%-.192s'"
greek: "Το View '%-.192s' δεν υπάρχει για '%-.192s'"

# ER_GET_ERRNO
source: "Got error %M from storage engine %s"
greek: "Ελήφθη μήνυμα λάθους %M από τον χειριστή πίνακα (table handler) %s"

# ER_KEY_NOT_FOUND
source: "Can't find record in '%-.192s'"
greek: "Αδύνατη η ανεύρεση εγγραφής στο '%-.192s'"

# ER_NOT_FORM_FILE
source: "Incorrect information in file: '%-.200s'"
greek: "Λάθος πληροφορίες στο αρχείο: '%-.200s'"

# ER_NOT_KEYFILE
source: "Index for table '%-.200s' is corrupt; try to repair it"
greek: "Λάθος αρχείο ταξινόμισης (key file) για τον πίνακα: '%-.200s'; Παρακαλώ, διορθώστε το!"

# ER_OLD_KEYFILE
source: "Old key file for table '%-.192s'; repair it!"
greek: "Παλαιό αρχείο ταξινόμισης (key file) για τον πίνακα '%-.192s'; Παρακαλώ, διορθώστε το!"

# ER_OPEN_AS_READONLY
source: "Table '%-.192s' is read only"
greek: "'%-.192s' επιτρέπεται μόνο η ανάγνωση"

# ER_OUTOFMEMORY HY001 S1001
source: "Out of memory; restart server and try again (needed %d bytes)"
greek: "Δεν υπάρχει διαθέσιμη μνήμη. Προσπαθήστε πάλι, επανεκινώντας τη διαδικασία (demon) (χρειάζονται %d bytes)"

# ER_OUT_OF_SORTMEMORY HY001 S1001
source: "Out of sort memory, consider increasing server sort buffer size"
greek: "Δεν υπάρχει διαθέσιμη μνήμη για ταξινόμιση. Αυξήστε το sort buffer size για τη διαδικασία (demon)"

# ER_UNEXPECTED_EOF
source: "Unexpected EOF found when reading file '%-.192s' (errno: %M)"
greek: "Κατά τη διάρκεια της ανάγνωσης, βρέθηκε απροσδόκητα το τέλος του αρχείου '%-.192s' (κωδικός λάθους: %M)"

# ER_CON_COUNT_ERROR 08004
source: "Too many connections"
greek: "Υπάρχουν πολλές συνδέσεις..."

# ER_OUT_OF_RESOURCES
source: "Out of memory."
greek: "Πρόβλημα με τη διαθέσιμη μνήμη (Out of thread space/memory)"

# ER_BAD_HOST_ERROR 08S01
source: "Can't get hostname for your address"
greek: "Δεν έγινε γνωστό το hostname για την address σας"

# ER_HANDSHAKE_ERROR 08S01
source: "Bad handshake"
greek: "Η αναγνώριση (handshake) δεν έγινε σωστά"

# ER_DBACCESS_DENIED_ERROR 42000
source: "Access denied for user '%s'@'%s' to database '%-.192s'"
greek: "Δεν επιτέρεται η πρόσβαση στο χρήστη: '%s'@'%s' στη βάση δεδομένων '%-.192s'"

# ER_ACCESS_DENIED_ERROR 28000
source: "Access denied for user '%s'@'%s' (using password: %s)"
greek: "Δεν επιτέρεται η πρόσβαση στο χρήστη: '%s'@'%s' (χρήση password: %s)"

# ER_NO_DB_ERROR 3D000
source: "No database selected"
greek: "Δεν επιλέχθηκε βάση δεδομένων"

# ER_UNKNOWN_COM_ERROR 08S01
source: "Unknown command"
greek: "Αγνωστη εντολή"

# ER_BAD_NULL_ERROR 23000
source: "Column '%-.192s' cannot be null"
greek: "Το πεδίο '%-.192s' δεν μπορεί να είναι κενό (null)"

# ER_BAD_DB_ERROR 42000
source: "Unknown database '%-.192s'"
greek: "Αγνωστη βάση δεδομένων '%-.192s'"

# ER_TABLE_EXISTS_ERROR 42S01
source: "Table '%-.192s' already exists"
greek: "Ο πίνακας '%-.192s' υπάρχει ήδη"

# ER_BAD_TABLE_ERROR 42S02
source: "Unknown table '%-.100T'"
greek: "Αγνωστος πίνακας '%-.100T'"

# ER_NON_UNIQ_ERROR 23000
source: "Column '%-.192s' in %-.192s is ambiguous"
greek: "Το πεδίο: '%-.192s' σε %-.192s δεν έχει καθοριστεί"

# ER_SERVER_SHUTDOWN 08S01
source: "Server shutdown in progress"
greek: "Εναρξη διαδικασίας αποσύνδεσης του εξυπηρετητή (server shutdown)"

# ER_BAD_FIELD_ERROR 42S22 S0022
source: "Unknown column '%-.192s' in '%-.192s'"
greek: "Αγνωστο πεδίο '%-.192s' σε '%-.192s'"

# ER_WRONG_FIELD_WITH_GROUP 42000 S1009
source: "'%-.192s' isn't in GROUP BY"
greek: "Χρησιμοποιήθηκε '%-.192s' που δεν υπήρχε στο group by"

# ER_WRONG_GROUP_FIELD 42000 S1009
source: "Can't group on '%-.192s'"
greek: "Αδύνατη η ομαδοποίηση (group on) '%-.192s'"

# ER_WRONG_SUM_SELECT 42000 S1009
source: "Statement has sum functions and columns in same statement"
greek: "Η διατύπωση περιέχει sum functions και columns στην ίδια διατύπωση"

# ER_WRONG_VALUE_COUNT 21S01
source: "Column count doesn't match value count"
greek: "Το Column count δεν ταιριάζει με το value count"

# ER_TOO_LONG_IDENT 42000 S1009
source: "Identifier name '%-.100T' is too long"
greek: "Το identifier name '%-.100T' είναι πολύ μεγάλο"

# ER_DUP_FIELDNAME 42S21 S1009
source: "Duplicate column name '%-.192s'"
greek: "Επανάληψη column name '%-.192s'"

# ER_DUP_KEYNAME 42000 S1009
source: "Duplicate key name '%-.192s'"
greek: "Επανάληψη key name '%-.192s'"

# ER_DUP_ENTRY 23000 S1009
source: "Duplicate entry '%-.192T' for key %d"
greek: "Διπλή εγγραφή '%-.192T' για το κλειδί %d"

# ER_WRONG_FIELD_SPEC 42000 S1009
source: "Incorrect column specifier for column '%-.192s'"
greek: "Εσφαλμένο column specifier για το πεδίο '%-.192s'"

# ER_PARSE_ERROR 42000 s1009
source: "%s near '%-.80T' at line %d"
greek: "%s πλησίον '%-.80T' στη γραμμή %d"

# ER_EMPTY_QUERY 42000
source: "Query was empty"
greek: "Το ερώτημα (query) που θέσατε ήταν κενό"

# ER_NONUNIQ_TABLE 42000 S1009
source: "Not unique table/alias: '%-.192s'"
greek: "Αδύνατη η ανεύρεση unique table/alias: '%-.192s'"

# ER_INVALID_DEFAULT 42000 S1009
source: "Invalid default value for '%-.192s'"
greek: "Εσφαλμένη προκαθορισμένη τιμή (default value) για '%-.192s'"

# ER_MULTIPLE_PRI_KEY 42000 S1009
source: "Multiple primary key defined"
greek: "Περισσότερα από ένα primary key ορίστηκαν"

# ER_TOO_MANY_KEYS 42000 S1009
source: "Too many keys specified; max %d keys allowed"
greek: "Πάρα πολλά key ορίσθηκαν. Το πολύ %d επιτρέπονται"

# ER_TOO_MANY_KEY_PARTS 42000 S1009
source: "Too many key parts specified; max %d parts allowed"
greek: "Πάρα πολλά key parts ορίσθηκαν. Το πολύ %d επιτρέπονται"

# ER_TOO_LONG_KEY 42000 S1009
source: "Specified key was too long; max key length is %d bytes"
greek: "Το κλειδί που ορίσθηκε είναι πολύ μεγάλο. Το μέγιστο μήκος είναι %d"

# ER_KEY_COLUMN_DOES_NOT_EXIST 42000 S1009
source: "Key column '%-.192s' doesn't exist in table"
greek: "Το πεδίο κλειδί '%-.192s' δεν υπάρχει στον πίνακα"

# ER_TOO_BIG_FIELDLENGTH 42000 S1009
source: "Column length too big for column '%-.192s' (max = %lu); use BLOB or TEXT instead"
greek: "Πολύ μεγάλο μήκος για το πεδίο '%-.192s' (max = %lu). Παρακαλώ χρησιμοποιείστε τον τύπο BLOB"

# ER_WRONG_AUTO_KEY 42000 S1009
source: "Incorrect table definition; there can be only one auto column and it must be defined as a key"
greek: "Μπορεί να υπάρχει μόνο ένα auto field και πρέπει να έχει ορισθεί σαν key"

# ER_NORMAL_SHUTDOWN
source: "%s (initiated by: %s): Normal shutdown"
greek: "%s (%s): Φυσιολογική διαδικασία shutdown"

# ER_GOT_SIGNAL
source: "%s: Got signal %d. Aborting!\n"
greek: "%s: Ελήφθη το μήνυμα %d. Η διαδικασία εγκαταλείπεται!\n"

# ER_SHUTDOWN_COMPLETE
source: "%s: Shutdown complete\n"
greek: "%s: Η διαδικασία Shutdown ολοκληρώθηκε\n"

# ER_FORCING_CLOSE 08S01
source: "%s: Forcing close of thread %ld user: '%-.48s'\n"
greek: "%s: Το thread θα κλείσει %ld user: '%-.48s'\n"

# ER_IPSOCK_ERROR 08S01
source: "Can't create IP socket"
greek: "Δεν είναι δυνατή η δημιουργία IP socket"

# ER_NO_SUCH_INDEX 42S12 S1009
source: "Table '%-.192s' has no index like the one used in CREATE INDEX; recreate the table"
greek: "Ο πίνακας '%-.192s' δεν έχει ευρετήριο (index) σαν αυτό που χρησιμοποιείτε στην CREATE INDEX. Παρακαλώ, ξαναδημιουργήστε τον πίνακα"

# ER_WRONG_FIELD_TERMINATORS 42000 S1009
source: "Field separator argument is not what is expected; check the manual"
greek: "Ο διαχωριστής πεδίων δεν είναι αυτός που αναμενόταν. Παρακαλώ ανατρέξτε στο manual"

# ER_BLOBS_AND_NO_TERMINATED 42000 S1009
source: "You can't use fixed rowlength with BLOBs; please use 'fields terminated by'"
greek: "Δεν μπορείτε να χρησιμοποιήσετε fixed rowlength σε BLOBs. Παρακαλώ χρησιμοποιείστε 'fields terminated by'"

# ER_TEXTFILE_NOT_READABLE
source: "The file '%-.128s' must be in the database directory or be readable by all"
greek: "Το αρχείο '%-.128s' πρέπει να υπάρχει στο database directory ή να μπορεί να διαβαστεί από όλους"

# ER_FILE_EXISTS_ERROR
source: "File '%-.200s' already exists"
greek: "Το αρχείο '%-.200s' υπάρχει ήδη"

# ER_LOAD_INFO
source: "Records: %ld Deleted: %ld Skipped: %ld Warnings: %ld"
greek: "Εγγραφές: %ld Διαγραφές: %ld Παρεκάμφθησαν: %ld Προειδοποιήσεις: %ld"

# ER_ALTER_INFO
source: "Records: %ld Duplicates: %ld"
greek: "Εγγραφές: %ld Επαναλήψεις: %ld"

# ER_WRONG_SUB_KEY
source: "Incorrect prefix key; the used key part isn't a string, the used length is longer than the key part, or the storage engine doesn't support unique prefix keys"
greek: "Εσφαλμένο sub part key. Το χρησιμοποιούμενο key part δεν είναι string ή το μήκος του είναι μεγαλύτερο"

# ER_CANT_REMOVE_ALL_FIELDS 42000
source: "You can't delete all columns with ALTER TABLE; use DROP TABLE instead"
greek: "Δεν είναι δυνατή η διαγραφή όλων των πεδίων με ALTER TABLE. Παρακαλώ χρησιμοποιείστε DROP TABLE"

# ER_CANT_DROP_FIELD_OR_KEY 42000
source: "Can't DROP %s %`-.192s; check that it exists"
greek: "Αδύνατη η διαγραφή (DROP %s) %`-.192s. Παρακαλώ ελέγξτε αν το πεδίο/κλειδί υπάρχει"

# ER_INSERT_INFO
source: "Records: %ld Duplicates: %ld Warnings: %ld"
greek: "Εγγραφές: %ld Επαναλήψεις: %ld Προειδοποιήσεις: %ld"

# ER_NO_SUCH_THREAD
source: "Unknown thread id: %lu"
greek: "Αγνωστο thread id: %lu"

# ER_KILL_DENIED_ERROR
source: "You are not owner of thread %lld"
greek: "Δεν είσθε owner του thread %lld"

# ER_NO_TABLES_USED
source: "No tables used"
greek: "Δεν χρησιμοποιήθηκαν πίνακες"

# ER_TOO_BIG_SET
source: "Too many strings for column %-.192s and SET"
greek: "Πάρα πολλά strings για το πεδίο %-.192s και SET"

# ER_NO_UNIQUE_LOGFILE
source: "Can't generate a unique log-filename %-.200s.(1-999)\n"
greek: "Αδύνατη η δημιουργία unique log-filename %-.200s.(1-999)\n"

# ER_TABLE_NOT_LOCKED_FOR_WRITE
source: "Table '%-.192s' was locked with a READ lock and can't be updated"
greek: "Ο πίνακας '%-.192s' έχει κλειδωθεί με READ lock και δεν επιτρέπονται αλλαγές"

# ER_TABLE_NOT_LOCKED
source: "Table '%-.192s' was not locked with LOCK TABLES"
greek: "Ο πίνακας '%-.192s' δεν έχει κλειδωθεί με LOCK TABLES"

# ER_WRONG_DB_NAME 42000
source: "Incorrect database name '%-.100T'"
greek: "Λάθος όνομα βάσης δεδομένων '%-.100T'"

# ER_WRONG_TABLE_NAME 42000
source: "Incorrect table name '%-.100s'"
greek: "Λάθος όνομα πίνακα '%-.100s'"

# ER_TOO_BIG_SELECT 42000
source: "The SELECT would examine more than MAX_JOIN_SIZE rows; check your WHERE and use SET SQL_BIG_SELECTS=1 or SET MAX_JOIN_SIZE=# if the SELECT is okay"
greek: "Το SELECT θα εξετάσει μεγάλο αριθμό εγγραφών και πιθανώς θα καθυστερήσει. Παρακαλώ εξετάστε τις παραμέτρους του WHERE και χρησιμοποιείστε SET SQL_BIG_SELECTS=1 αν το SELECT είναι σωστό"

# ER_UNKNOWN_ERROR
source: "Unknown error"
greek: "Προέκυψε άγνωστο λάθος"

# ER_UNKNOWN_PROCEDURE 42000
source: "Unknown procedure '%-.192s'"
greek: "Αγνωστη διαδικασία '%-.192s'"

# ER_WRONG_PARAMCOUNT_TO_PROCEDURE 42000
source: "Incorrect parameter count to procedure '%-.192s'"
greek: "Λάθος αριθμός παραμέτρων στη διαδικασία '%-.192s'"

# ER_WRONG_PARAMETERS_TO_PROCEDURE
source: "Incorrect parameters to procedure '%-.192s'"
greek: "Λάθος παράμετροι στην διαδικασία '%-.192s'"

# ER_UNKNOWN_TABLE 42S02
source: "Unknown table '%-.192s' in %-.32s"
greek: "Αγνωστος πίνακας '%-.192s' σε %-.32s"

# ER_FIELD_SPECIFIED_TWICE 42000
source: "Column '%-.192s' specified twice"
greek: "Το πεδίο '%-.192s' έχει ορισθεί δύο φορές"

# ER_INVALID_GROUP_FUNC_USE
source: "Invalid use of group function"
greek: "Εσφαλμένη χρήση της group function"

# ER_UNSUPPORTED_EXTENSION 42000
source: "Table '%-.192s' uses an extension that doesn't exist in this MariaDB version"
greek: "Ο πίνακς '%-.192s' χρησιμοποιεί κάποιο extension που δεν υπάρχει στην έκδοση αυτή της MariaDB"

# ER_TABLE_MUST_HAVE_COLUMNS 42000
source: "A table must have at least 1 column"
greek: "Ενας πίνακας πρέπει να έχει τουλάχιστον ένα πεδίο"

# ER_RECORD_FILE_FULL
source: "The table '%-.192s' is full"
greek: "Ο πίνακας '%-.192s' είναι γεμάτος"

# ER_UNKNOWN_CHARACTER_SET 42000
source: "Unknown character set: '%-.64s'"
greek: "Αγνωστο character set: '%-.64s'"

# ER_TOO_MANY_TABLES
source: "Too many tables; MariaDB can only use %d tables in a join"
greek: "Πολύ μεγάλος αριθμός πινάκων. Η MariaDB μπορεί να χρησιμοποιήσει %d πίνακες σε διαδικασία join"

# ER_TOO_MANY_FIELDS
source: "Too many columns"
greek: "Πολύ μεγάλος αριθμός πεδίων"

# ER_TOO_BIG_ROWSIZE 42000
source: "Row size too large. The maximum row size for the used table type, not counting BLOBs, is %ld. This includes storage overhead, check the manual. You have to change some columns to TEXT or BLOBs"
greek: "Πολύ μεγάλο μέγεθος εγγραφής. Το μέγιστο μέγεθος εγγραφής, χωρίς να υπολογίζονται τα blobs, είναι %ld. Πρέπει να ορίσετε κάποια πεδία σαν blobs"

# ER_STACK_OVERRUN
source: "Thread stack overrun: Used: %ld of a %ld stack. Use 'mariadbd --thread_stack=#' to specify a bigger stack if needed"
greek: "Stack overrun στο thread: Used: %ld of a %ld stack. Παρακαλώ χρησιμοποιείστε 'mariadbd --thread_stack=#' για να ορίσετε ένα μεγαλύτερο stack αν χρειάζεται"

# ER_WRONG_OUTER_JOIN 42000
source: "Cross dependency found in OUTER JOIN; examine your ON conditions"
greek: "Cross dependency βρέθηκε σε OUTER JOIN. Παρακαλώ εξετάστε τις συνθήκες που θέσατε στο ON"

# ER_CANT_FIND_UDF
source: "Can't load function '%-.192s'"
greek: "Δεν είναι δυνατή η διαδικασία load για τη συνάρτηση '%-.192s'"

# ER_CANT_INITIALIZE_UDF
source: "Can't initialize function '%-.192s'; %-.80s"
greek: "Δεν είναι δυνατή η έναρξη της συνάρτησης '%-.192s'; %-.80s"

# ER_UDF_NO_PATHS
source: "No paths allowed for shared library"
greek: "Δεν βρέθηκαν paths για την shared library"

# ER_UDF_EXISTS
source: "Function '%-.192s' already exists"
greek: "Η συνάρτηση '%-.192s' υπάρχει ήδη"

# ER_CANT_OPEN_LIBRARY
source: "Can't open shared library '%-.192s' (errno: %d, %-.128s)"
greek: "Δεν είναι δυνατή η ανάγνωση της shared library '%-.192s' (κωδικός λάθους: %d, %-.128s)"

# ER_CANT_FIND_DL_ENTRY
source: "Can't find symbol '%-.128s' in library"
greek: "Δεν είναι δυνατή η ανεύρεση της συνάρτησης '%-.128s' στην βιβλιοθήκη"

# ER_FUNCTION_NOT_DEFINED
source: "Function '%-.192s' is not defined"
greek: "Η συνάρτηση '%-.192s' δεν έχει ορισθεί"

# ER_HOST_IS_BLOCKED
source: "Host '%-.64s' is blocked because of many connection errors; unblock with 'mariadb-admin flush-hosts'"
greek: "Ο υπολογιστής '%-.64s' έχει αποκλεισθεί λόγω πολλαπλών λαθών σύνδεσης. Προσπαθήστε να διορώσετε με 'mariadb-admin flush-hosts'"

# ER_HOST_NOT_PRIVILEGED
source: "Host '%-.64s' is not allowed to connect to this MariaDB server"
greek: "Ο υπολογιστής '%-.64s' δεν έχει δικαίωμα σύνδεσης με τον MariaDB server"

# ER_PASSWORD_ANONYMOUS_USER 42000
source: "You are using MariaDB as an anonymous user and anonymous users are not allowed to modify user settings"
greek: "Χρησιμοποιείτε την MariaDB σαν anonymous user και έτσι δεν μπορείτε να αλλάξετε τα passwords άλλων χρηστών"

# ER_PASSWORD_NOT_ALLOWED 42000
source: "You must have privileges to update tables in the mysql database to be able to change passwords for others"
greek: "Πρέπει να έχετε δικαίωμα διόρθωσης πινάκων (update) στη βάση δεδομένων mysql για να μπορείτε να αλλάξετε τα passwords άλλων χρηστών"

# ER_PASSWORD_NO_MATCH 28000
source: "Can't find any matching row in the user table"
greek: "Δεν είναι δυνατή η ανεύρεση της αντίστοιχης εγγραφής στον πίνακα των χρηστών"

# ER_SYNTAX_ERROR 42000
source: "You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use"
greek: "You have an error in your SQL syntax"

# ER_BLOB_KEY_WITHOUT_LENGTH 42000
source: "BLOB/TEXT column '%-.192s' used in key specification without a key length"
greek: "BLOB column '%-.192s' used in key specification without a key length"

# ER_CHECK_NOT_IMPLEMENTED 42000
source: "The storage engine for the table doesn't support %s"
greek: "The handler for the table doesn't support %s"

# ER_NO_REFERENCED_ROW 23000
source: "Cannot add or update a child row: a foreign key constraint fails"
greek: "Cannot add a child row: a foreign key constraint fails"

# ER_ROW_IS_REFERENCED 23000
source: "Cannot delete or update a parent row: a foreign key constraint fails"
greek: "Cannot delete a parent row: a foreign key constraint fails"

# ER_DUP_ENTRY_WITH_KEY_NAME 23000 S1009
source: "Duplicate entry '%-.64T' for key '%-.192s'"
greek: "Διπλή εγγραφή '%-.64T' για το κλειδί '%-.192s'"

# ER_ACCESS_DENIED_NO_PASSWORD_ERROR 28000
source: "Access denied for user '%s'@'%s'"
greek: "Δεν επιτέρεται η πρόσβαση στο χρήστη: '%s'@'%s'"

# ER_DUP_UNKNOWN_IN_INDEX 23000
source: "Duplicate entry for key '%-.192s'"
greek: "Διπλή εγγραφή για το κλειδί '%-.192s'"
