Repository: vladbogo/test-translation
Catalog: hindi.xlf
Languages: hindi

# ER_PARTITION_NO_TEMPORARY
source: "Cannot create temporary table with partitions"
hindi: "अस्थाई टेबल को पार्टिशन्स के साथ नहीं बनाया जा सकता"

# ER_DDL_LOG_ERROR
source: "Error in DDL log"
hindi: "DDL लॉग में त्रुटि हुई"

# ER_WRONG_PARTITION_NAME
source: "Incorrect partition name"
hindi: "पार्टीशन का नाम गलत है"

# ER_UNSUPORTED_LOG_ENGINE
source: "Storage engine %s cannot be used for log tables"
hindi: "स्टोरेज इंजन %s को लॉग टेबल्स के लिए इस्तेमाल नहीं किया जा सकता है"

# ER_SLAVE_CREATE_EVENT_FAILURE
source: "Failed to create %s"
hindi: "%s को बनाने मैं असफल रहे"

# ER_DATABASE_NAME
source: "Database"
hindi: "डेटाबेस"

# ER_TABLE_NAME
source: "Table"
hindi: "टेबल"

# ER_PARTITION_NAME
source: "Partition"
hindi: "पार्टीशन"

# ER_SUBPARTITION_NAME
source: "Subpartition"
hindi: "सब-पार्टीशन"

# ER_TEMPORARY_NAME
source: "Temporary"
hindi: "अस्थायी"

# ER_PATH_LENGTH
source: "The path specified for %.64T is too long"
hindi: "%.64T के लिए निर्दिष्ट पथ बहुत लंबा है"

# ER_WRONG_PERFSCHEMA_USAGE
source: "Invalid performance_schema usage"
hindi: "performance_schema का अवैध उपयोग"

# ER_FAILED_READ_FROM_PAR_FILE
source: "Failed to read from the .par file"
hindi: ".par फ़ाइल से पढ़ने में असफल रहे"

# ER_ACCESS_DENIED_NO_PASSWORD_ERROR 28000
source: "Access denied for user '%s'@'%s'"
hindi: "यूज़र '%s'@'%s' को अनुमति नहीं है"

# ER_INNODB_READ_ONLY
source: "InnoDB is in read only mode"
hindi: "InnoDB केवल READ-ONLY मोड में है"

# ER_UNSUPPORTED_ENGINE_FOR_GENERATED_COLUMNS
source: "%s storage engine does not support generated columns"
hindi: "स्टोरेज इंजन %s COMPUTED कॉलम्स को सपोर्ट नहीं करता"

# ER_UNKNOWN_OPTION
source: "Unknown option '%-.64s'"
hindi: "अज्ञात विकल्प '%-.64s'"

# ER_BAD_OPTION_VALUE
source: "Incorrect value '%-.64T' for option '%-.64s'"
hindi: "गलत मान '%-.64T' विकल्प '%-.64s' के लिए"

# ER_ILLEGAL_SUBQUERY_OPTIMIZER_SWITCHES
source: "At least one of the 'in_to_exists' or 'materialization' optimizer_switch flags must be 'on'"
hindi: "कम से कम 'in_to_exists' या 'materialization' optimizer_switch फ्लैग 'ON' होना चाहिए"

# ER_QUERY_CACHE_IS_GLOBALY_DISABLED
source: "Query cache is globally disabled and you can't enable it only for this session"
hindi: "क्वेरी कैश ग्लोबल स्तर पर DISABLED है और आप इसे केवल सत्र के लिए ENABLE नहीं कर सकते"

# ER_CONNECTION_KILLED 70100
source: "Connection was killed"
hindi: "कनेक्शन को समाप्त कर दिया गया है"

# ER_NO_SUCH_TABLE_IN_ENGINE 42S02
source: "Table '%-.192s.%-.192s' doesn't exist in engine"
hindi: "टेबल '%-.192s.%-.192s' इंजन में मौजूद नहीं है"

# ER_NO_SUCH_QUERY
source: "Unknown query id: %lld"
hindi: "अज्ञात क्वेरी ID: %lld"

# ER_INVALID_ROLE OP000
source: "Invalid role specification %`s"
hindi: "अमान्य रोल विनिर्देश %`s"

# ER_INVALID_CURRENT_USER 0L000
source: "The current user is invalid"
hindi: "वर्तमान यूज़र अमान्य है"

# ER_CANNOT_GRANT_ROLE
source: "Cannot grant role '%s' to: %s"
hindi: "रोल '%s', %s को प्रदान नहीं कर सकते"

# ER_CANNOT_REVOKE_ROLE
source: "Cannot revoke role '%s' from: %s"
hindi: "रोल '%s', %s से हटाया नहीं जा सका"

# ER_IT_IS_A_VIEW 42S02
source: "'%-.192s' is a view"
hindi: "'%-.192s' एक VIEW है"

# ER_TABLE_DEFINITION_TOO_BIG
source: "The definition for table %`s is too big"
hindi: "टेबल %`s की परिभाषा बहुत बड़ी है"

# ER_PLUGIN_INSTALLED
source: "Plugin '%-.192s' already installed"
hindi: "प्लग-इन '%-.192s' पहले से ही इन्स्टॉल्ड है"

# ER_USER_CREATE_EXISTS
source: "Can't create user '%-.64s'@'%-.64s'; it already exists"
hindi: "यूज़र '%-.64s'@'%-.64s' को नहीं बना सकते; यह पहले से ही मौजूद है"

# ER_USER_DROP_EXISTS
source: "Can't drop user '%-.64s'@'%-.64s'; it doesn't exist"
hindi: "यूज़र '%-.64s'@'%-.64s' को ड्रॉप नहीं कर सकते; यह मौजूद नहीं है"

# ER_ROLE_CREATE_EXISTS
source: "Can't create role '%-.64s'; it already exists"
hindi: "रोल '%-.64s' को नहीं बना सकते; यह पहले से ही मौजूद है"

# ER_ROLE_DROP_EXISTS
source: "Can't drop role '%-.64s'; it doesn't exist"
hindi: "रोल '%-.64s' को ड्रॉप नहीं कर सकते; यह मौजूद नहीं है"

# ER_INVALID_DEFAULT_VALUE_FOR_FIELD 22007
source: "Incorrect default value '%-.128T' for column '%.192s'"
hindi: "गलत डिफ़ॉल्ट मान '%-.128T' कॉलम '%.192s' के लिए"

# ER_KILL_QUERY_DENIED_ERROR
source: "You are not owner of query %lu"
hindi: "आप क्वेरी %lu के OWNER नहीं हैं"

# ER_NO_EIS_FOR_FIELD
source: "Engine-independent statistics are not collected for column '%s'"
hindi: "Engine-independent सांख्यिकी कॉलम '%s' के लिए एकत्रित नहीं किया जा रहा है"
