Repository: vladbogo/test-translation
Catalog: hindi.xlf
Languages: hindi

# ER_NO
source: "NO"
hindi: "नहीं"

# ER_YES
source: "YES"
hindi: "हाँ"

# ER_CANT_CREATE_FILE
source: "Can't create file '%-.200s' (errno: %M)"
hindi: "फ़ाइल '%-.200s' नहीं बन सका (errno: %M)"

# ER_CANT_CREATE_TABLE
source: "Can't create table %`s.%`s (errno: %M)"
hindi: "टेबल '%`s.%`s' नहीं बन सका (errno: %M)"

# ER_CANT_CREATE_DB
source: "Can't create database '%-.192s' (errno: %M)"
hindi: "डेटाबेस '%-.192s' नहीं बन सका (errno: %M)"

# ER_DB_CREATE_EXISTS
source: "Can't create database '%-.192s'; database exists"
hindi: "डेटाबेस '%-.192s' नहीं बन सकता है; यह डेटाबेस पहले से ही मौजूद है"

# ER_DB_DROP_EXISTS
source: "Can't drop database '%-.192s'; database doesn't exist"
hindi: "डेटाबेस '%-.192s' ड्रॉप नहीं कर सकते हैं; यह डेटाबेस मौजूद नहीं है"

# ER_DB_DROP_DELETE
source: "Error dropping database (can't delete '%-.192s', errno: %M)"
hindi: "डेटाबेस ड्रॉप में त्रुटि हुई ('%-.192s' हटा नहीं सकते, errno: %M)"

# ER_DB_DROP_RMDIR
source: "Error dropping database (can't rmdir '%-.192s', errno: %M)"
hindi: "डेटाबेस ड्रॉप में त्रुटि हुई ('%-.192s' rmdir नहीं कर सकते, errno: %M)"

# ER_CANT_DELETE_FILE
source: "Error on delete of '%-.192s' (errno: %M)"
hindi: "'%-.192s' के हटाने पर त्रुटि हुई (errno: %M)"

# ER_CANT_FIND_SYSTEM_REC
source: "Can't read record in system table"
hindi: "सिस्टम टेबल से रिकॉर्ड नहीं पढ़ सके"

# ER_CANT_GET_STAT
source: "Can't get status of '%-.200s' (errno: %M)"
hindi: "'%-.200s' की अवस्था प्राप्त नहीं कर सके (errno: %M)"

# ER_CANT_GET_WD
source: "Can't get working directory (errno: %M)"
hindi: "Working डाइरेक्टरी प्राप्त नहीं कर सके (errno: %M)"

# ER_CANT_LOCK
source: "Can't lock file (errno: %M)"
hindi: "फ़ाइल लॉक नहीं कर सके (errno: %M)"

# ER_CANT_OPEN_FILE
source: "Can't open file: '%-.200s' (errno: %M)"
hindi: "फ़ाइल '%-.200s' नहीं खोल सकते (errno: %M)"

# ER_FILE_NOT_FOUND
source: "Can't find file: '%-.200s' (errno: %M)"
hindi: "फ़ाइल '%-.200s' नहीं मिला (errno: %M)"

# ER_CANT_READ_DIR
source: "Can't read dir of '%-.192s' (errno: %M)"
hindi: "'%-.192s' की डायरेक्टरी नहीं पढ़ सके (errno: %M)"

# ER_CANT_SET_WD
source: "Can't change dir to '%-.192s' (errno: %M)"
hindi: "'%-.192s' डायरेक्टरी में नहीं बदल सके (errno: %M)"

# ER_CHECKREAD
source: "Record has changed since last read in table '%-.192s'"
hindi: "रिकॉर्ड टेबल '%-.192s' पिछली बार पढ़े जाने के बाद से बदल गया है"

# ER_DISK_FULL
source: "Disk full (%s); waiting for someone to free some space... (errno: %M)"
hindi: "डिस्क पूरी तरह से भरा हुआ है (%s); कुछ स्थान खाली करें (errno: %M)"

# ER_DUP_KEY 23000
source: "Can't write; duplicate key in table '%-.192s'"
hindi: "टेबल '%-.192s' में DUPLICATE KEY मौजूद होने के कारण नहीं लिख सके"

# ER_ERROR_ON_CLOSE
source: "Error on close of '%-.192s' (errno: %M)"
hindi: "'%-.192s' के बंद पर त्रुटि हुई (errno: %M)"

# ER_ERROR_ON_READ
source: "Error reading file '%-.200s' (errno: %M)"
hindi: "फ़ाइल '%-.200s' पढ़ने में त्रुटि हुई (errno: %M)"

# ER_ERROR_ON_RENAME
source: "Error on rename of '%-.210s' to '%-.210s' (errno: %M)"
hindi: "'%-.210s' का नाम '%-.210s' बदलने पर त्रुटि हुई (errno: %M)"

# ER_ERROR_ON_WRITE
source: "Error writing file '%-.200s' (errno: %M)"
hindi: "फ़ाइल '%-.200s' लिखने में त्रुटि हुई (errno: %M)"

# ER_FILE_USED
source: "'%-.192s' is locked against change"
hindi: "फ़ाइल '%-.192s' में कोई बदलाव नहीं कर सकते"

# ER_FILSORT_ABORT
source: "Sort aborted"
hindi: "SORT निरस्त"

# ER_FORM_NOT_FOUND
source: "View '%-.192s' doesn't exist for '%-.192s'"
hindi: "VIEW '%-.192s', '%-.192s' के लिए मौजूद नहीं है"

# ER_GET_ERRNO
source: "Got error %M from storage engine %s"
hindi: "%M त्रुटि %s स्टोरेज इंजन से"

# ER_ILLEGAL_HA
source: "Storage engine %s of the table %`s.%`s doesn't have this option"
hindi: "स्टोरेज इंजन %s में यह विकल्प उपलब्ध नहीं है (टेबल: %`s.%`s)"

# ER_KEY_NOT_FOUND
source: "Can't find record in '%-.192s'"
hindi: "'%-.192s' में रिकॉर्ड नहीं मिला"

# ER_NOT_FORM_FILE
source: "Incorrect information in file: '%-.200s'"
hindi: "फ़ाइल '%-.200s' में गलत जानकारी है"

# ER_NOT_KEYFILE
source: "Index for table '%-.200s' is corrupt; try to repair it"
hindi: "टेबल '%-.200s' का इंडेक्स CORRUPT हो गया है; इसे REPAIR करने की कोशिश करें"

# ER_OLD_KEYFILE
source: "Old key file for table '%-.192s'; repair it!"
hindi: "टेबल '%-.192s' के लिए पुरानी KEY फ़ाइल; इसे REPAIR करने की कोशिश करें"

# ER_OPEN_AS_READONLY
source: "Table '%-.192s' is read only"
hindi: "टेबल '%-.192s' READ-ONLY है"

# ER_CON_COUNT_ERROR 08004
source: "Too many connections"
hindi: "अत्यधिक कनेक्शन"

# ER_BAD_HOST_ERROR 08S01
source: "Can't get hostname for your address"
hindi: "आपके I.P. ऐड्रेस के लिए होस्टनेम प्राप्त करने में विफल रहे"

# ER_HANDSHAKE_ERROR 08S01
source: "Bad handshake"
hindi: "संपर्क स्थापित करते समय त्रुटि हुई (BAD HANDSHAKE)"

# ER_DBACCESS_DENIED_ERROR 42000
source: "Access denied for user '%s'@'%s' to database '%-.192s'"
hindi: "यूज़र '%s'@'%s' को डेटाबेस '%-.192s' की अनुमति नहीं है"

# ER_ACCESS_DENIED_ERROR 28000
source: "Access denied for user '%s'@'%s' (using password: %s)"
hindi: "यूज़र '%s'@'%s' को अनुमति नहीं है (पासवर्ड का उपयोग: %s)"

# ER_NO_DB_ERROR 3D000
source: "No database selected"
hindi: "किसी भी डेटाबेस का चयन नहीं किया गया है"

# ER_UNKNOWN_COM_ERROR 08S01
source: "Unknown command"
hindi: "अज्ञात आदेश"

# ER_BAD_NULL_ERROR 23000
source: "Column '%-.192s' cannot be null"
hindi: "काँलम '%-.192s' NULL नहीं हो सकता"

# ER_BAD_DB_ERROR 42000
source: "Unknown database '%-.192s'"
hindi: "अज्ञात डाटाबेस '%-.192s'"

# ER_TABLE_EXISTS_ERROR 42S01
source: "Table '%-.192s' already exists"
hindi: "टेबल '%-.192s' पहले से ही मौजूद है"

# ER_BAD_TABLE_ERROR 42S02
source: "Unknown table '%-.100T'"
hindi: "अज्ञात टेबल '%-.100T'"

# ER_NON_UNIQ_ERROR 23000
source: "Column '%-.192s' in %-.192s is ambiguous"
hindi: "काँलम '%-.192s' अस्पष्ट है (टेबल: %-.192s)"

# ER_SERVER_SHUTDOWN 08S01
source: "Server shutdown in progress"
hindi: "सर्वर बंद हो रहा है"

# ER_BAD_FIELD_ERROR 42S22 S0022
source: "Unknown column '%-.192s' in '%-.192s'"
hindi: "अज्ञात काँलम '%-.192s'(टेबल: '%-.192s')"

# ER_WRONG_FIELD_WITH_GROUP 42000 S1009
source: "'%-.192s' isn't in GROUP BY"
hindi: "'%-.192s' GROUP BY में नहीं है"

# ER_WRONG_GROUP_FIELD 42000 S1009
source: "Can't group on '%-.192s'"
hindi: "'%-.192s' पर GROUP नहीं कर सकते"

# ER_WRONG_VALUE_COUNT 21S01
source: "Column count doesn't match value count"
hindi: "कॉलम की गिनती मूल्य की गिनती के समान नही है"

# ER_TOO_LONG_IDENT 42000 S1009
source: "Identifier name '%-.100T' is too long"
hindi: "पहचानकर्ता का नाम '%-.100T' बहुत लंबा है"

# ER_DUP_FIELDNAME 42S21 S1009
source: "Duplicate column name '%-.192s'"
hindi: "समान कॉलम '%-.192s' मौजूद है"

# ER_DUP_KEYNAME 42000 S1009
source: "Duplicate key name '%-.192s'"
hindi: "समान KEY '%-.192s' मौजूद है"

# ER_DUP_ENTRY 23000 S1009
source: "Duplicate entry '%-.192T' for key %d"
hindi: "सामान प्रवेश '%-.192T' KEY %d के लिए"

# ER_WRONG_FIELD_SPEC 42000 S1009
source: "Incorrect column specifier for column '%-.192s'"
hindi: "कॉलम '%-.192s' के लिए गलत कॉलम विनिर्देशक"

# ER_PARSE_ERROR 42000 s1009
source: "%s near '%-.80T' at line %d"
hindi: "%s के पास '%-.80T' लाइन %d में"

# ER_EMPTY_QUERY 42000
source: "Query was empty"
hindi: "क्वेरी खली थी"

# ER_NONUNIQ_TABLE 42000 S1009
source: "Not unique table/alias: '%-.192s'"
hindi: "टेबल या उसका उपनाम '%-.192s' अद्वितीय नहीं है"

# ER_INVALID_DEFAULT 42000 S1009
source: "Invalid default value for '%-.192s'"
hindi: "'%-.192s' के लिए अवैध डिफ़ॉल्ट मान"

# ER_MULTIPLE_PRI_KEY 42000 S1009
source: "Multiple primary key defined"
hindi: "कई PRIMARY KEY परिभाषित"

# ER_TOO_MANY_KEYS 42000 S1009
source: "Too many keys specified; max %d keys allowed"
hindi: "बहुत सारी KEYS निर्दिष्ट हैं; अधिकतम %d KEYS की अनुमति है"

# ER_TOO_MANY_KEY_PARTS 42000 S1009
source: "Too many key parts specified; max %d parts allowed"
hindi: "बहुत सारे KEY के भाग निर्दिष्ट हैं; अधिकतम %d भागों की अनुमति है"

# ER_TOO_LONG_KEY 42000 S1009
source: "Specified key was too long; max key length is %d bytes"
hindi: "निर्दिष्ट KEY बहुत लंबी थी; KEY की अधिकतम लंबाई %d बाइट है"

# ER_KEY_COLUMN_DOES_NOT_EXIST 42000 S1009
source: "Key column '%-.192s' doesn't exist in table"
hindi: "KEY कॉलम '%-.192s' टेबल में मौजूद नहीं है"

# ER_BLOB_USED_AS_KEY 42000 S1009
source: "BLOB column %`s can't be used in key specification in the %s table"
hindi: "BLOB कॉलम %`s टेबल %s में KEY विनिर्देश में इस्तेमाल नहीं किया जा सकता"

# ER_TOO_BIG_FIELDLENGTH 42000 S1009
source: "Column length too big for column '%-.192s' (max = %lu); use BLOB or TEXT instead"
hindi: "कॉलम की लंबाई कॉलम '%-.192s' के लिए बड़ी है (अधिकतम = %lu); BLOB या TEXT का उपयोग करें"

# ER_WRONG_AUTO_KEY 42000 S1009
source: "Incorrect table definition; there can be only one auto column and it must be defined as a key"
hindi: "गलत टेबल परिभाषा; टेबल में केवल एक AUTO_INCREMENT कॉलम हो सकता है और इसे एक KEY के रूप में परिभाषित किया जाना चाहिए"

# ER_NORMAL_SHUTDOWN
source: "%s (initiated by: %s): Normal shutdown"
hindi: "%s (%s): सामान्य शटडाउन"

# ER_GOT_SIGNAL
source: "%s: Got signal %d. Aborting!\n"
hindi: "%s: सिग्नल %d मिलने के कारण सिस्टम बंद किया जा रहा है!\n"

# ER_SHUTDOWN_COMPLETE
source: "%s: Shutdown complete\n"
hindi: "%s: शटडाउन पूर्ण\n"

# ER_FORCING_CLOSE 08S01
source: "%s: Forcing close of thread %ld user: '%-.48s'\n"
hindi: "%s: %ld थ्रेड बंद किया जा रहा है (यूज़र: '%-.48s')\n"

# ER_IPSOCK_ERROR 08S01
source: "Can't create IP socket"
hindi: "IP SOCKET नहीं बना सकते"

# ER_NO_SUCH_INDEX 42S12 S1009
source: "Table '%-.192s' has no index like the one used in CREATE INDEX; recreate the table"
hindi: "CREATE INDEX में इस्तेमाल की गयी सूचि टेबल '%-.192s' में उपलब्ध नहीं है; टेबल को पुनः बनायें"

# ER_WRONG_FIELD_TERMINATORS 42000 S1009
source: "Field separator argument is not what is expected; check the manual"
hindi: "फील्ड विभाजक आर्गुमेंट गलत है; मैनुअल की जाँच करें"

# ER_BLOBS_AND_NO_TERMINATED 42000 S1009
source: "You can't use fixed rowlength with BLOBs; please use 'fields terminated by'"
hindi: "BLOBs को निश्चित लंबाई की पंक्ति के साथ प्रयोग नहीं किया जा सकता है; 'FIELDS TERMINATED BY' का इस्तेमाल करें"

# ER_TEXTFILE_NOT_READABLE
source: "The file '%-.128s' must be in the database directory or be readable by all"
hindi: "फ़ाइल '%-.128s' डेटाबेस डायरेक्टरी में या सभी के द्वारा पठनीय होना चाहिए"

# ER_FILE_EXISTS_ERROR
source: "File '%-.200s' already exists"
hindi: "फ़ाइल '%-.200s' पहले से मौजूद है"

# ER_LOAD_INFO
source: "Records: %ld Deleted: %ld Skipped: %ld Warnings: %ld"
hindi: "रिकॉर्ड: %ld हटाए गए: %ld छोड़ दिए गए: %ld चेतावनी: %ld"

# ER_ALTER_INFO
source: "Records: %ld Duplicates: %ld"
hindi: "रिकॉर्ड: %ld डुप्लिकेट: %ld"

# ER_CANT_REMOVE_ALL_FIELDS 42000
source: "You can't delete all columns with ALTER TABLE; use DROP TABLE instead"
hindi: "ALTER TABLE का इस्तेमाल कर सभी कॉलम्स को हटाया नहीं जा सकता; DROP TABLE का इस्तेमाल करें"

# ER_CANT_DROP_FIELD_OR_KEY 42000
source: "Can't DROP %s %`-.192s; check that it exists"
hindi: "%s %`-.192s को ड्रॉप नहीं कर सकते हैं; कृपया जाँच करें कि यह मौजूद है"

# ER_INSERT_INFO
source: "Records: %ld Duplicates: %ld Warnings: %ld"
hindi: "रिकॉर्ड: %ld डुप्लिकेट: %ld चेतावनी: %ld"

# ER_NO_SUCH_THREAD
source: "Unknown thread id: %lu"
hindi: "अज्ञात थ्रेड ID: %lu"

# ER_KILL_DENIED_ERROR
source: "You are not owner of thread %lld"
hindi: "आप थ्रेड %lld के OWNER नहीं हैं"

# ER_NO_TABLES_USED
source: "No tables used"
hindi: "कोई टेबल का इस्तेमाल नहीं हुआ"

# ER_NO_UNIQUE_LOGFILE
source: "Can't generate a unique log-filename %-.200s.(1-999)\n"
hindi: "एक अनूठा लॉग-फ़ाइल नाम %-.200s.(1-999) उत्पन्न नहीं कर सके\n"

# ER_TABLE_NOT_LOCKED_FOR_WRITE
source: "Table '%-.192s' was locked with a READ lock and can't be updated"
hindi: "टेबल '%-.192s' READ लॉक से बंद है और उसे बदल नहीं सकते"

# ER_TABLE_NOT_LOCKED
source: "Table '%-.192s' was not locked with LOCK TABLES"
hindi: "टेबल '%-.192s' LOCK TABLES से बंद नहीं है"

# ER_WRONG_DB_NAME 42000
source: "Incorrect database name '%-.100T'"
hindi: "डेटाबेस नाम '%-.100T' गलत है"

# ER_WRONG_TABLE_NAME 42000
source: "Incorrect table name '%-.100s'"
hindi: "टेबल नाम '%-.100s' गलत है"

# ER_TOO_BIG_SELECT 42000
source: "The SELECT would examine more than MAX_JOIN_SIZE rows; check your WHERE and use SET SQL_BIG_SELECTS=1 or SET MAX_JOIN_SIZE=# if the SELECT is okay"
hindi: "SELECT कमांड MAX_JOIN_SIZE पंक्तियों से भी ज्यादा की जांच करेगा; कृपया WHERE क्लॉज़ को जाचें अथवा SET SQL_BIG_SELECTS=1 या SET MAX_JOIN_SIZE=# का इस्तेमाल करें"

# ER_UNKNOWN_ERROR
source: "Unknown error"
hindi: "अज्ञात त्रुटि हुई"

# ER_UNKNOWN_PROCEDURE 42000
source: "Unknown procedure '%-.192s'"
hindi: "अज्ञात प्रोसीजर '%-.192s'"

# ER_WRONG_PARAMCOUNT_TO_PROCEDURE 42000
source: "Incorrect parameter count to procedure '%-.192s'"
hindi: "प्रोसीजर '%-.192s' के लिए पैरामीटर की संख्या गलत है"

# ER_WRONG_PARAMETERS_TO_PROCEDURE
source: "Incorrect parameters to procedure '%-.192s'"
hindi: "प्रोसीजर '%-.192s' के लिए पैरामीटर्स गलत हैं"

# ER_UNKNOWN_TABLE 42S02
source: "Unknown table '%-.192s' in %-.32s"
hindi: "टेबल '%-.192s', %-.32s में नहीं मिला"

# ER_FIELD_SPECIFIED_TWICE 42000
source: "Column '%-.192s' specified twice"
hindi: "कॉलम '%-.192s' दो बार निर्दिष्ट किया गया है"

# ER_INVALID_GROUP_FUNC_USE
source: "Invalid use of group function"
hindi: "ग्रुप फंक्शन का अवैध उपयोग"

# ER_UNSUPPORTED_EXTENSION 42000
source: "Table '%-.192s' uses an extension that doesn't exist in this MariaDB version"
hindi: "टेबल '%-.192s' जिस इक्स्टेन्शन का उपयोग कर रहा है, वह इस MariaDB संस्करण में उपलब्ध नहीं है"

# ER_TABLE_MUST_HAVE_COLUMNS 42000
source: "A table must have at least 1 column"
hindi: "एक टेबल में कम से कम एक कॉलम होना चाहिए"

# ER_RECORD_FILE_FULL
source: "The table '%-.192s' is full"
hindi: "टेबल '%-.192s' पूरा भरा है"

# ER_UNKNOWN_CHARACTER_SET 42000
source: "Unknown character set: '%-.64s'"
hindi: "अज्ञात CHARACTER SET: '%-.64s'"

# ER_TOO_MANY_TABLES
source: "Too many tables; MariaDB can only use %d tables in a join"
hindi: "बहुत अधिक टेबल्स, MariaDB एक JOIN में केवल %d टेबल्स का उपयोग कर सकता है"

# ER_TOO_MANY_FIELDS
source: "Too many columns"
hindi: "बहुत अधिक कॉलम्स"

# ER_CANT_FIND_UDF
source: "Can't load function '%-.192s'"
hindi: "फंक्शन '%-.192s' लोड नहीं किया जा सका"

# ER_CANT_INITIALIZE_UDF
source: "Can't initialize function '%-.192s'; %-.80s"
hindi: "फंक्शन '%-.192s' को प्रारंभ नहीं किया जा सका; %-.80s"

# ER_UDF_EXISTS
source: "Function '%-.192s' already exists"
hindi: "फंक्शन '%-.192s' पहले से मौजूद है"

# ER_FUNCTION_NOT_DEFINED
source: "Function '%-.192s' is not defined"
hindi: "फंक्शन '%-.192s' की परिभाषा नहीं मिली"

# ER_HOST_IS_BLOCKED
source: "Host '%-.64s' is blocked because of many connection errors; unblock with 'mariadb-admin flush-hosts'"
hindi: "होस्ट '%-.64s' को कई कनेक्शन में त्रुटियों के कारण ब्लॉक कर दिया गया है; 'mariadb-admin flush-hosts' का इस्तेमाल कर अनब्लॉक करें"

# ER_HOST_NOT_PRIVILEGED
source: "Host '%-.64s' is not allowed to connect to this MariaDB server"
hindi: "होस्ट '%-.64s' को इस MariaDB सर्वर से कनेक्ट करने के लिए अनुमति नहीं है"

# ER_PASSWORD_ANONYMOUS_USER 42000
source: "You are using MariaDB as an anonymous user and anonymous users are not allowed to modify user settings"
hindi: "आप MariaDB का उपयोग एक बेनाम यूज़र की तरह कर रहे हैं; बेनाम यूज़र्स को 'यूज़र सेटिंग्स' बदलने की अनुमति नहीं है"

# ER_PASSWORD_NO_MATCH 28000
source: "Can't find any matching row in the user table"
hindi: "यूज़र टेबल में रिकॉर्ड नहीं मिला"

# ER_CANT_REOPEN_TABLE
source: "Can't reopen table: '%-.192s'"
hindi: "टेबल '%-.192s' फिर से खोल नहीं सकते"

# ER_INVALID_USE_OF_NULL 22004
source: "Invalid use of NULL value"
hindi: "NULL मान का अवैध उपयोग"

# ER_REGEXP_ERROR 42000
source: "Regex error '%s'"
hindi: "regexp में '%s' त्रुटि हुई"

# ER_GRANT_WRONG_HOST_OR_USER 42000
source: "The host or user argument to GRANT is too long"
hindi: "GRANT के लिए होस्ट या यूज़र आर्गुमेंट बहुत लंबा है"

# ER_NO_SUCH_TABLE 42S02
source: "Table '%-.192s.%-.192s' doesn't exist"
hindi: "टेबल '%-.192s.%-.192s' मौजूद नहीं है"

# ER_NOT_ALLOWED_COMMAND 42000
source: "The used command is not allowed with this MariaDB version"
hindi: "यह कमांड इस MariaDB संस्करण के साथ इस्तेमाल नहीं किया जा सकता है"

# ER_SYNTAX_ERROR 42000
source: "You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use"
hindi: "आपके SQL सिंटेक्स मैं गलती है; सही सिंटेक्स के लिए अपने MariaDB सर्वर संस्करण के मैन्युअल की सहायता लें"

# ER_TOO_MANY_DELAYED_THREADS
source: "Too many delayed threads in use"
hindi: "बहुत से DELAYED थ्रेड्स उपयोग में हैं"

# ER_NET_PACKET_TOO_LARGE 08S01
source: "Got a packet bigger than 'max_allowed_packet' bytes"
hindi: "'max_allowed_packet' से भी बड़ा एक पैकेट मिला"

# ER_NET_READ_ERROR_FROM_PIPE 08S01
source: "Got a read error from the connection pipe"
hindi: "कनेक्शन पाइप से एक READ त्रुटि हुई"

# ER_NET_FCNTL_ERROR 08S01
source: "Got an error from fcntl()"
hindi: "fcntl() से एक त्रुटि हुई"

# ER_NET_PACKETS_OUT_OF_ORDER 08S01
source: "Got packets out of order"
hindi: "पैकेट्स क्रम में नहीं प्राप्त हुए"

# ER_NET_UNCOMPRESS_ERROR 08S01
source: "Couldn't uncompress communication packet"
hindi: "संचार पैकेट UNCOMPRESS नहीं कर सके"

# ER_NET_READ_ERROR 08S01
source: "Got an error reading communication packets"
hindi: "संचार पैकेट्स पढ़ते समय एक त्रुटि हुई"

# ER_NET_READ_INTERRUPTED 08S01
source: "Got timeout reading communication packets"
hindi: "संचार पैकेट्स पढ़ने के दौरान टाइमआउट"

# ER_NET_ERROR_ON_WRITE 08S01
source: "Got an error writing communication packets"
hindi: "संचार पैकेट्स लिखते समय एक त्रुटि हुई"

# ER_NET_WRITE_INTERRUPTED 08S01
source: "Got timeout writing communication packets"
hindi: "संचार पैकेट्स लिखने के दौरान टाइमआउट"

# ER_TOO_LONG_STRING 42000
source: "Result string is longer than 'max_allowed_packet' bytes"
hindi: "रिजल्ट स्ट्रिंग 'max_allowed_packet' से लंबा है"

# ER_TABLE_CANT_HANDLE_BLOB 42000
source: "Storage engine %s doesn't support BLOB/TEXT columns"
hindi: "स्टोरेज इंजन %s BLOB/TEXT कॉलम्स को सपोर्ट नहीं करता"

# ER_TABLE_CANT_HANDLE_AUTO_INCREMENT 42000
source: "Storage engine %s doesn't support AUTO_INCREMENT columns"
hindi: "स्टोरेज इंजन %s AUTO_INCREMENT कॉलम्स को सपोर्ट नहीं करता"

# ER_WRONG_COLUMN_NAME 42000
source: "Incorrect column name '%-.100s'"
hindi: "कॉलम नाम '%-.100s' गलत है"

# ER_WRONG_KEY_COLUMN 42000
source: "The storage engine %s can't index column %`s"
hindi: "स्टोरेज इंजन %s, कॉलम %`s को इंडेक्स नहीं कर सकता"

# ER_PRIMARY_CANT_HAVE_NULL 42000
source: "All parts of a PRIMARY KEY must be NOT NULL; if you need NULL in a key, use UNIQUE instead"
hindi: "PRIMARY KEY के सभी भागों को NOT NULL होना चाहिए; यदि आपको एक KEY में NULL की जरूरत है, तो UNIQUE का उपयोग करें"

# ER_TOO_MANY_ROWS 42000
source: "Result consisted of more than one row"
hindi: "परिणाम एक से अधिक पंक्ति का है"

# ER_REQUIRES_PRIMARY_KEY 42000
source: "This table type requires a primary key"
hindi: "इस प्रकार के टेबल को एक PRIMARY KEY की आवश्यकता है"

# ER_NO_RAID_COMPILED
source: "This version of MariaDB is not compiled with RAID support"
hindi: "MariaDB का यह संस्करण RAID सपोर्ट के साथ कॉम्पाईल्ड नहीं है"

# ER_KEY_DOES_NOT_EXISTS 42000 S1009
source: "Key '%-.192s' doesn't exist in table '%-.192s'"
hindi: "KEY '%-.192s', टेबल '%-.192s' में मौजूद नहीं है"

# ER_CHECK_NO_SUCH_TABLE 42000
source: "Can't open table"
hindi: "टेबल नहीं खुल सकता है"

# ER_CHECK_NOT_IMPLEMENTED 42000
source: "The storage engine for the table doesn't support %s"
hindi: "इस टेबल का स्टोरेज इंजन '%s' को सपोर्ट नहीं करता"

# ER_ERROR_DURING_COMMIT
source: "Got error %M during COMMIT"
hindi: "COMMIT के दौरान %M त्रुटि हुई"

# ER_ERROR_DURING_ROLLBACK
source: "Got error %M during ROLLBACK"
hindi: "ROLLBACK के दौरान %M त्रुटि हुई"

# ER_ERROR_DURING_FLUSH_LOGS
source: "Got error %M during FLUSH_LOGS"
hindi: "FLUSH_LOGS के दौरान %M त्रुटि हुई"

# ER_ERROR_DURING_CHECKPOINT
source: "Got error %M during CHECKPOINT"
hindi: "CHECKPOINT के दौरान %M त्रुटि हुई"

# ER_UNKNOWN_SYSTEM_VARIABLE
source: "Unknown system variable '%-.*s'"
hindi: "अज्ञात सिस्टम वैरिएबल '%-.*s'"

# ER_TOO_MANY_USER_CONNECTIONS 42000
source: "User %-.64s already has more than 'max_user_connections' active connections"
hindi: "यूज़र %-.64s के पहले से ही 'max_user_connections' से अधिक सक्रिय कनेक्शन्स हैं"

# ER_SET_CONSTANTS_ONLY
source: "You may only use constant expressions in this statement"
hindi: "इस स्टेटमेंट में आप केवल CONSTANT EXPRESSIONS का उपयोग कर सकते हैं"

# ER_LOCK_TABLE_FULL
source: "The total number of locks exceeds the lock table size"
hindi: "लॉक्स की कुल संख्या लॉक टेबल के साइज से अधिक है"

# ER_WRONG_ARGUMENTS
source: "Incorrect arguments to %s"
hindi: "%s को गलत आर्ग्यूमेंट्स"

# ER_NO_PERMISSION_TO_CREATE_USER 42000
source: "'%s'@'%s' is not allowed to create new users"
hindi: "'%s'@'%s' को नए यूज़र्स बनाने की अनुमति नहीं है"

# ER_TABLE_CANT_HANDLE_FT
source: "The storage engine %s doesn't support FULLTEXT indexes"
hindi: "स्टोरेज इंजन '%s' FULLTEXT इन्डेक्सेस को सपोर्ट नहीं करता"

# ER_WARN_USING_OTHER_HANDLER
source: "Using storage engine %s for table '%s'"
hindi: "स्टोरेज इंजन %s का इस्तेमाल टेबल '%s' के लिए किया जा रहा है"

# ER_UNKNOWN_STORAGE_ENGINE 42000
source: "Unknown storage engine '%s'"
hindi: "अज्ञात स्टोरेज इंजन '%s'"

# ER_SP_ALREADY_EXISTS 42000
source: "%s %s already exists"
hindi: "%s %s पहले से ही मौजूद है"

# ER_SP_DOES_NOT_EXIST 42000
source: "%s %s does not exist"
hindi: "%s %s मौजूद नहीं है"

# ER_SP_DROP_FAILED
source: "Failed to DROP %s %s"
hindi: "%s %s को ड्रॉप करने में असफल रहे"

# ER_SP_STORE_FAILED
source: "Failed to CREATE %s %s"
hindi: "%s %s को बनाने में असफल रहे"

# ER_SP_BADRETURN 42000
source: "RETURN is only allowed in a FUNCTION"
hindi: "RETURN को केवल FUNCTION में इस्तेमाल किया जा सकता है"

# ER_SP_BADSTATEMENT 0A000
source: "%s is not allowed in stored procedures"
hindi: "%s को STORED PROCEDURE में इस्तेमाल नहीं किया जा सकता है"

# ER_SP_NORETURN 42000
source: "No RETURN found in FUNCTION %s"
hindi: "FUNCTION %s में कोई RETURN है"

# ER_SP_NORETURNEND 2F005
source: "FUNCTION %s ended without RETURN"
hindi: "FUNCTION %s RETURN के बिना समाप्त हो गया"

# ER_SP_CURSOR_MISMATCH 42000
source: "Undefined CURSOR: %s"
hindi: "CURSOR %s अपरिभाषित है"

# ER_SP_CURSOR_ALREADY_OPEN 24000
source: "Cursor is already open"
hindi: "CURSOR पहले से ही खुला है"

# ER_SP_CANT_ALTER
source: "Failed to ALTER %s %s"
hindi: "%s %s को ALTER करने में असफल रहे"

# ER_TRG_ALREADY_EXISTS
source: "Trigger '%s' already exists"
hindi: "TRIGGER '%s' पहले से मौजूद है"

# ER_TRG_DOES_NOT_EXIST
source: "Trigger does not exist"
hindi: "TRIGGER मौजूद नहीं है"

# ER_TRG_ON_VIEW_OR_TEMP_TABLE
source: "Trigger's '%-.192s' is a view, temporary table or sequence"
hindi: "Trigger का '%-.192s' एक व्यू, टेम्पररी टेबल या सीक्वेंस है"

# ER_DIVISION_BY_ZERO 22012
source: "Division by 0"
hindi: "0 से विभाजन"

# ER_FSEEK_FAIL
source: "Failed on fseek()"
hindi: "fseek() विफल रहा"

# ER_AUTOINC_READ_FAILED
source: "Failed to read auto-increment value from storage engine"
hindi: "स्टोरेज इंजन से auto-increment का मान पढ़ने में असफल रहे"

# ER_USERNAME
source: "user name"
hindi: "यूज़र का नाम"

# ER_HOSTNAME
source: "host name"
hindi: "होस्ट का नाम"

# ER_CREATE_FILEGROUP_FAILED
source: "Failed to create %s"
hindi: "%s को बनाने में असफल रहे"

# ER_DROP_FILEGROUP_FAILED
source: "Failed to drop %s"
hindi: "%s को हटाने में असफल रहे"

# ER_ALTER_FILEGROUP_FAILED
source: "Failed to alter: %s"
hindi: "%s को ALTER करने में असफल रहे"

# ER_EVENT_CANT_ALTER
source: "Failed to alter event '%-.192s'"
hindi: "'%-.192s' EVENT को ALTER करने में असफल रहे"

# ER_EVENT_DROP_FAILED
source: "Failed to drop %s"
hindi: "%s को हटाने में असफल रहे"

# ER_EVENT_OPEN_TABLE_FAILED
source: "Failed to open mysql.event"
hindi: "mysql.event को खोलने में असफल रहे"

# ER_EVENT_CANNOT_DELETE
source: "Failed to delete the event from mysql.event"
hindi: "EVENT को mysql.event से हटाने मैं असफल रहे"
