Repository: vladbogo/test-translation
Catalog: hun.xlf
Languages: hun

# ER_NO
source: "NO"
hun: "NEM"

# ER_YES
source: "YES"
hun: "IGEN"

# ER_CANT_CREATE_FILE
source: "Can't create file '%-.200s' (errno: %M)"
hun: "A '%-.200s' file nem hozhato letre (hibakod: %M)"

# ER_CANT_CREATE_TABLE
source: "Can't create table %`s.%`s (errno: %M)"
hun: "A %`s.%`s tabla nem hozhato letre (hibakod: %M)"

# ER_CANT_CREATE_DB
source: "Can't create database '%-.192s' (errno: %M)"
hun: "Az '%-.192s' adatbazis nem hozhato letre (hibakod: %M)"

# ER_DB_CREATE_EXISTS
source: "Can't create database '%-.192s'; database exists"
hun: "Az '%-.192s' adatbazis nem hozhato letre Az adatbazis mar letezik"

# ER_DB_DROP_EXISTS
source: "Can't drop database '%-.192s'; database doesn't exist"
hun: "A(z) '%-.192s' adatbazis nem szuntetheto meg. Az adatbazis nem letezik"

# ER_DB_DROP_DELETE
source: "Error dropping database (can't delete '%-.192s', errno: %M)"
hun: "Adatbazis megszuntetesi hiba ('%-.192s' nem torolheto, hibakod: %M)"

# ER_DB_DROP_RMDIR
source: "Error dropping database (can't rmdir '%-.192s', errno: %M)"
hun: "Adatbazis megszuntetesi hiba ('%-.192s' nem szuntetheto meg, hibakod: %M)"

# ER_CANT_DELETE_FILE
source: "Error on delete of '%-.192s' (errno: %M)"
hun: "Torlesi hiba: '%-.192s' (hibakod: %M)"

# ER_CANT_FIND_SYSTEM_REC
source: "Can't read record in system table"
hun: "Nem olvashato rekord a rendszertablaban"

# ER_CANT_GET_STAT
source: "Can't get status of '%-.200s' (errno: %M)"
hun: "A(z) '%-.200s' statusza nem allapithato meg (hibakod: %M)"

# ER_CANT_GET_WD
source: "Can't get working directory (errno: %M)"
hun: "A munkakonyvtar nem allapithato meg (hibakod: %M)"

# ER_CANT_LOCK
source: "Can't lock file (errno: %M)"
hun: "A file nem zarolhato. (hibakod: %M)"

# ER_CANT_OPEN_FILE
source: "Can't open file: '%-.200s' (errno: %M)"
hun: "A '%-.200s' file nem nyithato meg (hibakod: %M)"

# ER_FILE_NOT_FOUND
source: "Can't find file: '%-.200s' (errno: %M)"
hun: "A(z) '%-.200s' file nem talalhato (hibakod: %M)"

# ER_CANT_READ_DIR
source: "Can't read dir of '%-.192s' (errno: %M)"
hun: "A(z) '%-.192s' konyvtar nem olvashato. (hibakod: %M)"

# ER_CANT_SET_WD
source: "Can't change dir to '%-.192s' (errno: %M)"
hun: "Konyvtarvaltas nem lehetseges a(z) '%-.192s'-ba. (hibakod: %M)"

# ER_CHECKREAD
source: "Record has changed since last read in table '%-.192s'"
hun: "A(z) '%-.192s' tablaban talalhato rekord megvaltozott az utolso olvasas ota"

# ER_DISK_FULL
source: "Disk full (%s); waiting for someone to free some space... (errno: %M)"
hun: "A lemez megtelt (%s). (hibakod: %M)"

# ER_DUP_KEY 23000
source: "Can't write; duplicate key in table '%-.192s'"
hun: "Irasi hiba, duplikalt kulcs a '%-.192s' tablaban"

# ER_ERROR_ON_CLOSE
source: "Error on close of '%-.192s' (errno: %M)"
hun: "Hiba a(z) '%-.192s' zarasakor. (hibakod: %M)"

# ER_ERROR_ON_READ
source: "Error reading file '%-.200s' (errno: %M)"
hun: "Hiba a '%-.200s'file olvasasakor. (hibakod: %M)"

# ER_ERROR_ON_RENAME
source: "Error on rename of '%-.210s' to '%-.210s' (errno: %M)"
hun: "Hiba a '%-.210s' file atnevezesekor '%-.210s'. (hibakod: %M)"

# ER_ERROR_ON_WRITE
source: "Error writing file '%-.200s' (errno: %M)"
hun: "Hiba a '%-.200s' file irasakor. (hibakod: %M)"

# ER_FILE_USED
source: "'%-.192s' is locked against change"
hun: "'%-.192s' a valtoztatas ellen zarolva"

# ER_FILSORT_ABORT
source: "Sort aborted"
hun: "Sikertelen rendezes"

# ER_FORM_NOT_FOUND
source: "View '%-.192s' doesn't exist for '%-.192s'"
hun: "A(z) '%-.192s' nezet nem letezik a(z) '%-.192s'-hoz"

# ER_KEY_NOT_FOUND
source: "Can't find record in '%-.192s'"
hun: "Nem talalhato a rekord '%-.192s'-ben"

# ER_NOT_FORM_FILE
source: "Incorrect information in file: '%-.200s'"
hun: "Ervenytelen info a file-ban: '%-.200s'"

# ER_NOT_KEYFILE
source: "Index for table '%-.200s' is corrupt; try to repair it"
hun: "Ervenytelen kulcsfile a tablahoz: '%-.200s'; probalja kijavitani!"

# ER_OLD_KEYFILE
source: "Old key file for table '%-.192s'; repair it!"
hun: "Regi kulcsfile a '%-.192s'tablahoz; probalja kijavitani!"

# ER_OPEN_AS_READONLY
source: "Table '%-.192s' is read only"
hun: "'%-.192s' irasvedett"

# ER_OUTOFMEMORY HY001 S1001
source: "Out of memory; restart server and try again (needed %d bytes)"
hun: "Nincs eleg memoria. Inditsa ujra a demont, es probalja ismet. (%d byte szukseges.)"

# ER_OUT_OF_SORTMEMORY HY001 S1001
source: "Out of sort memory, consider increasing server sort buffer size"
hun: "Nincs eleg memoria a rendezeshez. Novelje a rendezo demon puffermeretet"

# ER_UNEXPECTED_EOF
source: "Unexpected EOF found when reading file '%-.192s' (errno: %M)"
hun: "Varatlan filevege-jel a '%-.192s'olvasasakor. (hibakod: %M)"

# ER_CON_COUNT_ERROR 08004
source: "Too many connections"
hun: "Tul sok kapcsolat"

# ER_OUT_OF_RESOURCES
source: "Out of memory."
hun: "Elfogyott a thread-memoria"

# ER_BAD_HOST_ERROR 08S01
source: "Can't get hostname for your address"
hun: "A gepnev nem allapithato meg a cimbol"

# ER_HANDSHAKE_ERROR 08S01
source: "Bad handshake"
hun: "A kapcsolatfelvetel nem sikerult (Bad handshake)"

# ER_DBACCESS_DENIED_ERROR 42000
source: "Access denied for user '%s'@'%s' to database '%-.192s'"
hun: "A(z) '%s'@'%s' felhasznalo szamara tiltott eleres az '%-.192s' adabazishoz"

# ER_ACCESS_DENIED_ERROR 28000
source: "Access denied for user '%s'@'%s' (using password: %s)"
hun: "A(z) '%s'@'%s' felhasznalo szamara tiltott eleres. (Hasznalja a jelszot: %s)"

# ER_NO_DB_ERROR 3D000
source: "No database selected"
hun: "Nincs kivalasztott adatbazis"

# ER_UNKNOWN_COM_ERROR 08S01
source: "Unknown command"
hun: "Ervenytelen parancs"

# ER_BAD_NULL_ERROR 23000
source: "Column '%-.192s' cannot be null"
hun: "A(z) '%-.192s' oszlop erteke nem lehet nulla"

# ER_BAD_DB_ERROR 42000
source: "Unknown database '%-.192s'"
hun: "Ervenytelen adatbazis: '%-.192s'"

# ER_TABLE_EXISTS_ERROR 42S01
source: "Table '%-.192s' already exists"
hun: "A(z) '%-.192s' tabla mar letezik"

# ER_BAD_TABLE_ERROR 42S02
source: "Unknown table '%-.100T'"
hun: "Ervenytelen tabla: '%-.100T'"

# ER_NON_UNIQ_ERROR 23000
source: "Column '%-.192s' in %-.192s is ambiguous"
hun: "A(z) '%-.192s' oszlop %-.192s-ben ketertelmu"

# ER_SERVER_SHUTDOWN 08S01
source: "Server shutdown in progress"
hun: "A szerver leallitasa folyamatban"

# ER_BAD_FIELD_ERROR 42S22 S0022
source: "Unknown column '%-.192s' in '%-.192s'"
hun: "A(z) '%-.192s' oszlop ervenytelen '%-.192s'-ben"

# ER_WRONG_FIELD_WITH_GROUP 42000 S1009
source: "'%-.192s' isn't in GROUP BY"
hun: "Used '%-.192s' with wasn't in group by"

# ER_WRONG_GROUP_FIELD 42000 S1009
source: "Can't group on '%-.192s'"
hun: "A group nem hasznalhato: '%-.192s'"

# ER_WRONG_VALUE_COUNT 21S01
source: "Column count doesn't match value count"
hun: "Az oszlopban levo ertek nem egyezik meg a szamitott ertekkel"

# ER_TOO_LONG_IDENT 42000 S1009
source: "Identifier name '%-.100T' is too long"
hun: "A(z) '%-.100T' azonositonev tul hosszu"

# ER_DUP_FIELDNAME 42S21 S1009
source: "Duplicate column name '%-.192s'"
hun: "Duplikalt oszlopazonosito: '%-.192s'"

# ER_DUP_KEYNAME 42000 S1009
source: "Duplicate key name '%-.192s'"
hun: "Duplikalt kulcsazonosito: '%-.192s'"

# ER_DUP_ENTRY 23000 S1009
source: "Duplicate entry '%-.192T' for key %d"
hun: "Duplikalt bejegyzes '%-.192T' a %d kulcs szerint"

# ER_WRONG_FIELD_SPEC 42000 S1009
source: "Incorrect column specifier for column '%-.192s'"
hun: "Rossz oszlopazonosito: '%-.192s'"

# ER_PARSE_ERROR 42000 s1009
source: "%s near '%-.80T' at line %d"
hun: "A %s a '%-.80T'-hez kozeli a %d sorban"

# ER_EMPTY_QUERY 42000
source: "Query was empty"
hun: "Ures lekerdezes"

# ER_NONUNIQ_TABLE 42000 S1009
source: "Not unique table/alias: '%-.192s'"
hun: "Nem egyedi tabla/alias: '%-.192s'"

# ER_INVALID_DEFAULT 42000 S1009
source: "Invalid default value for '%-.192s'"
hun: "Ervenytelen ertek: '%-.192s'"

# ER_MULTIPLE_PRI_KEY 42000 S1009
source: "Multiple primary key defined"
hun: "Tobbszoros elsodleges kulcs definialas"

# ER_TOO_MANY_KEYS 42000 S1009
source: "Too many keys specified; max %d keys allowed"
hun: "Tul sok kulcs. Maximum %d kulcs engedelyezett"

# ER_TOO_MANY_KEY_PARTS 42000 S1009
source: "Too many key parts specified; max %d parts allowed"
hun: "Tul sok kulcsdarabot definialt. Maximum %d resz engedelyezett"

# ER_TOO_LONG_KEY 42000 S1009
source: "Specified key was too long; max key length is %d bytes"
hun: "A megadott kulcs tul hosszu. Maximalis kulcshosszusag: %d"

# ER_KEY_COLUMN_DOES_NOT_EXIST 42000 S1009
source: "Key column '%-.192s' doesn't exist in table"
hun: "A(z) '%-.192s'kulcsoszlop nem letezik a tablaban"

# ER_TOO_BIG_FIELDLENGTH 42000 S1009
source: "Column length too big for column '%-.192s' (max = %lu); use BLOB or TEXT instead"
hun: "A(z) '%-.192s' oszlop tul hosszu. (maximum = %lu). Hasznaljon BLOB tipust inkabb"

# ER_WRONG_AUTO_KEY 42000 S1009
source: "Incorrect table definition; there can be only one auto column and it must be defined as a key"
hun: "Csak egy auto mezo lehetseges, es azt kulcskent kell definialni"

# ER_NORMAL_SHUTDOWN
source: "%s (initiated by: %s): Normal shutdown"
hun: "%s (%s): Normal leallitas"

# ER_GOT_SIGNAL
source: "%s: Got signal %d. Aborting!\n"
hun: "%s: %d jelzes. Megszakitva!\n"

# ER_SHUTDOWN_COMPLETE
source: "%s: Shutdown complete\n"
hun: "%s: A leallitas kesz\n"

# ER_FORCING_CLOSE 08S01
source: "%s: Forcing close of thread %ld user: '%-.48s'\n"
hun: "%s: A(z) %ld thread kenyszeritett zarasa. Felhasznalo: '%-.48s'\n"

# ER_IPSOCK_ERROR 08S01
source: "Can't create IP socket"
hun: "Az IP socket nem hozhato letre"

# ER_NO_SUCH_INDEX 42S12 S1009
source: "Table '%-.192s' has no index like the one used in CREATE INDEX; recreate the table"
hun: "A(z) '%-.192s' tablahoz nincs meg a CREATE INDEX altal hasznalt index. Alakitsa at a tablat"

# ER_WRONG_FIELD_TERMINATORS 42000 S1009
source: "Field separator argument is not what is expected; check the manual"
hun: "A mezoelvalaszto argumentumok nem egyeznek meg a varttal. Nezze meg a kezikonyvben!"

# ER_BLOBS_AND_NO_TERMINATED 42000 S1009
source: "You can't use fixed rowlength with BLOBs; please use 'fields terminated by'"
hun: "Fix hosszusagu BLOB-ok nem hasznalhatok. Hasznalja a 'mezoelvalaszto jelet' "

# ER_TEXTFILE_NOT_READABLE
source: "The file '%-.128s' must be in the database directory or be readable by all"
hun: "A(z) '%-.128s'-nak az adatbazis konyvtarban kell lennie, vagy mindenki szamara olvashatonak"

# ER_FILE_EXISTS_ERROR
source: "File '%-.200s' already exists"
hun: "A '%-.200s' file mar letezik"

# ER_LOAD_INFO
source: "Records: %ld Deleted: %ld Skipped: %ld Warnings: %ld"
hun: "Rekordok: %ld Torolve: %ld Skipped: %ld Warnings: %ld"

# ER_ALTER_INFO
source: "Records: %ld Duplicates: %ld"
hun: "Rekordok: %ld Duplikalva: %ld"

# ER_WRONG_SUB_KEY
source: "Incorrect prefix key; the used key part isn't a string, the used length is longer than the key part, or the storage engine doesn't support unique prefix keys"
hun: "Rossz alkulcs. A hasznalt kulcsresz nem karaktersorozat vagy hosszabb, mint a kulcsresz"

# ER_CANT_REMOVE_ALL_FIELDS 42000
source: "You can't delete all columns with ALTER TABLE; use DROP TABLE instead"
hun: "Az osszes mezo nem torolheto az ALTER TABLE-lel. Hasznalja a DROP TABLE-t helyette"

# ER_CANT_DROP_FIELD_OR_KEY 42000
source: "Can't DROP %s %`-.192s; check that it exists"
hun: "A DROP %s %`-.192s nem lehetseges. Ellenorizze, hogy a mezo/kulcs letezik-e"

# ER_INSERT_INFO
source: "Records: %ld Duplicates: %ld Warnings: %ld"
hun: "Rekordok: %ld Duplikalva: %ld Warnings: %ld"

# ER_NO_SUCH_THREAD
source: "Unknown thread id: %lu"
hun: "Ervenytelen szal (thread) id: %lu"

# ER_KILL_DENIED_ERROR
source: "You are not owner of thread %lld"
hun: "A %lld thread-nek mas a tulajdonosa"

# ER_NO_TABLES_USED
source: "No tables used"
hun: "Nincs hasznalt tabla"

# ER_TOO_BIG_SET
source: "Too many strings for column %-.192s and SET"
hun: "Tul sok karakter: %-.192s es SET"

# ER_NO_UNIQUE_LOGFILE
source: "Can't generate a unique log-filename %-.200s.(1-999)\n"
hun: "Egyedi log-filenev nem generalhato: %-.200s.(1-999)\n"

# ER_TABLE_NOT_LOCKED_FOR_WRITE
source: "Table '%-.192s' was locked with a READ lock and can't be updated"
hun: "A(z) '%-.192s' tabla zarolva lett (READ lock) es nem lehet frissiteni"

# ER_TABLE_NOT_LOCKED
source: "Table '%-.192s' was not locked with LOCK TABLES"
hun: "A(z) '%-.192s' tabla nincs zarolva a LOCK TABLES-szel"

# ER_WRONG_DB_NAME 42000
source: "Incorrect database name '%-.100T'"
hun: "Hibas adatbazisnev: '%-.100T'"

# ER_WRONG_TABLE_NAME 42000
source: "Incorrect table name '%-.100s'"
hun: "Hibas tablanev: '%-.100s'"

# ER_TOO_BIG_SELECT 42000
source: "The SELECT would examine more than MAX_JOIN_SIZE rows; check your WHERE and use SET SQL_BIG_SELECTS=1 or SET MAX_JOIN_SIZE=# if the SELECT is okay"
hun: "A SELECT tul sok rekordot fog megvizsgalni es nagyon sokaig fog tartani. Ellenorizze a WHERE-t es hasznalja a SET SQL_BIG_SELECTS=1 beallitast, ha a SELECT okay"

# ER_UNKNOWN_ERROR
source: "Unknown error"
hun: "Ismeretlen hiba"

# ER_UNKNOWN_PROCEDURE 42000
source: "Unknown procedure '%-.192s'"
hun: "Ismeretlen eljaras: '%-.192s'"

# ER_WRONG_PARAMCOUNT_TO_PROCEDURE 42000
source: "Incorrect parameter count to procedure '%-.192s'"
hun: "Rossz parameter a(z) '%-.192s'eljaras szamitasanal"

# ER_WRONG_PARAMETERS_TO_PROCEDURE
source: "Incorrect parameters to procedure '%-.192s'"
hun: "Rossz parameter a(z) '%-.192s' eljarasban"

# ER_UNKNOWN_TABLE 42S02
source: "Unknown table '%-.192s' in %-.32s"
hun: "Ismeretlen tabla: '%-.192s' %-.32s-ban"

# ER_FIELD_SPECIFIED_TWICE 42000
source: "Column '%-.192s' specified twice"
hun: "A(z) '%-.192s' mezot ketszer definialta"

# ER_INVALID_GROUP_FUNC_USE
source: "Invalid use of group function"
hun: "A group funkcio ervenytelen hasznalata"

# ER_UNSUPPORTED_EXTENSION 42000
source: "Table '%-.192s' uses an extension that doesn't exist in this MariaDB version"
hun: "A(z) '%-.192s' tabla olyan bovitest hasznal, amely nem letezik ebben a MariaDB versioban"

# ER_TABLE_MUST_HAVE_COLUMNS 42000
source: "A table must have at least 1 column"
hun: "A tablanak legalabb egy oszlopot tartalmazni kell"

# ER_RECORD_FILE_FULL
source: "The table '%-.192s' is full"
hun: "A '%-.192s' tabla megtelt"

# ER_UNKNOWN_CHARACTER_SET 42000
source: "Unknown character set: '%-.64s'"
hun: "Ervenytelen karakterkeszlet: '%-.64s'"

# ER_TOO_MANY_TABLES
source: "Too many tables; MariaDB can only use %d tables in a join"
hun: "Tul sok tabla. A MariaDB csak %d tablat tud kezelni osszefuzeskor"

# ER_TOO_MANY_FIELDS
source: "Too many columns"
hun: "Tul sok mezo"

# ER_TOO_BIG_ROWSIZE 42000
source: "Row size too large. The maximum row size for the used table type, not counting BLOBs, is %ld. This includes storage overhead, check the manual. You have to change some columns to TEXT or BLOBs"
hun: "Tul nagy sormeret. A maximalis sormeret (nem szamolva a blob objektumokat) %ld. Nehany mezot meg kell valtoztatnia"

# ER_STACK_OVERRUN
source: "Thread stack overrun: Used: %ld of a %ld stack. Use 'mariadbd --thread_stack=#' to specify a bigger stack if needed"
hun: "Thread verem tullepes: Used: %ld of a %ld stack. Hasznalja a 'mariadbd --thread_stack=#' nagyobb verem definialasahoz"

# ER_WRONG_OUTER_JOIN 42000
source: "Cross dependency found in OUTER JOIN; examine your ON conditions"
hun: "Keresztfuggoseg van az OUTER JOIN-ban. Ellenorizze az ON felteteleket"

# ER_CANT_FIND_UDF
source: "Can't load function '%-.192s'"
hun: "A(z) '%-.192s' fuggveny nem toltheto be"

# ER_CANT_INITIALIZE_UDF
source: "Can't initialize function '%-.192s'; %-.80s"
hun: "A(z) '%-.192s' fuggveny nem inicializalhato; %-.80s"

# ER_UDF_NO_PATHS
source: "No paths allowed for shared library"
hun: "Nincs ut a megosztott konyvtarakhoz (shared library)"

# ER_UDF_EXISTS
source: "Function '%-.192s' already exists"
hun: "A '%-.192s' fuggveny mar letezik"

# ER_CANT_OPEN_LIBRARY
source: "Can't open shared library '%-.192s' (errno: %d, %-.128s)"
hun: "A(z) '%-.192s' megosztott konyvtar nem hasznalhato (hibakod: %d, %-.128s)"

# ER_CANT_FIND_DL_ENTRY
source: "Can't find symbol '%-.128s' in library"
hun: "A(z) '%-.128s' fuggveny nem talalhato a konyvtarban"

# ER_FUNCTION_NOT_DEFINED
source: "Function '%-.192s' is not defined"
hun: "A '%-.192s' fuggveny nem definialt"

# ER_HOST_IS_BLOCKED
source: "Host '%-.64s' is blocked because of many connection errors; unblock with 'mariadb-admin flush-hosts'"
hun: "A '%-.64s' host blokkolodott, tul sok kapcsolodasi hiba miatt. Hasznalja a 'mariadb-admin flush-hosts' parancsot"

# ER_HOST_NOT_PRIVILEGED
source: "Host '%-.64s' is not allowed to connect to this MariaDB server"
hun: "A '%-.64s' host szamara nem engedelyezett a kapcsolodas ehhez a MariaDB szerverhez"

# ER_PASSWORD_ANONYMOUS_USER 42000
source: "You are using MariaDB as an anonymous user and anonymous users are not allowed to modify user settings"
hun: "Nevtelen (anonymous) felhasznalokent nem negedelyezett a jelszovaltoztatas"

# ER_PASSWORD_NOT_ALLOWED 42000
source: "You must have privileges to update tables in the mysql database to be able to change passwords for others"
hun: "Onnek tabla-update joggal kell rendelkeznie a mysql adatbazisban masok jelszavanak megvaltoztatasahoz"

# ER_PASSWORD_NO_MATCH 28000
source: "Can't find any matching row in the user table"
hun: "Nincs megegyezo sor a user tablaban"

# ER_UPDATE_INFO
source: "Rows matched: %ld Changed: %ld Warnings: %ld"
hun: "Megegyezo sorok szama: %ld Valtozott: %ld Warnings: %ld"

# ER_CANT_CREATE_THREAD
source: "Can't create a new thread (errno %M); if you are not out of available memory, you can consult the manual for a possible OS-dependent bug"
hun: "Uj thread letrehozasa nem lehetseges (Hibakod: %M). Amenyiben van meg szabad memoria, olvassa el a kezikonyv operacios rendszerfuggo hibalehetosegekrol szolo reszet"

# ER_WRONG_VALUE_COUNT_ON_ROW 21S01
source: "Column count doesn't match value count at row %lu"
hun: "Az oszlopban talalhato ertek nem egyezik meg a %lu sorban szamitott ertekkel"

# ER_CANT_REOPEN_TABLE
source: "Can't reopen table: '%-.192s'"
hun: "Nem lehet ujra-megnyitni a tablat: '%-.192s"

# ER_INVALID_USE_OF_NULL 22004
source: "Invalid use of NULL value"
hun: "A NULL ervenytelen hasznalata"

# ER_REGEXP_ERROR 42000
source: "Regex error '%s'"
hun: "'%s' hiba a regularis kifejezes hasznalata soran (regexp)"

# ER_MIX_OF_GROUP_FUNC_AND_FIELDS 42000
source: "Mixing of GROUP columns (MIN(),MAX(),COUNT(),...) with no GROUP columns is illegal if there is no GROUP BY clause"
hun: "A GROUP mezok (MIN(),MAX(),COUNT()...) kevert hasznalata nem lehetseges GROUP BY hivatkozas nelkul"

# ER_NONEXISTING_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s'"
hun: "A '%-.48s' felhasznalonak nincs ilyen joga a '%-.64s' host-on"

# ER_TABLEACCESS_DENIED_ERROR 42000
source: "%-.100T command denied to user '%s'@'%s' for table '%-.192s'"
hun: "%-.100T parancs a '%s'@'%s' felhasznalo szamara nem engedelyezett a '%-.192s' tablaban"

# ER_COLUMNACCESS_DENIED_ERROR 42000
source: "%-.32s command denied to user '%s'@'%s' for column '%-.192s' in table '%-.192s'"
hun: "%-.32s parancs a '%s'@'%s' felhasznalo szamara nem engedelyezett a '%-.192s' mezo eseten a '%-.192s' tablaban"

# ER_ILLEGAL_GRANT_FOR_TABLE 42000
source: "Illegal GRANT/REVOKE command; please consult the manual to see which privileges can be used"
hun: "Ervenytelen GRANT/REVOKE parancs. Kerem, nezze meg a kezikonyvben, milyen jogok lehetsegesek"

# ER_GRANT_WRONG_HOST_OR_USER 42000
source: "The host or user argument to GRANT is too long"
hun: "A host vagy felhasznalo argumentuma tul hosszu a GRANT parancsban"

# ER_NO_SUCH_TABLE 42S02
source: "Table '%-.192s.%-.192s' doesn't exist"
hun: "A '%-.192s.%-.192s' tabla nem letezik"

# ER_NONEXISTING_TABLE_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s' on table '%-.192s'"
hun: "A '%-.48s' felhasznalo szamara a '%-.64s' host '%-.192s' tablajaban ez a parancs nem engedelyezett"

# ER_NOT_ALLOWED_COMMAND 42000
source: "The used command is not allowed with this MariaDB version"
hun: "A hasznalt parancs nem engedelyezett ebben a MariaDB verzioban"

# ER_SYNTAX_ERROR 42000
source: "You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use"
hun: "Szintaktikai hiba"

# ER_DELAYED_CANT_CHANGE_LOCK
source: "Delayed insert thread couldn't get requested lock for table %-.192s"
hun: "A kesleltetett beillesztes (delayed insert) thread nem kapott zatolast a %-.192s tablahoz"

# ER_TOO_MANY_DELAYED_THREADS
source: "Too many delayed threads in use"
hun: "Tul sok kesletetett thread (delayed)"

# ER_ABORTING_CONNECTION 08S01
source: "Aborted connection %ld to db: '%-.192s' user: '%-.48s' (%-.64s)"
hun: "Megszakitott kapcsolat %ld db: '%-.192s' adatbazishoz, felhasznalo: '%-.48s' (%-.64s)"

# ER_NET_PACKET_TOO_LARGE 08S01
source: "Got a packet bigger than 'max_allowed_packet' bytes"
hun: "A kapott csomag nagyobb, mint a maximalisan engedelyezett: 'max_allowed_packet'"

# ER_NET_READ_ERROR_FROM_PIPE 08S01
source: "Got a read error from the connection pipe"
hun: "Olvasasi hiba a kapcsolat soran"

# ER_NET_FCNTL_ERROR 08S01
source: "Got an error from fcntl()"
hun: "Hiba a fcntl() fuggvenyben"

# ER_NET_PACKETS_OUT_OF_ORDER 08S01
source: "Got packets out of order"
hun: "Helytelen sorrendben erkezett adatcsomagok"

# ER_NET_UNCOMPRESS_ERROR 08S01
source: "Couldn't uncompress communication packet"
hun: "A kommunikacios adatcsomagok nem tomorithetok ki"

# ER_NET_READ_ERROR 08S01
source: "Got an error reading communication packets"
hun: "HIba a kommunikacios adatcsomagok olvasasa soran"

# ER_NET_READ_INTERRUPTED 08S01
source: "Got timeout reading communication packets"
hun: "Idotullepes a kommunikacios adatcsomagok olvasasa soran"

# ER_NET_ERROR_ON_WRITE 08S01
source: "Got an error writing communication packets"
hun: "Hiba a kommunikacios csomagok irasa soran"

# ER_NET_WRITE_INTERRUPTED 08S01
source: "Got timeout writing communication packets"
hun: "Idotullepes a kommunikacios csomagok irasa soran"

# ER_TOO_LONG_STRING 42000
source: "Result string is longer than 'max_allowed_packet' bytes"
hun: "Ez eredmeny sztring nagyobb, mint a lehetseges maximum: 'max_allowed_packet'"

# ER_TABLE_CANT_HANDLE_BLOB 42000
source: "Storage engine %s doesn't support BLOB/TEXT columns"
hun: "A hasznalt tabla tipus (%s) nem tamogatja a BLOB/TEXT mezoket"

# ER_TABLE_CANT_HANDLE_AUTO_INCREMENT 42000
source: "Storage engine %s doesn't support AUTO_INCREMENT columns"
hun: "A hasznalt tabla tipus (%s) nem tamogatja az AUTO_INCREMENT tipusu mezoket"

# ER_DELAYED_INSERT_TABLE_LOCKED
source: "INSERT DELAYED can't be used with table '%-.192s' because it is locked with LOCK TABLES"
hun: "Az INSERT DELAYED nem hasznalhato a '%-.192s' tablahoz, mert a tabla zarolt (LOCK TABLES)"

# ER_WRONG_COLUMN_NAME 42000
source: "Incorrect column name '%-.100s'"
hun: "Ervenytelen mezonev: '%-.100s'"

# ER_WRONG_MRG_TABLE
source: "Unable to open underlying table which is differently defined or of non-MyISAM type or doesn't exist"
hun: "A MERGE tablaban talalhato tablak definicioja nem azonos"

# ER_DUP_UNIQUE 23000
source: "Can't write, because of unique constraint, to table '%-.192s'"
hun: "A '%-.192s' nem irhato, az egyedi mezok miatt"

# ER_BLOB_KEY_WITHOUT_LENGTH 42000
source: "BLOB/TEXT column '%-.192s' used in key specification without a key length"
hun: "BLOB mezo '%-.192s' hasznalt a mezo specifikacioban, a mezohossz megadasa nelkul"

# ER_PRIMARY_CANT_HAVE_NULL 42000
source: "All parts of a PRIMARY KEY must be NOT NULL; if you need NULL in a key, use UNIQUE instead"
hun: "Az elsodleges kulcs teljes egeszeben csak NOT NULL tipusu lehet; Ha NULL mezot szeretne a kulcskent, hasznalja inkabb a UNIQUE-ot"

# ER_TOO_MANY_ROWS 42000
source: "Result consisted of more than one row"
hun: "Az eredmeny tobb, mint egy sort tartalmaz"
