Repository: vladbogo/test-translation
Catalog: hun.xlf
Languages: hun

# ER_REQUIRES_PRIMARY_KEY 42000
source: "This table type requires a primary key"
hun: "Az adott tablatipushoz elsodleges kulcs hasznalata kotelezo"

# ER_NO_RAID_COMPILED
source: "This version of MariaDB is not compiled with RAID support"
hun: "Ezen leforditott MariaDB verzio nem tartalmaz RAID support-ot"

# ER_UPDATE_WITHOUT_KEY_IN_SAFE_MODE
source: "You are using safe update mode and you tried to update a table without a WHERE that uses a KEY column"
hun: "On a biztonsagos update modot hasznalja, es WHERE that uses a KEY column"

# ER_KEY_DOES_NOT_EXISTS 42000 S1009
source: "Key '%-.192s' doesn't exist in table '%-.192s'"
hun: "A '%-.192s' kulcs nem letezik a '%-.192s' tablaban"

# ER_CHECK_NO_SUCH_TABLE 42000
source: "Can't open table"
hun: "Nem tudom megnyitni a tablat"

# ER_CHECK_NOT_IMPLEMENTED 42000
source: "The storage engine for the table doesn't support %s"
hun: "A tabla kezeloje (handler) nem tamogatja az %s"

# ER_CANT_DO_THIS_DURING_AN_TRANSACTION 25000
source: "You are not allowed to execute this command in a transaction"
hun: "Az On szamara nem engedelyezett a parancs vegrehajtasa a tranzakcioban"

# ER_ERROR_DURING_COMMIT
source: "Got error %M during COMMIT"
hun: "%M hiba a COMMIT vegrehajtasa soran"

# ER_ERROR_DURING_ROLLBACK
source: "Got error %M during ROLLBACK"
hun: "%M hiba a ROLLBACK vegrehajtasa soran"

# ER_ERROR_DURING_FLUSH_LOGS
source: "Got error %M during FLUSH_LOGS"
hun: "%M hiba a FLUSH_LOGS vegrehajtasa soran"

# ER_ERROR_DURING_CHECKPOINT
source: "Got error %M during CHECKPOINT"
hun: "%M hiba a CHECKPOINT vegrehajtasa soran"

# ER_NO_REFERENCED_ROW 23000
source: "Cannot add or update a child row: a foreign key constraint fails"
hun: "Cannot add a child row: a foreign key constraint fails"

# ER_ROW_IS_REFERENCED 23000
source: "Cannot delete or update a parent row: a foreign key constraint fails"
hun: "Cannot delete a parent row: a foreign key constraint fails"

# ER_DUP_ENTRY_WITH_KEY_NAME 23000 S1009
source: "Duplicate entry '%-.64T' for key '%-.192s'"
hun: "Duplikalt bejegyzes '%-.64T' a '%-.192s' kulcs szerint"

# ER_ACCESS_DENIED_NO_PASSWORD_ERROR 28000
source: "Access denied for user '%s'@'%s'"
hun: "A(z) '%s'@'%s' felhasznalo szamara tiltott eleres"

# ER_DUP_UNKNOWN_IN_INDEX 23000
source: "Duplicate entry for key '%-.192s'"
hun: "Duplikalt bejegyzes a '%-.192s' kulcs szerint"
