Repository: vladbogo/test-translation
Catalog: ita.xlf
Languages: ita

# ER_DUP_UNIQUE 23000
source: "Can't write, because of unique constraint, to table '%-.192s'"
ita: "Impossibile scrivere nella tabella '%-.192s' per limitazione di unicita`"

# ER_BLOB_KEY_WITHOUT_LENGTH 42000
source: "BLOB/TEXT column '%-.192s' used in key specification without a key length"
ita: "La colonna '%-.192s' di tipo BLOB e` usata in una chiave senza specificarne la lunghezza"

# ER_PRIMARY_CANT_HAVE_NULL 42000
source: "All parts of a PRIMARY KEY must be NOT NULL; if you need NULL in a key, use UNIQUE instead"
ita: "Tutte le parti di una chiave primaria devono essere dichiarate NOT NULL; se necessitano valori NULL nelle chiavi utilizzare UNIQUE"

# ER_TOO_MANY_ROWS 42000
source: "Result consisted of more than one row"
ita: "Il risultato consiste di piu` di una riga"

# ER_REQUIRES_PRIMARY_KEY 42000
source: "This table type requires a primary key"
ita: "Questo tipo di tabella richiede una chiave primaria"

# ER_NO_RAID_COMPILED
source: "This version of MariaDB is not compiled with RAID support"
ita: "Questa versione di MariaDB non e` compilata con il supporto RAID"

# ER_UPDATE_WITHOUT_KEY_IN_SAFE_MODE
source: "You are using safe update mode and you tried to update a table without a WHERE that uses a KEY column"
ita: "In modalita` 'safe update' si e` cercato di aggiornare una tabella senza clausola WHERE su una chiave"

# ER_KEY_DOES_NOT_EXISTS 42000 S1009
source: "Key '%-.192s' doesn't exist in table '%-.192s'"
ita: "La chiave '%-.192s' non esiste nella tabella '%-.192s'"

# ER_CHECK_NO_SUCH_TABLE 42000
source: "Can't open table"
ita: "Impossibile aprire la tabella"

# ER_CHECK_NOT_IMPLEMENTED 42000
source: "The storage engine for the table doesn't support %s"
ita: "Il gestore per la tabella non supporta il %s"

# ER_CANT_DO_THIS_DURING_AN_TRANSACTION 25000
source: "You are not allowed to execute this command in a transaction"
ita: "Non puoi eseguire questo comando in una transazione"

# ER_ERROR_DURING_COMMIT
source: "Got error %M during COMMIT"
ita: "Rilevato l'errore %M durante il COMMIT"

# ER_ERROR_DURING_ROLLBACK
source: "Got error %M during ROLLBACK"
ita: "Rilevato l'errore %M durante il ROLLBACK"

# ER_ERROR_DURING_FLUSH_LOGS
source: "Got error %M during FLUSH_LOGS"
ita: "Rilevato l'errore %M durante il FLUSH_LOGS"

# ER_ERROR_DURING_CHECKPOINT
source: "Got error %M during CHECKPOINT"
ita: "Rilevato l'errore %M durante il CHECKPOINT"

# ER_NEW_ABORTING_CONNECTION 08S01
source: "Aborted connection %lld to db: '%-.192s' user: '%-.48s' host: '%-.64s' (%-.64s)"
ita: "Interrotta la connessione %lld al db: ''%-.192s' utente: '%-.48s' host: '%-.64s' (%-.64s)"

# ER_INDEX_REBUILD
source: "Failed rebuilding the index of dumped table '%-.192s'"
ita: "Fallita la ricostruzione dell'indice della tabella copiata '%-.192s'"

# ER_MASTER
source: "Error from master: '%-.64s'"
ita: "Errore dal master: '%-.64s"

# ER_MASTER_NET_READ 08S01
source: "Net error reading from master"
ita: "Errore di rete durante la ricezione dal master"

# ER_MASTER_NET_WRITE 08S01
source: "Net error writing to master"
ita: "Errore di rete durante l'invio al master"

# ER_FT_MATCHING_KEY_NOT_FOUND
source: "Can't find FULLTEXT index matching the column list"
ita: "Impossibile trovare un indice FULLTEXT che corrisponda all'elenco delle colonne"

# ER_LOCK_OR_ACTIVE_TRANSACTION
source: "Can't execute the given command because you have active locked tables or an active transaction"
ita: "Impossibile eseguire il comando richiesto: tabelle sotto lock o transazione in atto"

# ER_UNKNOWN_SYSTEM_VARIABLE
source: "Unknown system variable '%-.*s'"
ita: "Variabile di sistema '%-.*s' sconosciuta"

# ER_CRASHED_ON_USAGE
source: "Table '%-.192s' is marked as crashed and should be repaired"
ita: "La tabella '%-.192s' e` segnalata come corrotta e deve essere riparata"

# ER_CRASHED_ON_REPAIR
source: "Table '%-.192s' is marked as crashed and last (automatic?) repair failed"
ita: "La tabella '%-.192s' e` segnalata come corrotta e l'ultima ricostruzione (automatica?) e` fallita"

# ER_WARNING_NOT_COMPLETE_ROLLBACK
source: "Some non-transactional changed tables couldn't be rolled back"
ita: "Attenzione: Alcune delle modifiche alle tabelle non transazionali non possono essere ripristinate (roll back impossibile)"

# ER_TRANS_CACHE_FULL
source: "Multi-statement transaction required more than 'max_binlog_cache_size' bytes of storage; increase this mariadbd variable and try again"
ita: "La transazione a comandi multipli (multi-statement) ha richiesto piu` di 'max_binlog_cache_size' bytes di disco: aumentare questa variabile di mariadbd e riprovare"

# ER_SLAVE_MUST_STOP
source: "This operation cannot be performed as you have a running slave '%2$*1$s'; run STOP SLAVE '%2$*1$s' first"
ita: "Questa operazione non puo' essere eseguita con un database 'slave' '%2$*1$s' che gira, lanciare prima STOP SLAVE '%2$*1$s'"

# ER_SLAVE_NOT_RUNNING
source: "This operation requires a running slave; configure slave and do START SLAVE"
ita: "Questa operaione richiede un database 'slave', configurarlo ed eseguire START SLAVE"

# ER_BAD_SLAVE
source: "The server is not configured as slave; fix in config file or with CHANGE MASTER TO"
ita: "Il server non e' configurato come 'slave', correggere il file di configurazione cambiando CHANGE MASTER TO"

# ER_SLAVE_THREAD
source: "Could not create slave thread; check system resources"
ita: "Impossibile creare il thread 'slave', controllare le risorse di sistema"

# ER_TOO_MANY_USER_CONNECTIONS 42000
source: "User %-.64s already has more than 'max_user_connections' active connections"
ita: "L'utente %-.64s ha gia' piu' di 'max_user_connections' connessioni attive"

# ER_SET_CONSTANTS_ONLY
source: "You may only use constant expressions in this statement"
ita: "Si possono usare solo espressioni costanti con SET"

# ER_LOCK_WAIT_TIMEOUT
source: "Lock wait timeout exceeded; try restarting transaction"
ita: "E' scaduto il timeout per l'attesa del lock"

# ER_LOCK_TABLE_FULL
source: "The total number of locks exceeds the lock table size"
ita: "Il numero totale di lock e' maggiore della grandezza della tabella di lock"

# ER_READ_ONLY_TRANSACTION 25000
source: "Update locks cannot be acquired during a READ UNCOMMITTED transaction"
ita: "I lock di aggiornamento non possono essere acquisiti durante una transazione 'READ UNCOMMITTED'"

# ER_DROP_DB_WITH_READ_LOCK
source: "DROP DATABASE not allowed while thread is holding global read lock"
ita: "DROP DATABASE non e' permesso mentre il thread ha un lock globale di lettura"

# ER_CREATE_DB_WITH_READ_LOCK
source: "CREATE DATABASE not allowed while thread is holding global read lock"
ita: "CREATE DATABASE non e' permesso mentre il thread ha un lock globale di lettura"

# ER_WRONG_ARGUMENTS
source: "Incorrect arguments to %s"
ita: "Argomenti errati a %s"

# ER_NO_PERMISSION_TO_CREATE_USER 42000
source: "'%s'@'%s' is not allowed to create new users"
ita: "A '%s'@'%s' non e' permesso creare nuovi utenti"

# ER_UNION_TABLES_IN_DIFFERENT_DIR
source: "Incorrect table definition; all MERGE tables must be in the same database"
ita: "Definizione della tabella errata; tutte le tabelle di tipo MERGE devono essere nello stesso database"

# ER_LOCK_DEADLOCK 40001
source: "Deadlock found when trying to get lock; try restarting transaction"
ita: "Trovato deadlock durante il lock; Provare a far ripartire la transazione"

# ER_TABLE_CANT_HANDLE_FT
source: "The storage engine %s doesn't support FULLTEXT indexes"
ita: "La tabella usata (%s) non supporta gli indici FULLTEXT"

# ER_CANNOT_ADD_FOREIGN
source: "Cannot add foreign key constraint for `%s`"
ita: "Impossibile aggiungere il vincolo di integrita' referenziale (foreign key constraint) a `%s`"

# ER_NO_REFERENCED_ROW 23000
source: "Cannot add or update a child row: a foreign key constraint fails"
ita: "Impossibile aggiungere la riga: un vincolo d'integrita' referenziale non e' soddisfatto"

# ER_ROW_IS_REFERENCED 23000
source: "Cannot delete or update a parent row: a foreign key constraint fails"
ita: "Impossibile cancellare la riga: un vincolo d'integrita' referenziale non e' soddisfatto"

# ER_CONNECT_TO_MASTER 08S01
source: "Error connecting to master: %-.128s"
ita: "Errore durante la connessione al master: %-.128s"

# ER_QUERY_ON_MASTER
source: "Error running query on master: %-.128s"
ita: "Errore eseguendo una query sul master: %-.128s"

# ER_ERROR_WHEN_EXECUTING_COMMAND
source: "Error when executing command %s: %-.128s"
ita: "Errore durante l'esecuzione del comando %s: %-.128s"

# ER_WRONG_USAGE
source: "Incorrect usage of %s and %s"
ita: "Uso errato di %s e %s"

# ER_WRONG_NUMBER_OF_COLUMNS_IN_SELECT 21000
source: "The used SELECT statements have a different number of columns"
ita: "La SELECT utilizzata ha un numero di colonne differente"

# ER_CANT_UPDATE_WITH_READLOCK
source: "Can't execute the query because you have a conflicting read lock"
ita: "Impossibile eseguire la query perche' c'e' un conflitto con in lock di lettura"

# ER_MIXING_NOT_ALLOWED
source: "Mixing of transactional and non-transactional tables is disabled"
ita: "E' disabilitata la possibilita' di mischiare tabelle transazionali e non-transazionali"

# ER_DUP_ARGUMENT
source: "Option '%s' used twice in statement"
ita: "L'opzione '%s' e' stata usata due volte nel comando"

# ER_USER_LIMIT_REACHED 42000
source: "User '%-.64s' has exceeded the '%s' resource (current value: %ld)"
ita: "L'utente '%-.64s' ha ecceduto la risorsa '%s' (valore corrente: %ld)"

# ER_SPECIFIC_ACCESS_DENIED_ERROR 42000
source: "Access denied; you need (at least one of) the %-.128s privilege(s) for this operation"
ita: "Accesso non consentito. Serve il privilegio %-.128s per questa operazione"

# ER_LOCAL_VARIABLE
source: "Variable '%-.64s' is a SESSION variable and can't be used with SET GLOBAL"
ita: "La variabile '%-.64s' e' una variabile locale ( SESSION ) e non puo' essere cambiata usando SET GLOBAL"

# ER_GLOBAL_VARIABLE
source: "Variable '%-.64s' is a GLOBAL variable and should be set with SET GLOBAL"
ita: "La variabile '%-.64s' e' una variabile globale ( GLOBAL ) e deve essere cambiata usando SET GLOBAL"

# ER_NO_DEFAULT 42000
source: "Variable '%-.64s' doesn't have a default value"
ita: "La variabile '%-.64s' non ha un valore di default"

# ER_WRONG_VALUE_FOR_VAR 42000
source: "Variable '%-.64s' can't be set to the value of '%-.200T'"
ita: "Alla variabile '%-.64s' non puo' essere assegato il valore '%-.200T'"

# ER_WRONG_TYPE_FOR_VAR 42000
source: "Incorrect argument type to variable '%-.64s'"
ita: "Tipo di valore errato per la variabile '%-.64s'"

# ER_VAR_CANT_BE_READ
source: "Variable '%-.64s' can only be set, not read"
ita: "Alla variabile '%-.64s' e' di sola scrittura quindi puo' essere solo assegnato un valore, non letto"

# ER_CANT_USE_OPTION_HERE 42000
source: "Incorrect usage/placement of '%s'"
ita: "Uso/posizione di '%s' sbagliato"

# ER_NOT_SUPPORTED_YET 42000
source: "This version of MariaDB doesn't yet support '%s'"
ita: "Questa versione di MariaDB non supporta ancora '%s'"

# ER_MASTER_FATAL_ERROR_READING_BINLOG
source: "Got fatal error %d from master when reading data from binary log: '%-.320s'"
ita: "Errore fatale %d: '%-.320s' dal master leggendo i dati dal log binario"

# ER_DUP_ENTRY_WITH_KEY_NAME 23000 S1009
source: "Duplicate entry '%-.64T' for key '%-.192s'"
ita: "Valore duplicato '%-.64T' per la chiave '%-.192s'"

# ER_ACCESS_DENIED_NO_PASSWORD_ERROR 28000
source: "Access denied for user '%s'@'%s'"
ita: "Accesso non consentito per l'utente: '%s'@'%s'"

# ER_DUP_UNKNOWN_IN_INDEX 23000
source: "Duplicate entry for key '%-.192s'"
ita: "Valore duplicato per la chiave '%-.192s'"
