Repository: vladbogo/test-translation
Catalog: ita.xlf
Languages: ita

# ER_YES
source: "YES"
ita: "SI"

# ER_CANT_CREATE_FILE
source: "Can't create file '%-.200s' (errno: %M)"
ita: "Impossibile creare il file '%-.200s' (errno: %M)"

# ER_CANT_CREATE_TABLE
source: "Can't create table %`s.%`s (errno: %M)"
ita: "Impossibile creare la tabella %`s.%`s (errno: %M)"

# ER_CANT_CREATE_DB
source: "Can't create database '%-.192s' (errno: %M)"
ita: "Impossibile creare il database '%-.192s' (errno: %M)"

# ER_DB_CREATE_EXISTS
source: "Can't create database '%-.192s'; database exists"
ita: "Impossibile creare il database '%-.192s'; il database esiste"

# ER_DB_DROP_EXISTS
source: "Can't drop database '%-.192s'; database doesn't exist"
ita: "Impossibile cancellare '%-.192s'; il database non esiste"

# ER_DB_DROP_DELETE
source: "Error dropping database (can't delete '%-.192s', errno: %M)"
ita: "Errore durante la cancellazione del database (impossibile cancellare '%-.192s', errno: %M)"

# ER_DB_DROP_RMDIR
source: "Error dropping database (can't rmdir '%-.192s', errno: %M)"
ita: "Errore durante la cancellazione del database (impossibile rmdir '%-.192s', errno: %M)"

# ER_CANT_DELETE_FILE
source: "Error on delete of '%-.192s' (errno: %M)"
ita: "Errore durante la cancellazione di '%-.192s' (errno: %M)"

# ER_CANT_FIND_SYSTEM_REC
source: "Can't read record in system table"
ita: "Impossibile leggere il record dalla tabella di sistema"

# ER_CANT_GET_STAT
source: "Can't get status of '%-.200s' (errno: %M)"
ita: "Impossibile leggere lo stato di '%-.200s' (errno: %M)"

# ER_CANT_GET_WD
source: "Can't get working directory (errno: %M)"
ita: "Impossibile leggere la directory di lavoro (errno: %M)"

# ER_CANT_LOCK
source: "Can't lock file (errno: %M)"
ita: "Impossibile il locking il file (errno: %M)"

# ER_CANT_OPEN_FILE
source: "Can't open file: '%-.200s' (errno: %M)"
ita: "Impossibile aprire il file: '%-.200s' (errno: %M)"

# ER_FILE_NOT_FOUND
source: "Can't find file: '%-.200s' (errno: %M)"
ita: "Impossibile trovare il file: '%-.200s' (errno: %M)"

# ER_CANT_READ_DIR
source: "Can't read dir of '%-.192s' (errno: %M)"
ita: "Impossibile leggere la directory di '%-.192s' (errno: %M)"

# ER_CANT_SET_WD
source: "Can't change dir to '%-.192s' (errno: %M)"
ita: "Impossibile cambiare la directory in '%-.192s' (errno: %M)"

# ER_CHECKREAD
source: "Record has changed since last read in table '%-.192s'"
ita: "Il record e` cambiato dall'ultima lettura della tabella '%-.192s'"

# ER_DISK_FULL
source: "Disk full (%s); waiting for someone to free some space... (errno: %M)"
ita: "Disco pieno (%s). In attesa che qualcuno liberi un po' di spazio... (errno: %M)"

# ER_DUP_KEY 23000
source: "Can't write; duplicate key in table '%-.192s'"
ita: "Scrittura impossibile: chiave duplicata nella tabella '%-.192s'"

# ER_ERROR_ON_CLOSE
source: "Error on close of '%-.192s' (errno: %M)"
ita: "Errore durante la chiusura di '%-.192s' (errno: %M)"

# ER_ERROR_ON_READ
source: "Error reading file '%-.200s' (errno: %M)"
ita: "Errore durante la lettura del file '%-.200s' (errno: %M)"

# ER_ERROR_ON_RENAME
source: "Error on rename of '%-.210s' to '%-.210s' (errno: %M)"
ita: "Errore durante la rinominazione da '%-.210s' a '%-.210s' (errno: %M)"

# ER_ERROR_ON_WRITE
source: "Error writing file '%-.200s' (errno: %M)"
ita: "Errore durante la scrittura del file '%-.200s' (errno: %M)"

# ER_FILE_USED
source: "'%-.192s' is locked against change"
ita: "'%-.192s' e` soggetto a lock contro i cambiamenti"

# ER_FILSORT_ABORT
source: "Sort aborted"
ita: "Operazione di ordinamento abbandonata"

# ER_FORM_NOT_FOUND
source: "View '%-.192s' doesn't exist for '%-.192s'"
ita: "La view '%-.192s' non esiste per '%-.192s'"

# ER_GET_ERRNO
source: "Got error %M from storage engine %s"
ita: "Rilevato l'errore %M dal gestore delle tabelle %s"

# ER_KEY_NOT_FOUND
source: "Can't find record in '%-.192s'"
ita: "Impossibile trovare il record in '%-.192s'"

# ER_NOT_FORM_FILE
source: "Incorrect information in file: '%-.200s'"
ita: "Informazione errata nel file: '%-.200s'"

# ER_NOT_KEYFILE
source: "Index for table '%-.200s' is corrupt; try to repair it"
ita: "File chiave errato per la tabella : '%-.200s'; prova a riparalo"

# ER_OLD_KEYFILE
source: "Old key file for table '%-.192s'; repair it!"
ita: "File chiave vecchio per la tabella '%-.192s'; riparalo!"

# ER_OPEN_AS_READONLY
source: "Table '%-.192s' is read only"
ita: "'%-.192s' e` di sola lettura"

# ER_OUTOFMEMORY HY001 S1001
source: "Out of memory; restart server and try again (needed %d bytes)"
ita: "Memoria esaurita. Fai ripartire il demone e riprova (richiesti %d bytes)"

# ER_OUT_OF_SORTMEMORY HY001 S1001
source: "Out of sort memory, consider increasing server sort buffer size"
ita: "Memoria per gli ordinamenti esaurita. Incrementare il 'sort_buffer' al demone"

# ER_UNEXPECTED_EOF
source: "Unexpected EOF found when reading file '%-.192s' (errno: %M)"
ita: "Fine del file inaspettata durante la lettura del file '%-.192s' (errno: %M)"

# ER_CON_COUNT_ERROR 08004
source: "Too many connections"
ita: "Troppe connessioni"

# ER_OUT_OF_RESOURCES
source: "Out of memory."
ita: "Fine dello spazio/memoria per i thread"

# ER_BAD_HOST_ERROR 08S01
source: "Can't get hostname for your address"
ita: "Impossibile risalire al nome dell'host dall'indirizzo (risoluzione inversa)"

# ER_HANDSHAKE_ERROR 08S01
source: "Bad handshake"
ita: "Negoziazione impossibile"

# ER_DBACCESS_DENIED_ERROR 42000
source: "Access denied for user '%s'@'%s' to database '%-.192s'"
ita: "Accesso non consentito per l'utente: '%s'@'%s' al database '%-.192s'"

# ER_ACCESS_DENIED_ERROR 28000
source: "Access denied for user '%s'@'%s' (using password: %s)"
ita: "Accesso non consentito per l'utente: '%s'@'%s' (Password: %s)"

# ER_NO_DB_ERROR 3D000
source: "No database selected"
ita: "Nessun database selezionato"

# ER_UNKNOWN_COM_ERROR 08S01
source: "Unknown command"
ita: "Comando sconosciuto"

# ER_BAD_NULL_ERROR 23000
source: "Column '%-.192s' cannot be null"
ita: "La colonna '%-.192s' non puo` essere nulla"

# ER_BAD_DB_ERROR 42000
source: "Unknown database '%-.192s'"
ita: "Database '%-.192s' sconosciuto"

# ER_TABLE_EXISTS_ERROR 42S01
source: "Table '%-.192s' already exists"
ita: "La tabella '%-.192s' esiste gia`"

# ER_BAD_TABLE_ERROR 42S02
source: "Unknown table '%-.100T'"
ita: "Tabella '%-.100T' sconosciuta"

# ER_NON_UNIQ_ERROR 23000
source: "Column '%-.192s' in %-.192s is ambiguous"
ita: "Colonna: '%-.192s' di %-.192s e` ambigua"

# ER_SERVER_SHUTDOWN 08S01
source: "Server shutdown in progress"
ita: "Shutdown del server in corso"

# ER_BAD_FIELD_ERROR 42S22 S0022
source: "Unknown column '%-.192s' in '%-.192s'"
ita: "Colonna sconosciuta '%-.192s' in '%-.192s'"

# ER_WRONG_FIELD_WITH_GROUP 42000 S1009
source: "'%-.192s' isn't in GROUP BY"
ita: "Usato '%-.192s' che non e` nel GROUP BY"

# ER_WRONG_GROUP_FIELD 42000 S1009
source: "Can't group on '%-.192s'"
ita: "Impossibile raggruppare per '%-.192s'"

# ER_WRONG_SUM_SELECT 42000 S1009
source: "Statement has sum functions and columns in same statement"
ita: "Il comando ha una funzione SUM e una colonna non specificata nella GROUP BY"

# ER_WRONG_VALUE_COUNT 21S01
source: "Column count doesn't match value count"
ita: "Il numero delle colonne non e` uguale al numero dei valori"

# ER_TOO_LONG_IDENT 42000 S1009
source: "Identifier name '%-.100T' is too long"
ita: "Il nome dell'identificatore '%-.100T' e` troppo lungo"

# ER_DUP_FIELDNAME 42S21 S1009
source: "Duplicate column name '%-.192s'"
ita: "Nome colonna duplicato '%-.192s'"

# ER_DUP_KEYNAME 42000 S1009
source: "Duplicate key name '%-.192s'"
ita: "Nome chiave duplicato '%-.192s'"

# ER_DUP_ENTRY 23000 S1009
source: "Duplicate entry '%-.192T' for key %d"
ita: "Valore duplicato '%-.192T' per la chiave %d"

# ER_WRONG_FIELD_SPEC 42000 S1009
source: "Incorrect column specifier for column '%-.192s'"
ita: "Specifica errata per la colonna '%-.192s'"

# ER_PARSE_ERROR 42000 s1009
source: "%s near '%-.80T' at line %d"
ita: "%s vicino a '%-.80T' linea %d"

# ER_EMPTY_QUERY 42000
source: "Query was empty"
ita: "La query e` vuota"

# ER_NONUNIQ_TABLE 42000 S1009
source: "Not unique table/alias: '%-.192s'"
ita: "Tabella/alias non unico: '%-.192s'"

# ER_INVALID_DEFAULT 42000 S1009
source: "Invalid default value for '%-.192s'"
ita: "Valore di default non valido per '%-.192s'"

# ER_MULTIPLE_PRI_KEY 42000 S1009
source: "Multiple primary key defined"
ita: "Definite piu` chiave primarie"

# ER_TOO_MANY_KEYS 42000 S1009
source: "Too many keys specified; max %d keys allowed"
ita: "Troppe chiavi. Sono ammesse max %d chiavi"

# ER_TOO_MANY_KEY_PARTS 42000 S1009
source: "Too many key parts specified; max %d parts allowed"
ita: "Troppe parti di chiave specificate. Sono ammesse max %d parti"

# ER_TOO_LONG_KEY 42000 S1009
source: "Specified key was too long; max key length is %d bytes"
ita: "La chiave specificata e` troppo lunga. La max lunghezza della chiave e` %d"

# ER_KEY_COLUMN_DOES_NOT_EXIST 42000 S1009
source: "Key column '%-.192s' doesn't exist in table"
ita: "La colonna chiave '%-.192s' non esiste nella tabella"

# ER_TOO_BIG_FIELDLENGTH 42000 S1009
source: "Column length too big for column '%-.192s' (max = %lu); use BLOB or TEXT instead"
ita: "La colonna '%-.192s' e` troppo grande (max=%lu). Utilizza un BLOB"

# ER_WRONG_AUTO_KEY 42000 S1009
source: "Incorrect table definition; there can be only one auto column and it must be defined as a key"
ita: "Puo` esserci solo un campo AUTO e deve essere definito come chiave"

# ER_NORMAL_SHUTDOWN
source: "%s (initiated by: %s): Normal shutdown"
ita: "%s (%s): Shutdown normale"

# ER_GOT_SIGNAL
source: "%s: Got signal %d. Aborting!\n"
ita: "%s: Ricevuto segnale %d. Interruzione!\n"

# ER_SHUTDOWN_COMPLETE
source: "%s: Shutdown complete\n"
ita: "%s: Shutdown completato\n"

# ER_FORCING_CLOSE 08S01
source: "%s: Forcing close of thread %ld user: '%-.48s'\n"
ita: "%s: Forzata la chiusura del thread %ld utente: '%-.48s'\n"

# ER_IPSOCK_ERROR 08S01
source: "Can't create IP socket"
ita: "Impossibile creare il socket IP"

# ER_NO_SUCH_INDEX 42S12 S1009
source: "Table '%-.192s' has no index like the one used in CREATE INDEX; recreate the table"
ita: "La tabella '%-.192s' non ha nessun indice come quello specificatato dalla CREATE INDEX. Ricrea la tabella"

# ER_WRONG_FIELD_TERMINATORS 42000 S1009
source: "Field separator argument is not what is expected; check the manual"
ita: "L'argomento 'Field separator' non e` quello atteso. Controlla il manuale"

# ER_BLOBS_AND_NO_TERMINATED 42000 S1009
source: "You can't use fixed rowlength with BLOBs; please use 'fields terminated by'"
ita: "Non possono essere usate righe a lunghezza fissa con i BLOB. Usa 'FIELDS TERMINATED BY'"

# ER_TEXTFILE_NOT_READABLE
source: "The file '%-.128s' must be in the database directory or be readable by all"
ita: "Il file '%-.128s' deve essere nella directory del database e deve essere leggibile da tutti"

# ER_FILE_EXISTS_ERROR
source: "File '%-.200s' already exists"
ita: "Il file '%-.200s' esiste gia`"

# ER_LOAD_INFO
source: "Records: %ld Deleted: %ld Skipped: %ld Warnings: %ld"
ita: "Records: %ld Cancellati: %ld Saltati: %ld Avvertimenti: %ld"

# ER_ALTER_INFO
source: "Records: %ld Duplicates: %ld"
ita: "Records: %ld Duplicati: %ld"

# ER_WRONG_SUB_KEY
source: "Incorrect prefix key; the used key part isn't a string, the used length is longer than the key part, or the storage engine doesn't support unique prefix keys"
ita: "Sotto-parte della chiave errata. La parte di chiave utilizzata non e` una stringa o la lunghezza e` maggiore della parte di chiave"

# ER_CANT_REMOVE_ALL_FIELDS 42000
source: "You can't delete all columns with ALTER TABLE; use DROP TABLE instead"
ita: "Non si possono cancellare tutti i campi con una ALTER TABLE. Utilizzare DROP TABLE"

# ER_CANT_DROP_FIELD_OR_KEY 42000
source: "Can't DROP %s %`-.192s; check that it exists"
ita: "Impossibile cancellare (DROP %s) %`-.192s. Controllare che il campo chiave esista"

# ER_INSERT_INFO
source: "Records: %ld Duplicates: %ld Warnings: %ld"
ita: "Records: %ld Duplicati: %ld Avvertimenti: %ld"

# ER_NO_SUCH_THREAD
source: "Unknown thread id: %lu"
ita: "Thread id: %lu sconosciuto"

# ER_KILL_DENIED_ERROR
source: "You are not owner of thread %lld"
ita: "Utente non proprietario del thread %lld"

# ER_NO_TABLES_USED
source: "No tables used"
ita: "Nessuna tabella usata"

# ER_TOO_BIG_SET
source: "Too many strings for column %-.192s and SET"
ita: "Troppe stringhe per la colonna %-.192s e la SET"

# ER_NO_UNIQUE_LOGFILE
source: "Can't generate a unique log-filename %-.200s.(1-999)\n"
ita: "Impossibile generare un nome del file log unico %-.200s.(1-999)\n"

# ER_TABLE_NOT_LOCKED_FOR_WRITE
source: "Table '%-.192s' was locked with a READ lock and can't be updated"
ita: "La tabella '%-.192s' e` soggetta a lock in lettura e non puo` essere aggiornata"

# ER_TABLE_NOT_LOCKED
source: "Table '%-.192s' was not locked with LOCK TABLES"
ita: "Non e` stato impostato il lock per la tabella '%-.192s' con LOCK TABLES"

# ER_WRONG_DB_NAME 42000
source: "Incorrect database name '%-.100T'"
ita: "Nome database errato '%-.100T'"

# ER_WRONG_TABLE_NAME 42000
source: "Incorrect table name '%-.100s'"
ita: "Nome tabella errato '%-.100s'"

# ER_TOO_BIG_SELECT 42000
source: "The SELECT would examine more than MAX_JOIN_SIZE rows; check your WHERE and use SET SQL_BIG_SELECTS=1 or SET MAX_JOIN_SIZE=# if the SELECT is okay"
ita: "La SELECT dovrebbe esaminare troppi record e usare troppo tempo. Controllare la WHERE e usa SET SQL_BIG_SELECTS=1 se e` tutto a posto"

# ER_UNKNOWN_ERROR
source: "Unknown error"
ita: "Errore sconosciuto"

# ER_UNKNOWN_PROCEDURE 42000
source: "Unknown procedure '%-.192s'"
ita: "Procedura '%-.192s' sconosciuta"

# ER_WRONG_PARAMCOUNT_TO_PROCEDURE 42000
source: "Incorrect parameter count to procedure '%-.192s'"
ita: "Numero di parametri errato per la procedura '%-.192s'"

# ER_WRONG_PARAMETERS_TO_PROCEDURE
source: "Incorrect parameters to procedure '%-.192s'"
ita: "Parametri errati per la procedura '%-.192s'"

# ER_UNKNOWN_TABLE 42S02
source: "Unknown table '%-.192s' in %-.32s"
ita: "Tabella '%-.192s' sconosciuta in %-.32s"

# ER_FIELD_SPECIFIED_TWICE 42000
source: "Column '%-.192s' specified twice"
ita: "Campo '%-.192s' specificato 2 volte"

# ER_INVALID_GROUP_FUNC_USE
source: "Invalid use of group function"
ita: "Uso non valido di una funzione di raggruppamento"

# ER_UNSUPPORTED_EXTENSION 42000
source: "Table '%-.192s' uses an extension that doesn't exist in this MariaDB version"
ita: "La tabella '%-.192s' usa un'estensione che non esiste in questa versione di MariaDB"

# ER_TABLE_MUST_HAVE_COLUMNS 42000
source: "A table must have at least 1 column"
ita: "Una tabella deve avere almeno 1 colonna"

# ER_RECORD_FILE_FULL
source: "The table '%-.192s' is full"
ita: "La tabella '%-.192s' e` piena"

# ER_UNKNOWN_CHARACTER_SET 42000
source: "Unknown character set: '%-.64s'"
ita: "Set di caratteri '%-.64s' sconosciuto"

# ER_TOO_MANY_TABLES
source: "Too many tables; MariaDB can only use %d tables in a join"
ita: "Troppe tabelle. MariaDB puo` usare solo %d tabelle in una join"

# ER_TOO_MANY_FIELDS
source: "Too many columns"
ita: "Troppi campi"

# ER_TOO_BIG_ROWSIZE 42000
source: "Row size too large. The maximum row size for the used table type, not counting BLOBs, is %ld. This includes storage overhead, check the manual. You have to change some columns to TEXT or BLOBs"
ita: "Riga troppo grande. La massima grandezza di una riga, non contando i BLOB, e` %ld. Devi cambiare alcuni campi in BLOB"

# ER_STACK_OVERRUN
source: "Thread stack overrun: Used: %ld of a %ld stack. Use 'mariadbd --thread_stack=#' to specify a bigger stack if needed"
ita: "Thread stack overrun: Usati: %ld di uno stack di %ld. Usa 'mariadbd --thread_stack=#' per specificare uno stack piu` grande"

# ER_WRONG_OUTER_JOIN 42000
source: "Cross dependency found in OUTER JOIN; examine your ON conditions"
ita: "Trovata una dipendenza incrociata nella OUTER JOIN. Controlla le condizioni ON"

# ER_CANT_FIND_UDF
source: "Can't load function '%-.192s'"
ita: "Impossibile caricare la funzione '%-.192s'"

# ER_CANT_INITIALIZE_UDF
source: "Can't initialize function '%-.192s'; %-.80s"
ita: "Impossibile inizializzare la funzione '%-.192s'; %-.80s"

# ER_UDF_NO_PATHS
source: "No paths allowed for shared library"
ita: "Non sono ammessi path per le librerie condivisa"

# ER_UDF_EXISTS
source: "Function '%-.192s' already exists"
ita: "La funzione '%-.192s' esiste gia`"

# ER_CANT_OPEN_LIBRARY
source: "Can't open shared library '%-.192s' (errno: %d, %-.128s)"
ita: "Impossibile aprire la libreria condivisa '%-.192s' (errno: %d, %-.128s)"

# ER_CANT_FIND_DL_ENTRY
source: "Can't find symbol '%-.128s' in library"
ita: "Impossibile trovare la funzione '%-.128s' nella libreria"

# ER_FUNCTION_NOT_DEFINED
source: "Function '%-.192s' is not defined"
ita: "La funzione '%-.192s' non e` definita"

# ER_HOST_IS_BLOCKED
source: "Host '%-.64s' is blocked because of many connection errors; unblock with 'mariadb-admin flush-hosts'"
ita: "Sistema '%-.64s' bloccato a causa di troppi errori di connessione. Per sbloccarlo: 'mariadb-admin flush-hosts'"

# ER_HOST_NOT_PRIVILEGED
source: "Host '%-.64s' is not allowed to connect to this MariaDB server"
ita: "Al sistema '%-.64s' non e` consentita la connessione a questo server MariaDB"

# ER_PASSWORD_ANONYMOUS_USER 42000
source: "You are using MariaDB as an anonymous user and anonymous users are not allowed to modify user settings"
ita: "Impossibile cambiare la password usando MariaDB come utente anonimo"

# ER_PASSWORD_NOT_ALLOWED 42000
source: "You must have privileges to update tables in the mysql database to be able to change passwords for others"
ita: "E` necessario il privilegio di update sulle tabelle del database mysql per cambiare le password per gli altri utenti"

# ER_PASSWORD_NO_MATCH 28000
source: "Can't find any matching row in the user table"
ita: "Impossibile trovare la riga corrispondente nella tabella user"

# ER_UPDATE_INFO
source: "Rows matched: %ld Changed: %ld Warnings: %ld"
ita: "Rows riconosciute: %ld Cambiate: %ld Warnings: %ld"

# ER_CANT_CREATE_THREAD
source: "Can't create a new thread (errno %M); if you are not out of available memory, you can consult the manual for a possible OS-dependent bug"
ita: "Impossibile creare un nuovo thread (errno %M). Se non ci sono problemi di memoria disponibile puoi consultare il manuale per controllare possibili problemi dipendenti dal SO"

# ER_WRONG_VALUE_COUNT_ON_ROW 21S01
source: "Column count doesn't match value count at row %lu"
ita: "Il numero delle colonne non corrisponde al conteggio alla riga %lu"

# ER_CANT_REOPEN_TABLE
source: "Can't reopen table: '%-.192s'"
ita: "Impossibile riaprire la tabella: '%-.192s'"

# ER_INVALID_USE_OF_NULL 22004
source: "Invalid use of NULL value"
ita: "Uso scorretto del valore NULL"

# ER_REGEXP_ERROR 42000
source: "Regex error '%s'"
ita: "Errore '%s' da regexp"

# ER_MIX_OF_GROUP_FUNC_AND_FIELDS 42000
source: "Mixing of GROUP columns (MIN(),MAX(),COUNT(),...) with no GROUP columns is illegal if there is no GROUP BY clause"
ita: "Il mescolare funzioni di aggregazione (MIN(),MAX(),COUNT()...) e non e` illegale se non c'e` una clausula GROUP BY"

# ER_NONEXISTING_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s'"
ita: "GRANT non definita per l'utente '%-.48s' dalla macchina '%-.64s'"

# ER_TABLEACCESS_DENIED_ERROR 42000
source: "%-.100T command denied to user '%s'@'%s' for table '%-.192s'"
ita: "Comando %-.100T negato per l'utente: '%s'@'%s' sulla tabella '%-.192s'"

# ER_COLUMNACCESS_DENIED_ERROR 42000
source: "%-.32s command denied to user '%s'@'%s' for column '%-.192s' in table '%-.192s'"
ita: "Comando %-.32s negato per l'utente: '%s'@'%s' sulla colonna '%-.192s' della tabella '%-.192s'"

# ER_ILLEGAL_GRANT_FOR_TABLE 42000
source: "Illegal GRANT/REVOKE command; please consult the manual to see which privileges can be used"
ita: "Comando GRANT/REVOKE illegale. Prego consultare il manuale per sapere quali privilegi possono essere usati"

# ER_GRANT_WRONG_HOST_OR_USER 42000
source: "The host or user argument to GRANT is too long"
ita: "L'argomento host o utente per la GRANT e` troppo lungo"

# ER_NO_SUCH_TABLE 42S02
source: "Table '%-.192s.%-.192s' doesn't exist"
ita: "La tabella '%-.192s.%-.192s' non esiste"

# ER_NONEXISTING_TABLE_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s' on table '%-.192s'"
ita: "GRANT non definita per l'utente '%-.48s' dalla macchina '%-.64s' sulla tabella '%-.192s'"

# ER_NOT_ALLOWED_COMMAND 42000
source: "The used command is not allowed with this MariaDB version"
ita: "Il comando utilizzato non e` supportato in questa versione di MariaDB"

# ER_SYNTAX_ERROR 42000
source: "You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use"
ita: "Errore di sintassi nella query SQL"

# ER_DELAYED_CANT_CHANGE_LOCK
source: "Delayed insert thread couldn't get requested lock for table %-.192s"
ita: "Il thread di inserimento ritardato non riesce ad ottenere il lock per la tabella %-.192s"

# ER_TOO_MANY_DELAYED_THREADS
source: "Too many delayed threads in use"
ita: "Troppi threads ritardati in uso"

# ER_ABORTING_CONNECTION 08S01
source: "Aborted connection %ld to db: '%-.192s' user: '%-.48s' (%-.64s)"
ita: "Interrotta la connessione %ld al db: '%-.192s' utente: '%-.48s' (%-.64s)"

# ER_NET_PACKET_TOO_LARGE 08S01
source: "Got a packet bigger than 'max_allowed_packet' bytes"
ita: "Ricevuto un pacchetto piu` grande di 'max_allowed_packet'"

# ER_NET_READ_ERROR_FROM_PIPE 08S01
source: "Got a read error from the connection pipe"
ita: "Rilevato un errore di lettura dalla pipe di connessione"

# ER_NET_FCNTL_ERROR 08S01
source: "Got an error from fcntl()"
ita: "Rilevato un errore da fcntl()"

# ER_NET_PACKETS_OUT_OF_ORDER 08S01
source: "Got packets out of order"
ita: "Ricevuti pacchetti non in ordine"

# ER_NET_UNCOMPRESS_ERROR 08S01
source: "Couldn't uncompress communication packet"
ita: "Impossibile scompattare i pacchetti di comunicazione"

# ER_NET_READ_ERROR 08S01
source: "Got an error reading communication packets"
ita: "Rilevato un errore ricevendo i pacchetti di comunicazione"

# ER_NET_READ_INTERRUPTED 08S01
source: "Got timeout reading communication packets"
ita: "Rilevato un timeout ricevendo i pacchetti di comunicazione"

# ER_NET_ERROR_ON_WRITE 08S01
source: "Got an error writing communication packets"
ita: "Rilevato un errore inviando i pacchetti di comunicazione"

# ER_NET_WRITE_INTERRUPTED 08S01
source: "Got timeout writing communication packets"
ita: "Rilevato un timeout inviando i pacchetti di comunicazione"

# ER_TOO_LONG_STRING 42000
source: "Result string is longer than 'max_allowed_packet' bytes"
ita: "La stringa di risposta e` piu` lunga di 'max_allowed_packet'"

# ER_TABLE_CANT_HANDLE_BLOB 42000
source: "Storage engine %s doesn't support BLOB/TEXT columns"
ita: "Il tipo di tabella usata (%s) non supporta colonne di tipo BLOB/TEXT"

# ER_TABLE_CANT_HANDLE_AUTO_INCREMENT 42000
source: "Storage engine %s doesn't support AUTO_INCREMENT columns"
ita: "Il tipo di tabella usata (%s) non supporta colonne di tipo AUTO_INCREMENT"

# ER_DELAYED_INSERT_TABLE_LOCKED
source: "INSERT DELAYED can't be used with table '%-.192s' because it is locked with LOCK TABLES"
ita: "L'inserimento ritardato (INSERT DELAYED) non puo` essere usato con la tabella '%-.192s', perche` soggetta a lock da 'LOCK TABLES'"

# ER_WRONG_COLUMN_NAME 42000
source: "Incorrect column name '%-.100s'"
ita: "Nome colonna '%-.100s' non corretto"

# ER_WRONG_MRG_TABLE
source: "Unable to open underlying table which is differently defined or of non-MyISAM type or doesn't exist"
ita: "Non tutte le tabelle nella tabella di MERGE sono definite in maniera identica"
