Repository: vladbogo/test-translation
Catalog: jpn.xlf
Languages: jpn

# ER_CANT_CREATE_FILE
source: "Can't create file '%-.200s' (errno: %M)"
jpn: "ファイル '%-.200s' を作成できません。(エラー番号: %M)"

# ER_CANT_CREATE_TABLE
source: "Can't create table %`s.%`s (errno: %M)"
jpn: "%`s.%`s テーブルが作れません.(errno: %M)"

# ER_CANT_CREATE_DB
source: "Can't create database '%-.192s' (errno: %M)"
jpn: "データベース '%-.192s' を作成できません。(エラー番号: %M)"

# ER_DB_CREATE_EXISTS
source: "Can't create database '%-.192s'; database exists"
jpn: "データベース '%-.192s' を作成できません。データベースはすでに存在します。"

# ER_DB_DROP_EXISTS
source: "Can't drop database '%-.192s'; database doesn't exist"
jpn: "データベース '%-.192s' を削除できません。データベースは存在しません。"

# ER_DB_DROP_DELETE
source: "Error dropping database (can't delete '%-.192s', errno: %M)"
jpn: "データベース削除エラー ('%-.192s' を削除できません。エラー番号: %M)"

# ER_DB_DROP_RMDIR
source: "Error dropping database (can't rmdir '%-.192s', errno: %M)"
jpn: "データベース削除エラー (ディレクトリ '%-.192s' を削除できません。エラー番号: %M)"

# ER_CANT_DELETE_FILE
source: "Error on delete of '%-.192s' (errno: %M)"
jpn: "ファイル '%-.192s' の削除エラー (エラー番号: %M)"

# ER_CANT_FIND_SYSTEM_REC
source: "Can't read record in system table"
jpn: "システム表のレコードを読み込めません。"

# ER_CANT_GET_STAT
source: "Can't get status of '%-.200s' (errno: %M)"
jpn: "'%-.200s' の状態を取得できません。(エラー番号: %M)"

# ER_CANT_GET_WD
source: "Can't get working directory (errno: %M)"
jpn: "作業ディレクトリを取得できません。(エラー番号: %M)"

# ER_CANT_LOCK
source: "Can't lock file (errno: %M)"
jpn: "ファイルをロックできません。(エラー番号: %M)"

# ER_CANT_OPEN_FILE
source: "Can't open file: '%-.200s' (errno: %M)"
jpn: "ファイル '%-.200s' をオープンできません。(エラー番号: %M)"

# ER_FILE_NOT_FOUND
source: "Can't find file: '%-.200s' (errno: %M)"
jpn: "ファイル '%-.200s' が見つかりません。(エラー番号: %M)"

# ER_CANT_READ_DIR
source: "Can't read dir of '%-.192s' (errno: %M)"
jpn: "ディレクトリ '%-.192s' を読み込めません。(エラー番号: %M)"

# ER_CANT_SET_WD
source: "Can't change dir to '%-.192s' (errno: %M)"
jpn: "ディレクトリ '%-.192s' に移動できません。(エラー番号: %M)"

# ER_CHECKREAD
source: "Record has changed since last read in table '%-.192s'"
jpn: "表 '%-.192s' の最後の読み込み時点から、レコードが変化しました。"

# ER_DISK_FULL
source: "Disk full (%s); waiting for someone to free some space... (errno: %M)"
jpn: "ディスク領域不足です(%s)。(エラー番号: %M)"

# ER_DUP_KEY 23000
source: "Can't write; duplicate key in table '%-.192s'"
jpn: "書き込めません。表 '%-.192s' に重複するキーがあります。"

# ER_ERROR_ON_CLOSE
source: "Error on close of '%-.192s' (errno: %M)"
jpn: "'%-.192s' のクローズ時エラー (エラー番号: %M)"

# ER_ERROR_ON_READ
source: "Error reading file '%-.200s' (errno: %M)"
jpn: "ファイル '%-.200s' の読み込みエラー (エラー番号: %M)"

# ER_ERROR_ON_RENAME
source: "Error on rename of '%-.210s' to '%-.210s' (errno: %M)"
jpn: "'%-.210s' の名前を '%-.210s' に変更できません (エラー番号: %M)"

# ER_ERROR_ON_WRITE
source: "Error writing file '%-.200s' (errno: %M)"
jpn: "ファイル '%-.200s' の書き込みエラー (エラー番号: %M)"

# ER_FILE_USED
source: "'%-.192s' is locked against change"
jpn: "'%-.192s' はロックされています。"

# ER_FILSORT_ABORT
source: "Sort aborted"
jpn: "ソート処理を中断しました。"

# ER_FORM_NOT_FOUND
source: "View '%-.192s' doesn't exist for '%-.192s'"
jpn: "ビュー '%-.192s' は '%-.192s' に存在しません。"

# ER_KEY_NOT_FOUND
source: "Can't find record in '%-.192s'"
jpn: "'%-.192s' にレコードが見つかりません。"

# ER_NOT_FORM_FILE
source: "Incorrect information in file: '%-.200s'"
jpn: "ファイル '%-.200s' 内の情報が不正です。"

# ER_NOT_KEYFILE
source: "Index for table '%-.200s' is corrupt; try to repair it"
jpn: "表 '%-.200s' の索引ファイル(key file)の内容が不正です。修復を試行してください。"

# ER_OLD_KEYFILE
source: "Old key file for table '%-.192s'; repair it!"
jpn: "表 '%-.192s' の索引ファイル(key file)は古い形式です。修復してください。"

# ER_OPEN_AS_READONLY
source: "Table '%-.192s' is read only"
jpn: "表 '%-.192s' は読み込み専用です。"

# ER_OUTOFMEMORY HY001 S1001
source: "Out of memory; restart server and try again (needed %d bytes)"
jpn: "メモリが不足しています。サーバーを再起動してみてください。(%d バイトの割り当てに失敗)"

# ER_OUT_OF_SORTMEMORY HY001 S1001
source: "Out of sort memory, consider increasing server sort buffer size"
jpn: "ソートメモリが不足しています。ソートバッファサイズ(sort buffer size)の増加を検討してください。"

# ER_UNEXPECTED_EOF
source: "Unexpected EOF found when reading file '%-.192s' (errno: %M)"
jpn: "ファイル '%-.192s' を読み込み中に予期せずファイルの終端に達しました。(エラー番号: %M)"

# ER_CON_COUNT_ERROR 08004
source: "Too many connections"
jpn: "接続が多すぎます。"

# ER_OUT_OF_RESOURCES
source: "Out of memory."
jpn: "メモリが不足しています。mariadbd やその他のプロセスがメモリーを使い切っていないか確認して下さい。メモリーを使い切っていない場合、'ulimit'の設定等で mariadbd のメモリー使用最大量を多くするか、スワップ領域を増やす必要があるかもしれません。"

# ER_BAD_HOST_ERROR 08S01
source: "Can't get hostname for your address"
jpn: "IPアドレスからホスト名を解決できません。"

# ER_HANDSHAKE_ERROR 08S01
source: "Bad handshake"
jpn: "ハンドシェイクエラー"

# ER_DBACCESS_DENIED_ERROR 42000
source: "Access denied for user '%s'@'%s' to database '%-.192s'"
jpn: "ユーザー '%s'@'%s' の '%-.192s' データベースへのアクセスを拒否します"

# ER_ACCESS_DENIED_ERROR 28000
source: "Access denied for user '%s'@'%s' (using password: %s)"
jpn: "ユーザー '%s'@'%s' を拒否します.uUsing password: %s)"

# ER_NO_DB_ERROR 3D000
source: "No database selected"
jpn: "データベースが選択されていません。"

# ER_UNKNOWN_COM_ERROR 08S01
source: "Unknown command"
jpn: "不明なコマンドです。"

# ER_BAD_NULL_ERROR 23000
source: "Column '%-.192s' cannot be null"
jpn: "列 '%-.192s' は null にできません。"

# ER_BAD_DB_ERROR 42000
source: "Unknown database '%-.192s'"
jpn: "'%-.192s' は不明なデータベースです。"

# ER_TABLE_EXISTS_ERROR 42S01
source: "Table '%-.192s' already exists"
jpn: "表 '%-.192s' はすでに存在します。"

# ER_BAD_TABLE_ERROR 42S02
source: "Unknown table '%-.100T'"
jpn: "'%-.100T' は不明な表です。"

# ER_NON_UNIQ_ERROR 23000
source: "Column '%-.192s' in %-.192s is ambiguous"
jpn: "列 '%-.192s' は %-.192s 内で曖昧です。"

# ER_SERVER_SHUTDOWN 08S01
source: "Server shutdown in progress"
jpn: "サーバーをシャットダウン中です。"

# ER_BAD_FIELD_ERROR 42S22 S0022
source: "Unknown column '%-.192s' in '%-.192s'"
jpn: "列 '%-.192s' は '%-.192s' にはありません。"

# ER_WRONG_FIELD_WITH_GROUP 42000 S1009
source: "'%-.192s' isn't in GROUP BY"
jpn: "'%-.192s' はGROUP BY句で指定されていません。"

# ER_WRONG_GROUP_FIELD 42000 S1009
source: "Can't group on '%-.192s'"
jpn: "'%-.192s' でのグループ化はできません。"

# ER_WRONG_SUM_SELECT 42000 S1009
source: "Statement has sum functions and columns in same statement"
jpn: "集計関数と通常の列が同時に指定されています。"

# ER_WRONG_VALUE_COUNT 21S01
source: "Column count doesn't match value count"
jpn: "列数が値の個数と一致しません。"

# ER_TOO_LONG_IDENT 42000 S1009
source: "Identifier name '%-.100T' is too long"
jpn: "識別子名 '%-.100T' は長すぎます。"

# ER_DUP_FIELDNAME 42S21 S1009
source: "Duplicate column name '%-.192s'"
jpn: "列名 '%-.192s' は重複してます。"

# ER_DUP_KEYNAME 42000 S1009
source: "Duplicate key name '%-.192s'"
jpn: "索引名 '%-.192s' は重複しています。"

# ER_DUP_ENTRY 23000 S1009
source: "Duplicate entry '%-.192T' for key %d"
jpn: "'%-.192T' は索引 %d で重複しています。"

# ER_WRONG_FIELD_SPEC 42000 S1009
source: "Incorrect column specifier for column '%-.192s'"
jpn: "列 '%-.192s' の定義が不正です。"

# ER_PARSE_ERROR 42000 s1009
source: "%s near '%-.80T' at line %d"
jpn: "%s : '%-.80T' 付近 %d 行目"

# ER_EMPTY_QUERY 42000
source: "Query was empty"
jpn: "クエリが空です。"

# ER_NONUNIQ_TABLE 42000 S1009
source: "Not unique table/alias: '%-.192s'"
jpn: "表名／別名 '%-.192s' は一意ではありません。"

# ER_INVALID_DEFAULT 42000 S1009
source: "Invalid default value for '%-.192s'"
jpn: "'%-.192s' へのデフォルト値が無効です。"

# ER_MULTIPLE_PRI_KEY 42000 S1009
source: "Multiple primary key defined"
jpn: "PRIMARY KEY が複数定義されています。"

# ER_TOO_MANY_KEYS 42000 S1009
source: "Too many keys specified; max %d keys allowed"
jpn: "索引の数が多すぎます。最大 %d 個までです。"

# ER_TOO_MANY_KEY_PARTS 42000 S1009
source: "Too many key parts specified; max %d parts allowed"
jpn: "索引のキー列指定が多すぎます。最大 %d 個までです。"

# ER_TOO_LONG_KEY 42000 S1009
source: "Specified key was too long; max key length is %d bytes"
jpn: "索引のキーが長すぎます。最大 %d バイトまでです。"

# ER_KEY_COLUMN_DOES_NOT_EXIST 42000 S1009
source: "Key column '%-.192s' doesn't exist in table"
jpn: "キー列 '%-.192s' は表にありません。"

# ER_TOO_BIG_FIELDLENGTH 42000 S1009
source: "Column length too big for column '%-.192s' (max = %lu); use BLOB or TEXT instead"
jpn: "列 '%-.192s' のサイズ定義が大きすぎます (最大 %lu まで)。代わりに BLOB または TEXT を使用してください。"

# ER_WRONG_AUTO_KEY 42000 S1009
source: "Incorrect table definition; there can be only one auto column and it must be defined as a key"
jpn: "不正な表定義です。AUTO_INCREMENT列は１個までで、索引を定義する必要があります。"

# ER_NORMAL_SHUTDOWN
source: "%s (initiated by: %s): Normal shutdown"
jpn: "%s (%s): 通常シャットダウン"

# ER_GOT_SIGNAL
source: "%s: Got signal %d. Aborting!\n"
jpn: "%s: シグナル %d を受信しました。強制終了します！\n"

# ER_SHUTDOWN_COMPLETE
source: "%s: Shutdown complete\n"
jpn: "%s: シャットダウン完了\n"

# ER_FORCING_CLOSE 08S01
source: "%s: Forcing close of thread %ld user: '%-.48s'\n"
jpn: "%s: スレッド %ld を強制終了します (ユーザー: '%-.48s')\n"

# ER_IPSOCK_ERROR 08S01
source: "Can't create IP socket"
jpn: "IPソケットを作成できません。"

# ER_NO_SUCH_INDEX 42S12 S1009
source: "Table '%-.192s' has no index like the one used in CREATE INDEX; recreate the table"
jpn: "表 '%-.192s' に以前CREATE INDEXで作成された索引がありません。表を作り直してください。"

# ER_WRONG_FIELD_TERMINATORS 42000 S1009
source: "Field separator argument is not what is expected; check the manual"
jpn: "フィールド区切り文字が予期せぬ使われ方をしています。マニュアルを確認して下さい。"

# ER_BLOBS_AND_NO_TERMINATED 42000 S1009
source: "You can't use fixed rowlength with BLOBs; please use 'fields terminated by'"
jpn: "BLOBには固定長レコードが使用できません。'FIELDS TERMINATED BY'句を使用して下さい。"

# ER_TEXTFILE_NOT_READABLE
source: "The file '%-.128s' must be in the database directory or be readable by all"
jpn: "ファイル '%-.128s' はデータベースディレクトリにあるか、全てのユーザーから読める必要があります。"

# ER_FILE_EXISTS_ERROR
source: "File '%-.200s' already exists"
jpn: "ファイル '%-.200s' はすでに存在します。"

# ER_LOAD_INFO
source: "Records: %ld Deleted: %ld Skipped: %ld Warnings: %ld"
jpn: "レコード数: %ld 削除: %ld スキップ: %ld 警告: %ld"

# ER_ALTER_INFO
source: "Records: %ld Duplicates: %ld"
jpn: "レコード数: %ld 重複: %ld"

# ER_WRONG_SUB_KEY
source: "Incorrect prefix key; the used key part isn't a string, the used length is longer than the key part, or the storage engine doesn't support unique prefix keys"
jpn: "キーのプレフィックスが不正です。キーが文字列ではないか、プレフィックス長がキーよりも長いか、ストレージエンジンが一意索引のプレフィックス指定をサポートしていません。"

# ER_CANT_REMOVE_ALL_FIELDS 42000
source: "You can't delete all columns with ALTER TABLE; use DROP TABLE instead"
jpn: "ALTER TABLE では全ての列の削除はできません。DROP TABLE を使用してください。"

# ER_INSERT_INFO
source: "Records: %ld Duplicates: %ld Warnings: %ld"
jpn: "レコード数: %ld 重複数: %ld 警告: %ld"

# ER_NO_SUCH_THREAD
source: "Unknown thread id: %lu"
jpn: "不明なスレッドIDです: %lu"

# ER_KILL_DENIED_ERROR
source: "You are not owner of thread %lld"
jpn: "スレッド %lld のオーナーではありません。"

# ER_NO_TABLES_USED
source: "No tables used"
jpn: "表が指定されていません。"

# ER_TOO_BIG_SET
source: "Too many strings for column %-.192s and SET"
jpn: "SET型の列 '%-.192s' のメンバーの数が多すぎます。"

# ER_NO_UNIQUE_LOGFILE
source: "Can't generate a unique log-filename %-.200s.(1-999)\n"
jpn: "一意なログファイル名 %-.200s.(1-999) を生成できません。\n"

# ER_TABLE_NOT_LOCKED_FOR_WRITE
source: "Table '%-.192s' was locked with a READ lock and can't be updated"
jpn: "表 '%-.192s' はREADロックされていて、更新できません。"

# ER_TABLE_NOT_LOCKED
source: "Table '%-.192s' was not locked with LOCK TABLES"
jpn: "表 '%-.192s' は LOCK TABLES でロックされていません。"

# ER_WRONG_DB_NAME 42000
source: "Incorrect database name '%-.100T'"
jpn: "データベース名 '%-.100T' は不正です。"

# ER_WRONG_TABLE_NAME 42000
source: "Incorrect table name '%-.100s'"
jpn: "表名 '%-.100s' は不正です。"

# ER_TOO_BIG_SELECT 42000
source: "The SELECT would examine more than MAX_JOIN_SIZE rows; check your WHERE and use SET SQL_BIG_SELECTS=1 or SET MAX_JOIN_SIZE=# if the SELECT is okay"
jpn: "SELECTがMAX_JOIN_SIZEを超える行数を処理しました。WHERE句を確認し、SELECT文に問題がなければ、 SET SQL_BIG_SELECTS=1 または SET MAX_JOIN_SIZE=# を使用して下さい。"

# ER_UNKNOWN_ERROR
source: "Unknown error"
jpn: "不明なエラー"

# ER_UNKNOWN_PROCEDURE 42000
source: "Unknown procedure '%-.192s'"
jpn: "'%-.192s' は不明なプロシージャです。"

# ER_WRONG_PARAMCOUNT_TO_PROCEDURE 42000
source: "Incorrect parameter count to procedure '%-.192s'"
jpn: "プロシージャ '%-.192s' へのパラメータ数が不正です。"

# ER_WRONG_PARAMETERS_TO_PROCEDURE
source: "Incorrect parameters to procedure '%-.192s'"
jpn: "プロシージャ '%-.192s' へのパラメータが不正です。"

# ER_UNKNOWN_TABLE 42S02
source: "Unknown table '%-.192s' in %-.32s"
jpn: "'%-.192s' は %-.32s では不明な表です。"

# ER_FIELD_SPECIFIED_TWICE 42000
source: "Column '%-.192s' specified twice"
jpn: "列 '%-.192s' は2回指定されています。"

# ER_INVALID_GROUP_FUNC_USE
source: "Invalid use of group function"
jpn: "集計関数の使用方法が不正です。"

# ER_UNSUPPORTED_EXTENSION 42000
source: "Table '%-.192s' uses an extension that doesn't exist in this MariaDB version"
jpn: "表 '%-.192s' は、このMariaDBバージョンには無い機能を使用しています。"

# ER_TABLE_MUST_HAVE_COLUMNS 42000
source: "A table must have at least 1 column"
jpn: "表には最低でも1個の列が必要です。"

# ER_RECORD_FILE_FULL
source: "The table '%-.192s' is full"
jpn: "表 '%-.192s' は満杯です。"

# ER_UNKNOWN_CHARACTER_SET 42000
source: "Unknown character set: '%-.64s'"
jpn: "不明な文字コードセット: '%-.64s'"

# ER_TOO_MANY_TABLES
source: "Too many tables; MariaDB can only use %d tables in a join"
jpn: "表が多すぎます。MariaDBがJOINできる表は %d 個までです。"

# ER_TOO_MANY_FIELDS
source: "Too many columns"
jpn: "列が多すぎます。"

# ER_TOO_BIG_ROWSIZE 42000
source: "Row size too large. The maximum row size for the used table type, not counting BLOBs, is %ld. This includes storage overhead, check the manual. You have to change some columns to TEXT or BLOBs"
jpn: "行サイズが大きすぎます。この表の最大行サイズは BLOB を含まずに %ld です。格納時のオーバーヘッドも含まれます(マニュアルを確認してください)。列をTEXTまたはBLOBに変更する必要があります。"

# ER_STACK_OVERRUN
source: "Thread stack overrun: Used: %ld of a %ld stack. Use 'mariadbd --thread_stack=#' to specify a bigger stack if needed"
jpn: "スレッドスタック不足です(使用: %ld ; サイズ: %ld)。必要に応じて、より大きい値で 'mariadbd --thread_stack=#' の指定をしてください。"

# ER_WRONG_OUTER_JOIN 42000
source: "Cross dependency found in OUTER JOIN; examine your ON conditions"
jpn: "OUTER JOINに相互依存が見つかりました。ON句の条件を確認して下さい。"

# ER_CANT_FIND_UDF
source: "Can't load function '%-.192s'"
jpn: "関数 '%-.192s' をロードできません。"

# ER_CANT_INITIALIZE_UDF
source: "Can't initialize function '%-.192s'; %-.80s"
jpn: "関数 '%-.192s' を初期化できません。; %-.80s"

# ER_UDF_NO_PATHS
source: "No paths allowed for shared library"
jpn: "共有ライブラリにはパスを指定できません。"

# ER_UDF_EXISTS
source: "Function '%-.192s' already exists"
jpn: "関数 '%-.192s' はすでに定義されています。"

# ER_CANT_OPEN_LIBRARY
source: "Can't open shared library '%-.192s' (errno: %d, %-.128s)"
jpn: "共有ライブラリ '%-.192s' を開く事ができません。(エラー番号: %d, %-.128s)"

# ER_CANT_FIND_DL_ENTRY
source: "Can't find symbol '%-.128s' in library"
jpn: "関数 '%-.128s' は共有ライブラリー中にありません。"

# ER_FUNCTION_NOT_DEFINED
source: "Function '%-.192s' is not defined"
jpn: "関数 '%-.192s' は定義されていません。"

# ER_HOST_IS_BLOCKED
source: "Host '%-.64s' is blocked because of many connection errors; unblock with 'mariadb-admin flush-hosts'"
jpn: "接続エラーが多いため、ホスト '%-.64s' は拒否されました。'mariadb-admin flush-hosts' で解除できます。"

# ER_HOST_NOT_PRIVILEGED
source: "Host '%-.64s' is not allowed to connect to this MariaDB server"
jpn: "ホスト '%-.64s' からのこの MariaDB server への接続は許可されていません。"

# ER_PASSWORD_ANONYMOUS_USER 42000
source: "You are using MariaDB as an anonymous user and anonymous users are not allowed to modify user settings"
jpn: "MariaDB を匿名ユーザーで使用しているので、パスワードの変更はできません。"

# ER_PASSWORD_NOT_ALLOWED 42000
source: "You must have privileges to update tables in the mysql database to be able to change passwords for others"
jpn: "他のユーザーのパスワードを変更するためには、mysqlデータベースの表を更新する権限が必要です。"

# ER_PASSWORD_NO_MATCH 28000
source: "Can't find any matching row in the user table"
jpn: "ユーザーテーブルに該当するレコードが見つかりません。"

# ER_UPDATE_INFO
source: "Rows matched: %ld Changed: %ld Warnings: %ld"
jpn: "該当した行: %ld 変更: %ld 警告: %ld"

# ER_CANT_CREATE_THREAD
source: "Can't create a new thread (errno %M); if you are not out of available memory, you can consult the manual for a possible OS-dependent bug"
jpn: "新規にスレッドを作成できません。(エラー番号 %M) もしも使用可能メモリーの不足でなければ、OS依存のバグである可能性があります。"

# ER_WRONG_VALUE_COUNT_ON_ROW 21S01
source: "Column count doesn't match value count at row %lu"
jpn: "%lu 行目で、列の数が値の数と一致しません。"

# ER_CANT_REOPEN_TABLE
source: "Can't reopen table: '%-.192s'"
jpn: "表を再オープンできません。: '%-.192s'"

# ER_INVALID_USE_OF_NULL 22004
source: "Invalid use of NULL value"
jpn: "NULL 値の使用方法が不適切です。"

# ER_REGEXP_ERROR 42000
source: "Regex error '%s'"
jpn: "regexp がエラー '%s' を返しました。"

# ER_MIX_OF_GROUP_FUNC_AND_FIELDS 42000
source: "Mixing of GROUP columns (MIN(),MAX(),COUNT(),...) with no GROUP columns is illegal if there is no GROUP BY clause"
jpn: "GROUP BY句が無い場合、集計関数(MIN(),MAX(),COUNT(),...)と通常の列を同時に使用できません。"

# ER_NONEXISTING_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s'"
jpn: "ユーザー '%-.48s' (ホスト '%-.64s' 上) は許可されていません。"

# ER_TABLEACCESS_DENIED_ERROR 42000
source: "%-.100T command denied to user '%s'@'%s' for table '%-.192s'"
jpn: "コマンド %-.100T は ユーザー '%s'@'%s' ,テーブル '%-.192s' に対して許可されていません"

# ER_COLUMNACCESS_DENIED_ERROR 42000
source: "%-.32s command denied to user '%s'@'%s' for column '%-.192s' in table '%-.192s'"
jpn: "コマンド %-.32s は ユーザー '%s'@'%s'\n カラム '%-.192s' テーブル '%-.192s' に対して許可されていません"

# ER_ILLEGAL_GRANT_FOR_TABLE 42000
source: "Illegal GRANT/REVOKE command; please consult the manual to see which privileges can be used"
jpn: "不正な GRANT/REVOKE コマンドです。どの権限で利用可能かはマニュアルを参照して下さい。"

# ER_GRANT_WRONG_HOST_OR_USER 42000
source: "The host or user argument to GRANT is too long"
jpn: "GRANTコマンドへの、ホスト名やユーザー名が長すぎます。"

# ER_NO_SUCH_TABLE 42S02
source: "Table '%-.192s.%-.192s' doesn't exist"
jpn: "表 '%-.192s.%-.192s' は存在しません。"

# ER_NONEXISTING_TABLE_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s' on table '%-.192s'"
jpn: "ユーザー '%-.48s' (ホスト '%-.64s' 上) の表 '%-.192s' への権限は定義されていません。"

# ER_NOT_ALLOWED_COMMAND 42000
source: "The used command is not allowed with this MariaDB version"
jpn: "このMariaDBバージョンでは利用できないコマンドです。"

# ER_SYNTAX_ERROR 42000
source: "You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use"
jpn: "SQL構文エラーです。バージョンに対応するマニュアルを参照して正しい構文を確認してください。"

# ER_DELAYED_CANT_CHANGE_LOCK
source: "Delayed insert thread couldn't get requested lock for table %-.192s"
jpn: "'Delayed insert'スレッドが表 '%-.192s' のロックを取得できませんでした。"

# ER_TOO_MANY_DELAYED_THREADS
source: "Too many delayed threads in use"
jpn: "'Delayed insert'スレッドが多すぎます。"

# ER_ABORTING_CONNECTION 08S01
source: "Aborted connection %ld to db: '%-.192s' user: '%-.48s' (%-.64s)"
jpn: "接続 %ld が中断されました。データベース: '%-.192s' ユーザー: '%-.48s' (%-.64s)"

# ER_NET_PACKET_TOO_LARGE 08S01
source: "Got a packet bigger than 'max_allowed_packet' bytes"
jpn: "'max_allowed_packet'よりも大きなパケットを受信しました。"

# ER_NET_READ_ERROR_FROM_PIPE 08S01
source: "Got a read error from the connection pipe"
jpn: "接続パイプの読み込みエラーです。"

# ER_NET_FCNTL_ERROR 08S01
source: "Got an error from fcntl()"
jpn: "fcntl()がエラーを返しました。"

# ER_NET_PACKETS_OUT_OF_ORDER 08S01
source: "Got packets out of order"
jpn: "不正な順序のパケットを受信しました。"

# ER_NET_UNCOMPRESS_ERROR 08S01
source: "Couldn't uncompress communication packet"
jpn: "圧縮パケットの展開ができませんでした。"

# ER_NET_READ_ERROR 08S01
source: "Got an error reading communication packets"
jpn: "パケットの受信でエラーが発生しました。"

# ER_NET_READ_INTERRUPTED 08S01
source: "Got timeout reading communication packets"
jpn: "パケットの受信でタイムアウトが発生しました。"

# ER_NET_ERROR_ON_WRITE 08S01
source: "Got an error writing communication packets"
jpn: "パケットの送信でエラーが発生しました。"

# ER_NET_WRITE_INTERRUPTED 08S01
source: "Got timeout writing communication packets"
jpn: "パケットの送信でタイムアウトが発生しました。"

# ER_TOO_LONG_STRING 42000
source: "Result string is longer than 'max_allowed_packet' bytes"
jpn: "結果の文字列が 'max_allowed_packet' よりも大きいです。"

# ER_DELAYED_INSERT_TABLE_LOCKED
source: "INSERT DELAYED can't be used with table '%-.192s' because it is locked with LOCK TABLES"
jpn: "表 '%-.192s' はLOCK TABLESでロックされているため、INSERT DELAYEDを使用できません。"

# ER_WRONG_COLUMN_NAME 42000
source: "Incorrect column name '%-.100s'"
jpn: "列名 '%-.100s' は不正です。"

# ER_WRONG_MRG_TABLE
source: "Unable to open underlying table which is differently defined or of non-MyISAM type or doesn't exist"
jpn: "MERGE表の構成表がオープンできません。列定義が異なるか、MyISAM表ではないか、存在しません。"

# ER_DUP_UNIQUE 23000
source: "Can't write, because of unique constraint, to table '%-.192s'"
jpn: "一意性制約違反のため、表 '%-.192s' に書き込めません。"

# ER_BLOB_KEY_WITHOUT_LENGTH 42000
source: "BLOB/TEXT column '%-.192s' used in key specification without a key length"
jpn: "BLOB列 '%-.192s' をキーに使用するには長さ指定が必要です。"

# ER_PRIMARY_CANT_HAVE_NULL 42000
source: "All parts of a PRIMARY KEY must be NOT NULL; if you need NULL in a key, use UNIQUE instead"
jpn: "PRIMARY KEYの列は全てNOT NULLでなければいけません。UNIQUE索引であればNULLを含むことが可能です。"

# ER_TOO_MANY_ROWS 42000
source: "Result consisted of more than one row"
jpn: "結果が2行以上です。"

# ER_REQUIRES_PRIMARY_KEY 42000
source: "This table type requires a primary key"
jpn: "使用のストレージエンジンでは、PRIMARY KEYが必要です。"

# ER_NO_RAID_COMPILED
source: "This version of MariaDB is not compiled with RAID support"
jpn: "このバージョンのMariaDBはRAIDサポートを含めてコンパイルされていません。"

# ER_UPDATE_WITHOUT_KEY_IN_SAFE_MODE
source: "You are using safe update mode and you tried to update a table without a WHERE that uses a KEY column"
jpn: "'safe update mode'で、索引を利用するWHERE句の無い更新処理を実行しようとしました。"

# ER_KEY_DOES_NOT_EXISTS 42000 S1009
source: "Key '%-.192s' doesn't exist in table '%-.192s'"
jpn: "索引 '%-.192s' は表 '%-.192s' には存在しません。"

# ER_CHECK_NO_SUCH_TABLE 42000
source: "Can't open table"
jpn: "表をオープンできません。"

# ER_CHECK_NOT_IMPLEMENTED 42000
source: "The storage engine for the table doesn't support %s"
jpn: "この表のストレージエンジンは '%s' を利用できません。"

# ER_CANT_DO_THIS_DURING_AN_TRANSACTION 25000
source: "You are not allowed to execute this command in a transaction"
jpn: "このコマンドはトランザクション内で実行できません。"

# ER_ERROR_DURING_COMMIT
source: "Got error %M during COMMIT"
jpn: "COMMIT中にエラー %M が発生しました。"

# ER_ERROR_DURING_ROLLBACK
source: "Got error %M during ROLLBACK"
jpn: "ROLLBACK中にエラー %M が発生しました。"

# ER_ERROR_DURING_FLUSH_LOGS
source: "Got error %M during FLUSH_LOGS"
jpn: "FLUSH_LOGS中にエラー %M が発生しました。"

# ER_ERROR_DURING_CHECKPOINT
source: "Got error %M during CHECKPOINT"
jpn: "CHECKPOINT中にエラー %M が発生しました。"

# ER_NEW_ABORTING_CONNECTION 08S01
source: "Aborted connection %lld to db: '%-.192s' user: '%-.48s' host: '%-.64s' (%-.64s)"
jpn: "接続 %lld が中断されました。データベース: '%-.192s' ユーザー: '%-.48s' ホスト: '%-.64s' (%-.64s)"

# ER_FLUSH_MASTER_BINLOG_CLOSED
source: "Binlog closed, cannot RESET MASTER"
jpn: "バイナリログがクローズされています。RESET MASTER を実行できません。"

# ER_INDEX_REBUILD
source: "Failed rebuilding the index of dumped table '%-.192s'"
jpn: "ダンプ表 '%-.192s' の索引再構築に失敗しました。"

# ER_MASTER
source: "Error from master: '%-.64s'"
jpn: "マスターでエラーが発生: '%-.64s'"

# ER_MASTER_NET_READ 08S01
source: "Net error reading from master"
jpn: "マスターからのデータ受信中のネットワークエラー"

# ER_MASTER_NET_WRITE 08S01
source: "Net error writing to master"
jpn: "マスターへのデータ送信中のネットワークエラー"

# ER_FT_MATCHING_KEY_NOT_FOUND
source: "Can't find FULLTEXT index matching the column list"
jpn: "列リストに対応する全文索引(FULLTEXT)が見つかりません。"

# ER_LOCK_OR_ACTIVE_TRANSACTION
source: "Can't execute the given command because you have active locked tables or an active transaction"
jpn: "すでにアクティブな表ロックやトランザクションがあるため、コマンドを実行できません。"

# ER_UNKNOWN_SYSTEM_VARIABLE
source: "Unknown system variable '%-.*s'"
jpn: "'%-.*s' は不明なシステム変数です。"

# ER_CRASHED_ON_USAGE
source: "Table '%-.192s' is marked as crashed and should be repaired"
jpn: "表 '%-.192s' は壊れています。修復が必要です。"

# ER_CRASHED_ON_REPAIR
source: "Table '%-.192s' is marked as crashed and last (automatic?) repair failed"
jpn: "表 '%-.192s' は壊れています。修復(自動？)にも失敗しています。"

# ER_WARNING_NOT_COMPLETE_ROLLBACK
source: "Some non-transactional changed tables couldn't be rolled back"
jpn: "トランザクション対応ではない表への変更はロールバックされません。"

# ER_TRANS_CACHE_FULL
source: "Multi-statement transaction required more than 'max_binlog_cache_size' bytes of storage; increase this mariadbd variable and try again"
jpn: "複数ステートメントから成るトランザクションが 'max_binlog_cache_size' 以上の容量を必要としました。このシステム変数を増加して、再試行してください。"

# ER_SLAVE_NOT_RUNNING
source: "This operation requires a running slave; configure slave and do START SLAVE"
jpn: "この処理は、稼働中のスレーブでなければ実行できません。スレーブの設定をしてSTART SLAVEコマンドを実行してください。"

# ER_BAD_SLAVE
source: "The server is not configured as slave; fix in config file or with CHANGE MASTER TO"
jpn: "このサーバーはスレーブとして設定されていません。コンフィグファイルかCHANGE MASTER TOコマンドで設定して下さい。"
