Repository: vladbogo/test-translation
Catalog: jpn.xlf
Languages: jpn

# ER_MASTER_INFO
source: "Could not initialize master info structure for '%.*s'; more error messages can be found in the MariaDB error log"
jpn: "'master info '%.*s''構造体の初期化ができませんでした。MariaDBエラーログでエラーメッセージを確認してください。"

# ER_SLAVE_THREAD
source: "Could not create slave thread; check system resources"
jpn: "スレーブスレッドを作成できません。システムリソースを確認してください。"

# ER_TOO_MANY_USER_CONNECTIONS 42000
source: "User %-.64s already has more than 'max_user_connections' active connections"
jpn: "ユーザー '%-.64s' はすでに 'max_user_connections' 以上のアクティブな接続を行っています。"

# ER_SET_CONSTANTS_ONLY
source: "You may only use constant expressions in this statement"
jpn: "SET処理が失敗しました。"

# ER_LOCK_WAIT_TIMEOUT
source: "Lock wait timeout exceeded; try restarting transaction"
jpn: "ロック待ちがタイムアウトしました。トランザクションを再試行してください。"

# ER_LOCK_TABLE_FULL
source: "The total number of locks exceeds the lock table size"
jpn: "ロックの数が多すぎます。"

# ER_READ_ONLY_TRANSACTION 25000
source: "Update locks cannot be acquired during a READ UNCOMMITTED transaction"
jpn: "読み込み専用トランザクションです。"

# ER_DROP_DB_WITH_READ_LOCK
source: "DROP DATABASE not allowed while thread is holding global read lock"
jpn: "グローバルリードロックを保持している間は、DROP DATABASE を実行できません。"

# ER_CREATE_DB_WITH_READ_LOCK
source: "CREATE DATABASE not allowed while thread is holding global read lock"
jpn: "グローバルリードロックを保持している間は、CREATE DATABASE を実行できません。"

# ER_WRONG_ARGUMENTS
source: "Incorrect arguments to %s"
jpn: "%s の引数が不正です"

# ER_UNION_TABLES_IN_DIFFERENT_DIR
source: "Incorrect table definition; all MERGE tables must be in the same database"
jpn: "不正な表定義です。MERGE表の構成表はすべて同じデータベース内になければなりません。"

# ER_LOCK_DEADLOCK 40001
source: "Deadlock found when trying to get lock; try restarting transaction"
jpn: "ロック取得中にデッドロックが検出されました。トランザクションを再試行してください。"

# ER_CANNOT_ADD_FOREIGN
source: "Cannot add foreign key constraint for `%s`"
jpn: "`%s` 外部キー制約を追加できません。"

# ER_NO_REFERENCED_ROW 23000
source: "Cannot add or update a child row: a foreign key constraint fails"
jpn: "親キーがありません。外部キー制約違反です。"

# ER_ROW_IS_REFERENCED 23000
source: "Cannot delete or update a parent row: a foreign key constraint fails"
jpn: "子レコードがあります。外部キー制約違反です。"

# ER_CONNECT_TO_MASTER 08S01
source: "Error connecting to master: %-.128s"
jpn: "マスターへの接続エラー: %-.128s"

# ER_QUERY_ON_MASTER
source: "Error running query on master: %-.128s"
jpn: "マスターでのクエリ実行エラー: %-.128s"

# ER_ERROR_WHEN_EXECUTING_COMMAND
source: "Error when executing command %s: %-.128s"
jpn: "%s コマンドの実行エラー: %-.128s"

# ER_WRONG_USAGE
source: "Incorrect usage of %s and %s"
jpn: "%s の %s に関する不正な使用法です。"

# ER_WRONG_NUMBER_OF_COLUMNS_IN_SELECT 21000
source: "The used SELECT statements have a different number of columns"
jpn: "使用のSELECT文が返す列数が違います。"

# ER_CANT_UPDATE_WITH_READLOCK
source: "Can't execute the query because you have a conflicting read lock"
jpn: "競合するリードロックを保持しているので、クエリを実行できません。"

# ER_MIXING_NOT_ALLOWED
source: "Mixing of transactional and non-transactional tables is disabled"
jpn: "トランザクション対応の表と非対応の表の同時使用は無効化されています。"

# ER_DUP_ARGUMENT
source: "Option '%s' used twice in statement"
jpn: "オプション '%s' が2度使用されています。"

# ER_USER_LIMIT_REACHED 42000
source: "User '%-.64s' has exceeded the '%s' resource (current value: %ld)"
jpn: "ユーザー '%-.64s' はリソースの上限 '%s' に達しました。(現在値: %ld)"

# ER_SPECIFIC_ACCESS_DENIED_ERROR 42000
source: "Access denied; you need (at least one of) the %-.128s privilege(s) for this operation"
jpn: "アクセスは拒否されました。この操作には %-.128s 権限が(複数の場合はどれか1つ)必要です。"

# ER_LOCAL_VARIABLE
source: "Variable '%-.64s' is a SESSION variable and can't be used with SET GLOBAL"
jpn: "変数 '%-.64s' はセッション変数です。SET GLOBALでは使用できません。"

# ER_GLOBAL_VARIABLE
source: "Variable '%-.64s' is a GLOBAL variable and should be set with SET GLOBAL"
jpn: "変数 '%-.64s' はグローバル変数です。SET GLOBALを使用してください。"

# ER_NO_DEFAULT 42000
source: "Variable '%-.64s' doesn't have a default value"
jpn: "変数 '%-.64s' にはデフォルト値がありません。"

# ER_WRONG_VALUE_FOR_VAR 42000
source: "Variable '%-.64s' can't be set to the value of '%-.200T'"
jpn: "変数 '%-.64s' に値 '%-.200T' を設定できません。"

# ER_WRONG_TYPE_FOR_VAR 42000
source: "Incorrect argument type to variable '%-.64s'"
jpn: "変数 '%-.64s' への値の型が不正です。"

# ER_VAR_CANT_BE_READ
source: "Variable '%-.64s' can only be set, not read"
jpn: "変数 '%-.64s' は書き込み専用です。読み込みはできません。"

# ER_CANT_USE_OPTION_HERE 42000
source: "Incorrect usage/placement of '%s'"
jpn: "'%s' の使用法または場所が不正です。"

# ER_NOT_SUPPORTED_YET 42000
source: "This version of MariaDB doesn't yet support '%s'"
jpn: "このバージョンのMariaDBでは、まだ '%s' を利用できません。"

# ER_MASTER_FATAL_ERROR_READING_BINLOG
source: "Got fatal error %d from master when reading data from binary log: '%-.320s'"
jpn: "致命的なエラー %d: '%-.320s' がマスターでバイナリログ読み込み中に発生しました。"

# ER_SLAVE_IGNORED_TABLE
source: "Slave SQL thread ignored the query because of replicate-*-table rules"
jpn: "replicate-*-table ルールに従って、スレーブSQLスレッドはクエリを無視しました。"

# ER_INCORRECT_GLOBAL_LOCAL_VAR
source: "Variable '%-.192s' is a %s variable"
jpn: "変数 '%-.192s' は %s 変数です。"

# ER_WRONG_FK_DEF 42000
source: "Incorrect foreign key definition for '%-.192s': %s"
jpn: "外部キー '%-.192s' の定義の不正: %s"

# ER_KEY_REF_DO_NOT_MATCH_TABLE_REF
source: "Key reference and table reference don't match"
jpn: "外部キーの参照表と定義が一致しません。"

# ER_OPERAND_COLUMNS 21000
source: "Operand should contain %d column(s)"
jpn: "オペランドに %d 個の列が必要です。"

# ER_SUBQUERY_NO_1_ROW 21000
source: "Subquery returns more than 1 row"
jpn: "サブクエリが2行以上の結果を返します。"

# ER_UNKNOWN_STMT_HANDLER
source: "Unknown prepared statement handler (%.*s) given to %s"
jpn: "'%.*s' はプリペアードステートメントの不明なハンドルです。(%s で指定されました)"

# ER_CORRUPT_HELP_DB
source: "Help database is corrupt or does not exist"
jpn: "ヘルプデータベースは壊れているか存在しません。"

# ER_CYCLIC_REFERENCE
source: "Cyclic reference on subqueries"
jpn: "サブクエリの参照がループしています。"

# ER_AUTO_CONVERT
source: "Converting column '%s' from %s to %s"
jpn: "列 '%s' を %s から %s へ変換します。"

# ER_ILLEGAL_REFERENCE 42S22
source: "Reference '%-.64s' not supported (%s)"
jpn: "'%-.64s' の参照はできません。(%s)"

# ER_DERIVED_MUST_HAVE_ALIAS 42000
source: "Every derived table must have its own alias"
jpn: "導出表には別名が必須です。"

# ER_SELECT_REDUCED 01000
source: "Select %u was reduced during optimization"
jpn: "Select %u は最適化によって減らされました。"

# ER_TABLENAME_NOT_ALLOWED_HERE 42000
source: "Table '%-.192s' from one of the SELECTs cannot be used in %-.32s"
jpn: "特定のSELECTのみで使用の表 '%-.192s' は %-.32s では使用できません。"

# ER_NOT_SUPPORTED_AUTH_MODE 08004
source: "Client does not support authentication protocol requested by server; consider upgrading MariaDB client"
jpn: "クライアントはサーバーが要求する認証プロトコルに対応できません。MariaDBクライアントのアップグレードを検討してください。"

# ER_SPATIAL_CANT_HAVE_NULL 42000
source: "All parts of a SPATIAL index must be NOT NULL"
jpn: "空間索引のキー列は NOT NULL でなければいけません。"

# ER_COLLATION_CHARSET_MISMATCH 42000
source: "COLLATION '%s' is not valid for CHARACTER SET '%s'"
jpn: "COLLATION '%s' は CHARACTER SET '%s' に適用できません。"

# ER_SLAVE_WAS_RUNNING
source: "Slave is already running"
jpn: "スレーブはすでに稼働中です。"

# ER_SLAVE_WAS_NOT_RUNNING
source: "Slave already has been stopped"
jpn: "スレーブはすでに停止しています。"

# ER_TOO_BIG_FOR_UNCOMPRESS
source: "Uncompressed data size too large; the maximum size is %d (probably, length of uncompressed data was corrupted)"
jpn: "展開後のデータが大きすぎます。最大サイズは %d です。(展開後データの長さ情報が壊れている可能性もあります。)"

# ER_ZLIB_Z_MEM_ERROR
source: "ZLIB: Not enough memory"
jpn: "ZLIB: メモリ不足です。"

# ER_ZLIB_Z_BUF_ERROR
source: "ZLIB: Not enough room in the output buffer (probably, length of uncompressed data was corrupted)"
jpn: "ZLIB: 出力バッファに十分な空きがありません。(展開後データの長さ情報が壊れている可能性もあります。)"

# ER_ZLIB_Z_DATA_ERROR
source: "ZLIB: Input data corrupted"
jpn: "ZLIB: 入力データが壊れています。"

# ER_WARN_TOO_FEW_RECORDS 01000
source: "Row %lu doesn't contain data for all columns"
jpn: "行 %lu はすべての列へのデータを含んでいません。"

# ER_WARN_TOO_MANY_RECORDS 01000
source: "Row %lu was truncated; it contained more data than there were input columns"
jpn: "行 %lu はデータを切り捨てられました。列よりも多いデータを含んでいました。"

# ER_WARN_NULL_TO_NOTNULL 22004
source: "Column set to default value; NULL supplied to NOT NULL column '%s' at row %lu"
jpn: "列にデフォルト値が設定されました。NOT NULLの列 '%s' に 行 %lu で NULL が与えられました。"

# WARN_DATA_TRUNCATED 01000
source: "Data truncated for column '%s' at row %lu"
jpn: "列 '%s' の 行 %lu でデータが切り捨てられました。"

# ER_WARN_USING_OTHER_HANDLER
source: "Using storage engine %s for table '%s'"
jpn: "ストレージエンジン %s が表 '%s' に利用されています。"

# ER_CANT_AGGREGATE_2COLLATIONS
source: "Illegal mix of collations (%s,%s) and (%s,%s) for operation '%s'"
jpn: "照合順序 (%s,%s) と (%s,%s) の混在は操作 '%s' では不正です。"

# ER_REVOKE_GRANTS
source: "Can't revoke all privileges for one or more of the requested users"
jpn: "指定されたユーザーから指定された全ての権限を剥奪することができませんでした。"

# ER_CANT_AGGREGATE_3COLLATIONS
source: "Illegal mix of collations (%s,%s), (%s,%s), (%s,%s) for operation '%s'"
jpn: "照合順序 (%s,%s), (%s,%s), (%s,%s) の混在は操作 '%s' では不正です。"

# ER_CANT_AGGREGATE_NCOLLATIONS
source: "Illegal mix of collations for operation '%s'"
jpn: "操作 '%s' では不正な照合順序の混在です。"

# ER_VARIABLE_IS_NOT_STRUCT
source: "Variable '%-.64s' is not a variable component (can't be used as XXXX.variable_name)"
jpn: "変数 '%-.64s' は構造変数の構成要素ではありません。(XXXX.変数名 という指定はできません。)"

# ER_UNKNOWN_COLLATION
source: "Unknown collation: '%-.64s'"
jpn: "不明な照合順序: '%-.64s'"

# ER_SLAVE_IGNORED_SSL_PARAMS
source: "SSL parameters in CHANGE MASTER are ignored because this MariaDB slave was compiled without SSL support; they can be used later if MariaDB slave with SSL is started"
jpn: "このMariaDBスレーブはSSLサポートを含めてコンパイルされていないので、CHANGE MASTER のSSLパラメータは無視されました。今後SSLサポートを持つMariaDBスレーブを起動する際に利用されます。"

# ER_SERVER_IS_IN_SECURE_AUTH_MODE
source: "Server is running in --secure-auth mode, but '%s'@'%s' has a password in the old format; please change the password to the new format"
jpn: "サーバーは --secure-auth モードで稼働しています。しかし '%s'@'%s' は古い形式のパスワードを使用しています。新しい形式のパスワードに変更してください。"

# ER_WARN_FIELD_RESOLVED
source: "Field or reference '%-.192s%s%-.192s%s%-.192s' of SELECT #%d was resolved in SELECT #%d"
jpn: "フィールドまたは参照 '%-.192s%s%-.192s%s%-.192s' は SELECT #%d ではなく、SELECT #%d で解決されました。"

# ER_BAD_SLAVE_UNTIL_COND
source: "Incorrect parameter or combination of parameters for START SLAVE UNTIL"
jpn: "START SLAVE UNTIL へのパラメータまたはその組み合わせが不正です。"

# ER_MISSING_SKIP_SLAVE
source: "It is recommended to use --skip-slave-start when doing step-by-step replication with START SLAVE UNTIL; otherwise, you will get problems if you get an unexpected slave's mariadbd restart"
jpn: "START SLAVE UNTIL で段階的にレプリケーションを行う際には、--skip-slave-start オプションを使うことを推奨します。使わない場合、スレーブのmariadbdが不慮の再起動をすると問題が発生します。"

# ER_UNTIL_COND_IGNORED
source: "SQL thread is not to be started so UNTIL options are ignored"
jpn: "スレーブSQLスレッドが開始されないため、UNTILオプションは無視されました。"

# ER_WRONG_NAME_FOR_INDEX 42000
source: "Incorrect index name '%-.100s'"
jpn: "索引名 '%-.100s' は不正です。"

# ER_WRONG_NAME_FOR_CATALOG 42000
source: "Incorrect catalog name '%-.100s'"
jpn: "カタログ名 '%-.100s' は不正です。"

# ER_BAD_FT_COLUMN
source: "Column '%-.192s' cannot be part of FULLTEXT index"
jpn: "列 '%-.192s' は全文索引のキーにはできません。"

# ER_UNKNOWN_KEY_CACHE
source: "Unknown key cache '%-.100s'"
jpn: "'%-.100s' は不明なキーキャッシュです。"

# ER_WARN_HOSTNAME_WONT_WORK
source: "MariaDB is started in --skip-name-resolve mode; you must restart it without this switch for this grant to work"
jpn: "MariaDBは --skip-name-resolve モードで起動しています。このオプションを外して再起動しなければ、この権限操作は機能しません。"

# ER_UNKNOWN_STORAGE_ENGINE 42000
source: "Unknown storage engine '%s'"
jpn: "'%s' は不明なストレージエンジンです。"

# ER_WARN_DEPRECATED_SYNTAX
source: "'%s' is deprecated and will be removed in a future release. Please use %s instead"
jpn: "'%s' は将来のリリースで廃止予定です。代わりに %s を使用してください。"

# ER_NON_UPDATABLE_TABLE
source: "The target table %-.100s of the %s is not updatable"
jpn: "対象表 %-.100s は更新可能ではないので、%s を行えません。"

# ER_FEATURE_DISABLED
source: "The '%s' feature is disabled; you need MariaDB built with '%s' to have it working"
jpn: "機能 '%s' は無効です。利用するためには '%s' を含めてビルドしたMariaDBが必要です。"

# ER_OPTION_PREVENTS_STATEMENT
source: "The MariaDB server is running with the %s option so it cannot execute this statement"
jpn: "MariaDBサーバーが %s オプションで実行されているので、このステートメントは実行できません。"

# ER_DUPLICATED_VALUE_IN_TYPE
source: "Column '%-.100s' has duplicated value '%-.64s' in %s"
jpn: "列 '%-.100s' で、重複する値 '%-.64s' が %s に指定されています。"

# ER_TRUNCATED_WRONG_VALUE 22007
source: "Truncated incorrect %-.32T value: '%-.128T'"
jpn: "不正な %-.32T の値が切り捨てられました。: '%-.128T'"

# ER_TOO_MUCH_AUTO_TIMESTAMP_COLS
source: "Incorrect table definition; there can be only one TIMESTAMP column with CURRENT_TIMESTAMP in DEFAULT or ON UPDATE clause"
jpn: "不正な表定義です。DEFAULT句またはON UPDATE句に CURRENT_TIMESTAMP をともなうTIMESTAMP型の列は1つまでです。"

# ER_INVALID_ON_UPDATE
source: "Invalid ON UPDATE clause for '%-.192s' column"
jpn: "列 '%-.192s' に ON UPDATE句は無効です。"

# ER_GET_ERRMSG
source: "Got error %d '%-.200s' from %s"
jpn: "エラー %d '%-.200s' が %s から返されました。"

# ER_GET_TEMPORARY_ERRMSG
source: "Got temporary error %d '%-.200s' from %s"
jpn: "一時エラー %d '%-.200s' が %s から返されました。"

# ER_STACK_OVERRUN_NEED_MORE
source: "Thread stack overrun: %ld bytes used of a %ld byte stack, and %ld bytes needed. Consider increasing the thread_stack system variable."
jpn: "スレッドスタック不足です(使用: %ld ; サイズ: %ld ; 要求: %ld)。より大きい値で 'mariadbd --thread_stack=#' の指定をしてください。"

# ER_NON_INSERTABLE_TABLE
source: "The target table %-.100s of the %s is not insertable-into"
jpn: "対象表 %-.100s は挿入可能ではないので、%s を行えません。"

# ER_DUP_ENTRY_WITH_KEY_NAME 23000 S1009
source: "Duplicate entry '%-.64T' for key '%-.192s'"
jpn: "'%-.64T' は索引 '%-.192s' で重複しています。"

# ER_DUP_UNKNOWN_IN_INDEX 23000
source: "Duplicate entry for key '%-.192s'"
jpn: "は索引 '%-.192s' で重複しています。"
