Repository: vladbogo/test-translation
Catalog: kor.xlf
Languages: kor

# ER_NO
source: "NO"
kor: "아니오"

# ER_YES
source: "YES"
kor: "예"

# ER_CANT_CREATE_FILE
source: "Can't create file '%-.200s' (errno: %M)"
kor: "화일 '%-.200s'를 만들지 못했습니다. (에러번호: %M)"

# ER_CANT_CREATE_TABLE
source: "Can't create table %`s.%`s (errno: %M)"
kor: "테이블 %`s.%`s를 만들지 못했습니다. (에러번호: %M)"

# ER_CANT_CREATE_DB
source: "Can't create database '%-.192s' (errno: %M)"
kor: "데이타베이스 '%-.192s'를 만들지 못했습니다.. (에러번호: %M)"

# ER_DB_CREATE_EXISTS
source: "Can't create database '%-.192s'; database exists"
kor: "데이타베이스 '%-.192s'를 만들지 못했습니다.. 데이타베이스가 존재함"

# ER_DB_DROP_EXISTS
source: "Can't drop database '%-.192s'; database doesn't exist"
kor: "데이타베이스 '%-.192s'를 제거하지 못했습니다. 데이타베이스가 존재하지 않음 "

# ER_DB_DROP_DELETE
source: "Error dropping database (can't delete '%-.192s', errno: %M)"
kor: "데이타베이스 제거 에러('%-.192s'를 삭제할 수 없습니다, 에러번호: %M)"

# ER_DB_DROP_RMDIR
source: "Error dropping database (can't rmdir '%-.192s', errno: %M)"
kor: "데이타베이스 제거 에러(rmdir '%-.192s'를 할 수 없습니다, 에러번호: %M)"

# ER_CANT_DELETE_FILE
source: "Error on delete of '%-.192s' (errno: %M)"
kor: "'%-.192s' 삭제 중 에러 (에러번호: %M)"

# ER_CANT_FIND_SYSTEM_REC
source: "Can't read record in system table"
kor: "system 테이블에서 레코드를 읽을 수 없습니다."

# ER_CANT_GET_STAT
source: "Can't get status of '%-.200s' (errno: %M)"
kor: "'%-.200s'의 상태를 얻지 못했습니다. (에러번호: %M)"

# ER_CANT_GET_WD
source: "Can't get working directory (errno: %M)"
kor: "수행 디렉토리를 찾지 못했습니다. (에러번호: %M)"

# ER_CANT_LOCK
source: "Can't lock file (errno: %M)"
kor: "화일을 잠그지(lock) 못했습니다. (에러번호: %M)"

# ER_CANT_OPEN_FILE
source: "Can't open file: '%-.200s' (errno: %M)"
kor: "화일을 열지 못했습니다.: '%-.200s' (에러번호: %M)"

# ER_FILE_NOT_FOUND
source: "Can't find file: '%-.200s' (errno: %M)"
kor: "화일을 찾지 못했습니다.: '%-.200s' (에러번호: %M)"

# ER_CANT_READ_DIR
source: "Can't read dir of '%-.192s' (errno: %M)"
kor: "'%-.192s'디렉토리를 읽지 못했습니다. (에러번호: %M)"

# ER_CANT_SET_WD
source: "Can't change dir to '%-.192s' (errno: %M)"
kor: "'%-.192s'디렉토리로 이동할 수 없었습니다. (에러번호: %M)"

# ER_CHECKREAD
source: "Record has changed since last read in table '%-.192s'"
kor: "테이블 '%-.192s'에서 마지막으로 읽은 후 Record가 변경되었습니다."

# ER_DISK_FULL
source: "Disk full (%s); waiting for someone to free some space... (errno: %M)"
kor: "Disk full (%s). 다른 사람이 지울때까지 기다립니다... (에러번호: %M)"

# ER_DUP_KEY 23000
source: "Can't write; duplicate key in table '%-.192s'"
kor: "기록할 수 없습니다., 테이블 '%-.192s'에서 중복 키"

# ER_ERROR_ON_CLOSE
source: "Error on close of '%-.192s' (errno: %M)"
kor: "'%-.192s'닫는 중 에러 (에러번호: %M)"

# ER_ERROR_ON_READ
source: "Error reading file '%-.200s' (errno: %M)"
kor: "'%-.200s'화일 읽기 에러 (에러번호: %M)"

# ER_ERROR_ON_RENAME
source: "Error on rename of '%-.210s' to '%-.210s' (errno: %M)"
kor: "'%-.210s'를 '%-.210s'로 이름 변경중 에러 (에러번호: %M)"

# ER_ERROR_ON_WRITE
source: "Error writing file '%-.200s' (errno: %M)"
kor: "'%-.200s'화일 기록 중 에러 (에러번호: %M)"

# ER_FILE_USED
source: "'%-.192s' is locked against change"
kor: "'%-.192s'가 변경할 수 없도록 잠겨있습니다."

# ER_FILSORT_ABORT
source: "Sort aborted"
kor: "소트가 중단되었습니다."

# ER_FORM_NOT_FOUND
source: "View '%-.192s' doesn't exist for '%-.192s'"
kor: "뷰 '%-.192s'가 '%-.192s'에서는 존재하지 않습니다."

# ER_KEY_NOT_FOUND
source: "Can't find record in '%-.192s'"
kor: "'%-.192s'에서 레코드를 찾을 수 없습니다."

# ER_NOT_FORM_FILE
source: "Incorrect information in file: '%-.200s'"
kor: "화일의 부정확한 정보: '%-.200s'"

# ER_NOT_KEYFILE
source: "Index for table '%-.200s' is corrupt; try to repair it"
kor: "'%-.200s' 테이블의 부정확한 키 존재. 수정하시오!"

# ER_OLD_KEYFILE
source: "Old key file for table '%-.192s'; repair it!"
kor: "'%-.192s' 테이블의 이전버젼의 키 존재. 수정하시오!"

# ER_OPEN_AS_READONLY
source: "Table '%-.192s' is read only"
kor: "테이블 '%-.192s'는 읽기전용 입니다."

# ER_OUTOFMEMORY HY001 S1001
source: "Out of memory; restart server and try again (needed %d bytes)"
kor: "Out of memory. 데몬을 재 실행 후 다시 시작하시오 (needed %d bytes)"

# ER_OUT_OF_SORTMEMORY HY001 S1001
source: "Out of sort memory, consider increasing server sort buffer size"
kor: "Out of sort memory. daemon sort buffer의 크기를 증가시키세요"

# ER_UNEXPECTED_EOF
source: "Unexpected EOF found when reading file '%-.192s' (errno: %M)"
kor: "'%-.192s' 화일을 읽는 도중 잘못된 eof을 발견 (에러번호: %M)"

# ER_CON_COUNT_ERROR 08004
source: "Too many connections"
kor: "너무 많은 연결... max_connection을 증가 시키시오..."

# ER_BAD_HOST_ERROR 08S01
source: "Can't get hostname for your address"
kor: "당신의 컴퓨터의 호스트이름을 얻을 수 없습니다."

# ER_DBACCESS_DENIED_ERROR 42000
source: "Access denied for user '%s'@'%s' to database '%-.192s'"
kor: "'%s'@'%s' 사용자는 '%-.192s' 데이타베이스에 접근이 거부 되었습니다."

# ER_ACCESS_DENIED_ERROR 28000
source: "Access denied for user '%s'@'%s' (using password: %s)"
kor: "'%s'@'%s' 사용자는 접근이 거부 되었습니다. (using password: %s)"

# ER_NO_DB_ERROR 3D000
source: "No database selected"
kor: "선택된 데이타베이스가 없습니다."

# ER_UNKNOWN_COM_ERROR 08S01
source: "Unknown command"
kor: "명령어가 뭔지 모르겠어요..."

# ER_BAD_NULL_ERROR 23000
source: "Column '%-.192s' cannot be null"
kor: "칼럼 '%-.192s'는 널(Null)이 되면 안됩니다. "

# ER_BAD_DB_ERROR 42000
source: "Unknown database '%-.192s'"
kor: "데이타베이스 '%-.192s'는 알수 없음"

# ER_TABLE_EXISTS_ERROR 42S01
source: "Table '%-.192s' already exists"
kor: "테이블 '%-.192s'는 이미 존재함"

# ER_BAD_TABLE_ERROR 42S02
source: "Unknown table '%-.100T'"
kor: "테이블 '%-.100T'는 알수 없음"

# ER_NON_UNIQ_ERROR 23000
source: "Column '%-.192s' in %-.192s is ambiguous"
kor: "칼럼: '%-.192s' in '%-.192s' 이 모호함"

# ER_SERVER_SHUTDOWN 08S01
source: "Server shutdown in progress"
kor: "Server가 셧다운 중입니다."

# ER_BAD_FIELD_ERROR 42S22 S0022
source: "Unknown column '%-.192s' in '%-.192s'"
kor: "Unknown 칼럼 '%-.192s' in '%-.192s'"

# ER_WRONG_FIELD_WITH_GROUP 42000 S1009
source: "'%-.192s' isn't in GROUP BY"
kor: "'%-.192s'은 GROUP BY속에 없음"

# ER_WRONG_GROUP_FIELD 42000 S1009
source: "Can't group on '%-.192s'"
kor: "'%-.192s'를 그룹할 수 없음"

# ER_WRONG_SUM_SELECT 42000 S1009
source: "Statement has sum functions and columns in same statement"
kor: "Statement 가 sum기능을 동작중이고 칼럼도 동일한 statement입니다."

# ER_WRONG_VALUE_COUNT 21S01
source: "Column count doesn't match value count"
kor: "칼럼의 카운트가 값의 카운트와 일치하지 않습니다."

# ER_TOO_LONG_IDENT 42000 S1009
source: "Identifier name '%-.100T' is too long"
kor: "Identifier '%-.100T'는 너무 길군요."

# ER_DUP_FIELDNAME 42S21 S1009
source: "Duplicate column name '%-.192s'"
kor: "중복된 칼럼 이름: '%-.192s'"

# ER_DUP_KEYNAME 42000 S1009
source: "Duplicate key name '%-.192s'"
kor: "중복된 키 이름 : '%-.192s'"

# ER_DUP_ENTRY 23000 S1009
source: "Duplicate entry '%-.192T' for key %d"
kor: "중복된 입력 값 '%-.192T': key %d"

# ER_WRONG_FIELD_SPEC 42000 S1009
source: "Incorrect column specifier for column '%-.192s'"
kor: "칼럼 '%-.192s'의 부정확한 칼럼 정의자"

# ER_PARSE_ERROR 42000 s1009
source: "%s near '%-.80T' at line %d"
kor: "'%s' 에러 같습니다. ('%-.80T' 명령어 라인 %d)"

# ER_EMPTY_QUERY 42000
source: "Query was empty"
kor: "쿼리결과가 없습니다."

# ER_NONUNIQ_TABLE 42000 S1009
source: "Not unique table/alias: '%-.192s'"
kor: "Unique 하지 않은 테이블/alias: '%-.192s'"

# ER_INVALID_DEFAULT 42000 S1009
source: "Invalid default value for '%-.192s'"
kor: "'%-.192s'의 유효하지 못한 디폴트 값을 사용하셨습니다."

# ER_MULTIPLE_PRI_KEY 42000 S1009
source: "Multiple primary key defined"
kor: "Multiple primary key가 정의되어 있슴"

# ER_TOO_MANY_KEYS 42000 S1009
source: "Too many keys specified; max %d keys allowed"
kor: "너무 많은 키가 정의되어 있습니다.. 최대 %d의 키가 가능함"

# ER_TOO_MANY_KEY_PARTS 42000 S1009
source: "Too many key parts specified; max %d parts allowed"
kor: "너무 많은 키 부분(parts)들이 정의되어 있습니다.. 최대 %d 부분이 가능함"

# ER_TOO_LONG_KEY 42000 S1009
source: "Specified key was too long; max key length is %d bytes"
kor: "정의된 키가 너무 깁니다. 최대 키의 길이는 %d입니다."

# ER_KEY_COLUMN_DOES_NOT_EXIST 42000 S1009
source: "Key column '%-.192s' doesn't exist in table"
kor: "Key 칼럼 '%-.192s'는 테이블에 존재하지 않습니다."

# ER_TOO_BIG_FIELDLENGTH 42000 S1009
source: "Column length too big for column '%-.192s' (max = %lu); use BLOB or TEXT instead"
kor: "칼럼 '%-.192s'의 칼럼 길이가 너무 깁니다 (최대 = %lu). 대신에 BLOB를 사용하세요."

# ER_WRONG_AUTO_KEY 42000 S1009
source: "Incorrect table definition; there can be only one auto column and it must be defined as a key"
kor: "부정확한 테이블 정의; 테이블은 하나의 auto 칼럼이 존재하고 키로 정의되어져야 합니다."

# ER_NORMAL_SHUTDOWN
source: "%s (initiated by: %s): Normal shutdown"
kor: "%s (%s): 정상적인 shutdown"

# ER_GOT_SIGNAL
source: "%s: Got signal %d. Aborting!\n"
kor: "%s: %d 신호가 들어왔음. 중지!\n"

# ER_SHUTDOWN_COMPLETE
source: "%s: Shutdown complete\n"
kor: "%s: Shutdown 이 완료됨!\n"

# ER_FORCING_CLOSE 08S01
source: "%s: Forcing close of thread %ld user: '%-.48s'\n"
kor: "%s: thread %ld의 강제 종료 user: '%-.48s'\n"

# ER_IPSOCK_ERROR 08S01
source: "Can't create IP socket"
kor: "IP 소켓을 만들지 못했습니다."

# ER_NO_SUCH_INDEX 42S12 S1009
source: "Table '%-.192s' has no index like the one used in CREATE INDEX; recreate the table"
kor: "테이블 '%-.192s'는 인덱스를 만들지 않았습니다. alter 테이블명령을 이용하여 테이블을 수정하세요..."

# ER_WRONG_FIELD_TERMINATORS 42000 S1009
source: "Field separator argument is not what is expected; check the manual"
kor: "필드 구분자 인수들이 완전하지 않습니다. 메뉴얼을 찾아 보세요."

# ER_BLOBS_AND_NO_TERMINATED 42000 S1009
source: "You can't use fixed rowlength with BLOBs; please use 'fields terminated by'"
kor: "BLOB로는 고정길이의 lowlength를 사용할 수 없습니다. 'fields terminated by'를 사용하세요."

# ER_TEXTFILE_NOT_READABLE
source: "The file '%-.128s' must be in the database directory or be readable by all"
kor: "'%-.128s' 화일는 데이타베이스 디렉토리에 존재하거나 모두에게 읽기 가능하여야 합니다."

# ER_FILE_EXISTS_ERROR
source: "File '%-.200s' already exists"
kor: "'%-.200s' 화일은 이미 존재합니다."

# ER_LOAD_INFO
source: "Records: %ld Deleted: %ld Skipped: %ld Warnings: %ld"
kor: "레코드: %ld개 삭제: %ld개 스킵: %ld개 경고: %ld개"

# ER_ALTER_INFO
source: "Records: %ld Duplicates: %ld"
kor: "레코드: %ld개 중복: %ld개"

# ER_WRONG_SUB_KEY
source: "Incorrect prefix key; the used key part isn't a string, the used length is longer than the key part, or the storage engine doesn't support unique prefix keys"
kor: "부정확한 서버 파트 키. 사용된 키 파트가 스트링이 아니거나 키 파트의 길이가 너무 깁니다."

# ER_CANT_REMOVE_ALL_FIELDS 42000
source: "You can't delete all columns with ALTER TABLE; use DROP TABLE instead"
kor: "ALTER TABLE 명령으로는 모든 칼럼을 지울 수 없습니다. DROP TABLE 명령을 이용하세요."

# ER_INSERT_INFO
source: "Records: %ld Duplicates: %ld Warnings: %ld"
kor: "레코드: %ld개 중복: %ld개 경고: %ld개"

# ER_NO_SUCH_THREAD
source: "Unknown thread id: %lu"
kor: "알수 없는 쓰레드 id: %lu"

# ER_KILL_DENIED_ERROR
source: "You are not owner of thread %lld"
kor: "쓰레드(Thread) %lld의 소유자가 아닙니다."

# ER_NO_TABLES_USED
source: "No tables used"
kor: "어떤 테이블도 사용되지 않았습니다."

# ER_TOO_BIG_SET
source: "Too many strings for column %-.192s and SET"
kor: "칼럼 %-.192s와 SET에서 스트링이 너무 많습니다."

# ER_NO_UNIQUE_LOGFILE
source: "Can't generate a unique log-filename %-.200s.(1-999)\n"
kor: "Unique 로그화일 '%-.200s'를 만들수 없습니다.(1-999)\n"

# ER_TABLE_NOT_LOCKED_FOR_WRITE
source: "Table '%-.192s' was locked with a READ lock and can't be updated"
kor: "테이블 '%-.192s'는 READ 락이 잠겨있어서 갱신할 수 없습니다."

# ER_TABLE_NOT_LOCKED
source: "Table '%-.192s' was not locked with LOCK TABLES"
kor: "테이블 '%-.192s'는 LOCK TABLES 명령으로 잠기지 않았습니다."

# ER_WRONG_DB_NAME 42000
source: "Incorrect database name '%-.100T'"
kor: "'%-.100T' 데이타베이스의 이름이 부정확합니다."

# ER_WRONG_TABLE_NAME 42000
source: "Incorrect table name '%-.100s'"
kor: "'%-.100s' 테이블 이름이 부정확합니다."

# ER_TOO_BIG_SELECT 42000
source: "The SELECT would examine more than MAX_JOIN_SIZE rows; check your WHERE and use SET SQL_BIG_SELECTS=1 or SET MAX_JOIN_SIZE=# if the SELECT is okay"
kor: "SELECT 명령에서 너무 많은 레코드를 찾기 때문에 많은 시간이 소요됩니다. 따라서 WHERE 문을 점검하거나, 만약 SELECT가 ok되면 SET SQL_BIG_SELECTS=1 옵션을 사용하세요."

# ER_UNKNOWN_ERROR
source: "Unknown error"
kor: "알수 없는 에러입니다."

# ER_UNKNOWN_PROCEDURE 42000
source: "Unknown procedure '%-.192s'"
kor: "알수 없는 수행문 : '%-.192s'"

# ER_WRONG_PARAMCOUNT_TO_PROCEDURE 42000
source: "Incorrect parameter count to procedure '%-.192s'"
kor: "'%-.192s' 수행문에 대한 부정확한 파라메터"

# ER_WRONG_PARAMETERS_TO_PROCEDURE
source: "Incorrect parameters to procedure '%-.192s'"
kor: "'%-.192s' 수행문에 대한 부정확한 파라메터"

# ER_UNKNOWN_TABLE 42S02
source: "Unknown table '%-.192s' in %-.32s"
kor: "알수 없는 테이블 '%-.192s' (데이타베이스 %-.32s)"

# ER_FIELD_SPECIFIED_TWICE 42000
source: "Column '%-.192s' specified twice"
kor: "칼럼 '%-.192s'는 두번 정의되어 있습니다."

# ER_INVALID_GROUP_FUNC_USE
source: "Invalid use of group function"
kor: "잘못된 그룹 함수를 사용하였습니다."

# ER_UNSUPPORTED_EXTENSION 42000
source: "Table '%-.192s' uses an extension that doesn't exist in this MariaDB version"
kor: "테이블 '%-.192s'는 확장명령을 이용하지만 현재의 MariaDB 버젼에서는 존재하지 않습니다."

# ER_TABLE_MUST_HAVE_COLUMNS 42000
source: "A table must have at least 1 column"
kor: "하나의 테이블에서는 적어도 하나의 칼럼이 존재하여야 합니다."

# ER_RECORD_FILE_FULL
source: "The table '%-.192s' is full"
kor: "테이블 '%-.192s'가 full났습니다. "

# ER_UNKNOWN_CHARACTER_SET 42000
source: "Unknown character set: '%-.64s'"
kor: "알수없는 언어 Set: '%-.64s'"

# ER_TOO_MANY_TABLES
source: "Too many tables; MariaDB can only use %d tables in a join"
kor: "너무 많은 테이블이 Join되었습니다. MariaDB에서는 JOIN시 %d개의 테이블만 사용할 수 있습니다."

# ER_TOO_MANY_FIELDS
source: "Too many columns"
kor: "칼럼이 너무 많습니다."

# ER_TOO_BIG_ROWSIZE 42000
source: "Row size too large. The maximum row size for the used table type, not counting BLOBs, is %ld. This includes storage overhead, check the manual. You have to change some columns to TEXT or BLOBs"
kor: "너무 큰 row 사이즈입니다. BLOB를 계산하지 않고 최대 row 사이즈는 %ld입니다. 일부열을 BLOB 또는 TEXT로 변경해야 합니다."

# ER_STACK_OVERRUN
source: "Thread stack overrun: Used: %ld of a %ld stack. Use 'mariadbd --thread_stack=#' to specify a bigger stack if needed"
kor: "쓰레드 스택이 넘쳤습니다. 사용: %ld개 스택: %ld개. 만약 필요시 더큰 스택을 원할때에는 'mariadbd --thread_stack=#' 를 정의하세요"

# ER_CANT_FIND_UDF
source: "Can't load function '%-.192s'"
kor: "'%-.192s' 함수를 로드하지 못했습니다."

# ER_CANT_INITIALIZE_UDF
source: "Can't initialize function '%-.192s'; %-.80s"
kor: "'%-.192s' 함수를 초기화 하지 못했습니다.; %-.80s"

# ER_UDF_NO_PATHS
source: "No paths allowed for shared library"
kor: "공유 라이버러리를 위한 패스가 정의되어 있지 않습니다."

# ER_UDF_EXISTS
source: "Function '%-.192s' already exists"
kor: "'%-.192s' 함수는 이미 존재합니다."

# ER_CANT_OPEN_LIBRARY
source: "Can't open shared library '%-.192s' (errno: %d, %-.128s)"
kor: "'%-.192s' 공유 라이버러리를 열수 없습니다.(에러번호: %d, %-.128s)"

# ER_CANT_FIND_DL_ENTRY
source: "Can't find symbol '%-.128s' in library"
kor: "라이버러리에서 '%-.128s' 함수를 찾을 수 없습니다."

# ER_FUNCTION_NOT_DEFINED
source: "Function '%-.192s' is not defined"
kor: "'%-.192s' 함수가 정의되어 있지 않습니다."

# ER_HOST_IS_BLOCKED
source: "Host '%-.64s' is blocked because of many connection errors; unblock with 'mariadb-admin flush-hosts'"
kor: "너무 많은 연결오류로 인하여 호스트 '%-.64s'는 블락되었습니다. 'mariadb-admin flush-hosts'를 이용하여 블락을 해제하세요"

# ER_HOST_NOT_PRIVILEGED
source: "Host '%-.64s' is not allowed to connect to this MariaDB server"
kor: "'%-.64s' 호스트는 이 MariaDB서버에 접속할 허가를 받지 못했습니다."

# ER_PASSWORD_ANONYMOUS_USER 42000
source: "You are using MariaDB as an anonymous user and anonymous users are not allowed to modify user settings"
kor: "당신은 MariaDB서버에 익명의 사용자로 접속을 하셨습니다.익명의 사용자는 암호를 변경할 수 없습니다."

# ER_PASSWORD_NOT_ALLOWED 42000
source: "You must have privileges to update tables in the mysql database to be able to change passwords for others"
kor: "당신은 다른사용자들의 암호를 변경할 수 있도록 데이타베이스 변경권한을 가져야 합니다."

# ER_PASSWORD_NO_MATCH 28000
source: "Can't find any matching row in the user table"
kor: "사용자 테이블에서 일치하는 것을 찾을 수 없습니다."

# ER_UPDATE_INFO
source: "Rows matched: %ld Changed: %ld Warnings: %ld"
kor: "일치하는 Rows : %ld개 변경됨: %ld개 경고: %ld개"

# ER_CANT_CREATE_THREAD
source: "Can't create a new thread (errno %M); if you are not out of available memory, you can consult the manual for a possible OS-dependent bug"
kor: "새로운 쓰레드를 만들 수 없습니다.(에러번호 %M). 만약 여유메모리가 있다면 OS-dependent버그 의 메뉴얼 부분을 찾아보시오."

# ER_WRONG_VALUE_COUNT_ON_ROW 21S01
source: "Column count doesn't match value count at row %lu"
kor: "Row %lu에서 칼럼 카운트와 value 카운터와 일치하지 않습니다."

# ER_CANT_REOPEN_TABLE
source: "Can't reopen table: '%-.192s'"
kor: "테이블을 다시 열수 없군요: '%-.192s"

# ER_INVALID_USE_OF_NULL 22004
source: "Invalid use of NULL value"
kor: "NULL 값을 잘못 사용하셨군요..."

# ER_REGEXP_ERROR 42000
source: "Regex error '%s'"
kor: "regexp에서 '%s'가 났습니다."

# ER_MIX_OF_GROUP_FUNC_AND_FIELDS 42000
source: "Mixing of GROUP columns (MIN(),MAX(),COUNT(),...) with no GROUP columns is illegal if there is no GROUP BY clause"
kor: "GROUP BY 절 없이 혼합된 GROUP 함수 (MIN(),MAX(),COUNT(),...) 를 사용할 수 없습니다."

# ER_NONEXISTING_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s'"
kor: "사용자 '%-.48s' (호스트 '%-.64s')를 위하여 정의된 그런 승인은 없습니다."

# ER_TABLEACCESS_DENIED_ERROR 42000
source: "%-.100T command denied to user '%s'@'%s' for table '%-.192s'"
kor: "'%-.100T' 명령은 다음 사용자에게 거부되었습니다. : '%s'@'%s' for 테이블 '%-.192s'"

# ER_COLUMNACCESS_DENIED_ERROR 42000
source: "%-.32s command denied to user '%s'@'%s' for column '%-.192s' in table '%-.192s'"
kor: "'%-.32s' 명령은 다음 사용자에게 거부되었습니다. : '%s'@'%s' for 칼럼 '%-.192s' in 테이블 '%-.192s'"

# ER_ILLEGAL_GRANT_FOR_TABLE 42000
source: "Illegal GRANT/REVOKE command; please consult the manual to see which privileges can be used"
kor: "잘못된 GRANT/REVOKE 명령. 어떤 권리와 승인이 사용되어 질 수 있는지 메뉴얼을 보시오."

# ER_GRANT_WRONG_HOST_OR_USER 42000
source: "The host or user argument to GRANT is too long"
kor: "승인(GRANT)을 위하여 사용한 사용자나 호스트의 값들이 너무 깁니다."

# ER_NO_SUCH_TABLE 42S02
source: "Table '%-.192s.%-.192s' doesn't exist"
kor: "테이블 '%-.192s.%-.192s' 는 존재하지 않습니다."

# ER_NONEXISTING_TABLE_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s' on table '%-.192s'"
kor: "사용자 '%-.48s'(호스트 '%-.64s')는 테이블 '%-.192s'를 사용하기 위하여 정의된 승인은 없습니다. "

# ER_NOT_ALLOWED_COMMAND 42000
source: "The used command is not allowed with this MariaDB version"
kor: "사용된 명령은 현재의 MariaDB 버젼에서는 이용되지 않습니다."

# ER_SYNTAX_ERROR 42000
source: "You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use"
kor: "SQL 구문에 오류가 있습니다."

# ER_DELAYED_CANT_CHANGE_LOCK
source: "Delayed insert thread couldn't get requested lock for table %-.192s"
kor: "지연된 insert 쓰레드가 테이블 %-.192s의 요구된 락킹을 처리할 수 없었습니다."

# ER_TOO_MANY_DELAYED_THREADS
source: "Too many delayed threads in use"
kor: "너무 많은 지연 쓰레드를 사용하고 있습니다."

# ER_ABORTING_CONNECTION 08S01
source: "Aborted connection %ld to db: '%-.192s' user: '%-.48s' (%-.64s)"
kor: "데이타베이스 접속을 위한 연결 %ld가 중단됨 : '%-.192s' 사용자: '%-.48s' (%-.64s)"

# ER_NET_PACKET_TOO_LARGE 08S01
source: "Got a packet bigger than 'max_allowed_packet' bytes"
kor: "'max_allowed_packet'보다 더큰 패킷을 받았습니다."

# ER_NET_READ_ERROR_FROM_PIPE 08S01
source: "Got a read error from the connection pipe"
kor: "연결 파이프로부터 에러가 발생하였습니다."

# ER_NET_FCNTL_ERROR 08S01
source: "Got an error from fcntl()"
kor: "fcntl() 함수로부터 에러가 발생하였습니다."

# ER_NET_PACKETS_OUT_OF_ORDER 08S01
source: "Got packets out of order"
kor: "순서가 맞지않는 패킷을 받았습니다."

# ER_NET_UNCOMPRESS_ERROR 08S01
source: "Couldn't uncompress communication packet"
kor: "통신 패킷의 압축해제를 할 수 없었습니다."

# ER_NET_READ_ERROR 08S01
source: "Got an error reading communication packets"
kor: "통신 패킷을 읽는 중 오류가 발생하였습니다."

# ER_NET_READ_INTERRUPTED 08S01
source: "Got timeout reading communication packets"
kor: "통신 패킷을 읽는 중 timeout이 발생하였습니다."

# ER_NET_ERROR_ON_WRITE 08S01
source: "Got an error writing communication packets"
kor: "통신 패킷을 기록하는 중 오류가 발생하였습니다."

# ER_NET_WRITE_INTERRUPTED 08S01
source: "Got timeout writing communication packets"
kor: "통신 패팃을 기록하는 중 timeout이 발생하였습니다."

# ER_TOO_LONG_STRING 42000
source: "Result string is longer than 'max_allowed_packet' bytes"
kor: "결과 문자열이 설정된 max_allowed_packet 값보다 큽니다."

# ER_TABLE_CANT_HANDLE_BLOB 42000
source: "Storage engine %s doesn't support BLOB/TEXT columns"
kor: "스토리지 엔진 (%s)는 BLOB/TEXT 컬럼을 지원하지 않습니다."

# ER_TABLE_CANT_HANDLE_AUTO_INCREMENT 42000
source: "Storage engine %s doesn't support AUTO_INCREMENT columns"
kor: "스토리지 엔진 (%s)는 AUTO_INCREMENT를 지원하지 않습니다."

# ER_WRONG_MRG_TABLE
source: "Unable to open underlying table which is differently defined or of non-MyISAM type or doesn't exist"
kor: "All tables in the MERGE table are not defined identically"

# ER_BLOB_KEY_WITHOUT_LENGTH 42000
source: "BLOB/TEXT column '%-.192s' used in key specification without a key length"
kor: "BLOB column '%-.192s' used in key specification without a key length"

# ER_CHECK_NOT_IMPLEMENTED 42000
source: "The storage engine for the table doesn't support %s"
kor: "The handler for the table doesn't support %s"

# ER_DUP_ENTRY_WITH_KEY_NAME 23000 S1009
source: "Duplicate entry '%-.64T' for key '%-.192s'"
kor: "중복된 입력 값 '%-.64T': key '%-.192s'"

# ER_ACCESS_DENIED_NO_PASSWORD_ERROR 28000
source: "Access denied for user '%s'@'%s'"
kor: "'%s'@'%s' 사용자는 접근이 거부 되었습니다."

# ER_DUP_UNKNOWN_IN_INDEX 23000
source: "Duplicate entry for key '%-.192s'"
kor: "중복된 입력 값: key '%-.192s'"
