Repository: vladbogo/test-translation
Catalog: nla.xlf
Languages: nla

# ER_WRONG_MRG_TABLE
source: "Unable to open underlying table which is differently defined or of non-MyISAM type or doesn't exist"
nla: "Niet alle tabellen in de MERGE tabel hebben identieke gedefinities"

# ER_DUP_UNIQUE 23000
source: "Can't write, because of unique constraint, to table '%-.192s'"
nla: "Kan niet opslaan naar table '%-.192s' vanwege 'unique' beperking"

# ER_BLOB_KEY_WITHOUT_LENGTH 42000
source: "BLOB/TEXT column '%-.192s' used in key specification without a key length"
nla: "BLOB kolom '%-.192s' gebruikt in zoeksleutel specificatie zonder zoeksleutel lengte"

# ER_PRIMARY_CANT_HAVE_NULL 42000
source: "All parts of a PRIMARY KEY must be NOT NULL; if you need NULL in a key, use UNIQUE instead"
nla: "Alle delen van een PRIMARY KEY moeten NOT NULL zijn; Indien u NULL in een zoeksleutel nodig heeft kunt u UNIQUE gebruiken"

# ER_TOO_MANY_ROWS 42000
source: "Result consisted of more than one row"
nla: "Resultaat bevatte meer dan een rij"

# ER_REQUIRES_PRIMARY_KEY 42000
source: "This table type requires a primary key"
nla: "Dit tabel type heeft een primaire zoeksleutel nodig"

# ER_NO_RAID_COMPILED
source: "This version of MariaDB is not compiled with RAID support"
nla: "Deze versie van MariaDB is niet gecompileerd met RAID ondersteuning"

# ER_UPDATE_WITHOUT_KEY_IN_SAFE_MODE
source: "You are using safe update mode and you tried to update a table without a WHERE that uses a KEY column"
nla: "U gebruikt 'safe update mode' en u probeerde een tabel te updaten zonder een WHERE met een KEY kolom"

# ER_KEY_DOES_NOT_EXISTS 42000 S1009
source: "Key '%-.192s' doesn't exist in table '%-.192s'"
nla: "Zoeksleutel '%-.192s' bestaat niet in tabel '%-.192s'"

# ER_CHECK_NO_SUCH_TABLE 42000
source: "Can't open table"
nla: "Kan tabel niet openen"

# ER_CHECK_NOT_IMPLEMENTED 42000
source: "The storage engine for the table doesn't support %s"
nla: "De 'handler' voor de tabel ondersteund geen %s"

# ER_CANT_DO_THIS_DURING_AN_TRANSACTION 25000
source: "You are not allowed to execute this command in a transaction"
nla: "Het is u niet toegestaan dit commando uit te voeren binnen een transactie"

# ER_ERROR_DURING_COMMIT
source: "Got error %M during COMMIT"
nla: "Kreeg fout %M tijdens COMMIT"

# ER_ERROR_DURING_ROLLBACK
source: "Got error %M during ROLLBACK"
nla: "Kreeg fout %M tijdens ROLLBACK"

# ER_ERROR_DURING_FLUSH_LOGS
source: "Got error %M during FLUSH_LOGS"
nla: "Kreeg fout %M tijdens FLUSH_LOGS"

# ER_ERROR_DURING_CHECKPOINT
source: "Got error %M during CHECKPOINT"
nla: "Kreeg fout %M tijdens CHECKPOINT"

# ER_NEW_ABORTING_CONNECTION 08S01
source: "Aborted connection %lld to db: '%-.192s' user: '%-.48s' host: '%-.64s' (%-.64s)"
nla: "Afgebroken verbinding %lld naar db: '%-.192s' gebruiker: '%-.48s' host: '%-.64s' (%-.64s)"

# ER_INDEX_REBUILD
source: "Failed rebuilding the index of dumped table '%-.192s'"
nla: "Gefaald tijdens heropbouw index van gedumpte tabel '%-.192s'"

# ER_MASTER
source: "Error from master: '%-.64s'"
nla: "Fout van master: '%-.64s'"

# ER_MASTER_NET_READ 08S01
source: "Net error reading from master"
nla: "Net fout tijdens lezen van master"

# ER_MASTER_NET_WRITE 08S01
source: "Net error writing to master"
nla: "Net fout tijdens schrijven naar master"

# ER_FT_MATCHING_KEY_NOT_FOUND
source: "Can't find FULLTEXT index matching the column list"
nla: "Kan geen FULLTEXT index vinden passend bij de kolom lijst"

# ER_LOCK_OR_ACTIVE_TRANSACTION
source: "Can't execute the given command because you have active locked tables or an active transaction"
nla: "Kan het gegeven commando niet uitvoeren, want u heeft actieve gelockte tabellen of een actieve transactie"

# ER_UNKNOWN_SYSTEM_VARIABLE
source: "Unknown system variable '%-.*s'"
nla: "Onbekende systeem variabele '%-.*s'"

# ER_CRASHED_ON_USAGE
source: "Table '%-.192s' is marked as crashed and should be repaired"
nla: "Tabel '%-.192s' staat als gecrashed gemarkeerd en dient te worden gerepareerd"

# ER_CRASHED_ON_REPAIR
source: "Table '%-.192s' is marked as crashed and last (automatic?) repair failed"
nla: "Tabel '%-.192s' staat als gecrashed gemarkeerd en de laatste (automatische?) reparatie poging mislukte"

# ER_WARNING_NOT_COMPLETE_ROLLBACK
source: "Some non-transactional changed tables couldn't be rolled back"
nla: "Waarschuwing: Roll back mislukt voor sommige buiten transacties gewijzigde tabellen"

# ER_TRANS_CACHE_FULL
source: "Multi-statement transaction required more than 'max_binlog_cache_size' bytes of storage; increase this mariadbd variable and try again"
nla: "Multi-statement transactie vereist meer dan 'max_binlog_cache_size' bytes opslag. Verhoog deze mariadbd variabele en probeer opnieuw"

# ER_SLAVE_MUST_STOP
source: "This operation cannot be performed as you have a running slave '%2$*1$s'; run STOP SLAVE '%2$*1$s' first"
nla: "Deze operatie kan niet worden uitgevoerd met een actieve slave '%2$*1$s', doe eerst STOP SLAVE '%2$*1$s'"

# ER_SLAVE_NOT_RUNNING
source: "This operation requires a running slave; configure slave and do START SLAVE"
nla: "Deze operatie vereist een actieve slave, configureer slave en doe dan START SLAVE"

# ER_BAD_SLAVE
source: "The server is not configured as slave; fix in config file or with CHANGE MASTER TO"
nla: "De server is niet geconfigureerd als slave, fix in configuratie bestand of met CHANGE MASTER TO"

# ER_SLAVE_THREAD
source: "Could not create slave thread; check system resources"
nla: "Kon slave thread niet aanmaken, controleer systeem resources"

# ER_TOO_MANY_USER_CONNECTIONS 42000
source: "User %-.64s already has more than 'max_user_connections' active connections"
nla: "Gebruiker %-.64s heeft reeds meer dan 'max_user_connections' actieve verbindingen"

# ER_SET_CONSTANTS_ONLY
source: "You may only use constant expressions in this statement"
nla: "U mag alleen constante expressies gebruiken bij SET"

# ER_LOCK_WAIT_TIMEOUT
source: "Lock wait timeout exceeded; try restarting transaction"
nla: "Lock wacht tijd overschreden"

# ER_LOCK_TABLE_FULL
source: "The total number of locks exceeds the lock table size"
nla: "Het totale aantal locks overschrijdt de lock tabel grootte"

# ER_READ_ONLY_TRANSACTION 25000
source: "Update locks cannot be acquired during a READ UNCOMMITTED transaction"
nla: "Update locks kunnen niet worden verkregen tijdens een READ UNCOMMITTED transactie"

# ER_DROP_DB_WITH_READ_LOCK
source: "DROP DATABASE not allowed while thread is holding global read lock"
nla: "DROP DATABASE niet toegestaan terwijl thread een globale 'read lock' bezit"

# ER_CREATE_DB_WITH_READ_LOCK
source: "CREATE DATABASE not allowed while thread is holding global read lock"
nla: "CREATE DATABASE niet toegestaan terwijl thread een globale 'read lock' bezit"

# ER_WRONG_ARGUMENTS
source: "Incorrect arguments to %s"
nla: "Foutieve parameters voor %s"

# ER_NO_PERMISSION_TO_CREATE_USER 42000
source: "'%s'@'%s' is not allowed to create new users"
nla: "'%s'@'%s' mag geen nieuwe gebruikers creeren"

# ER_UNION_TABLES_IN_DIFFERENT_DIR
source: "Incorrect table definition; all MERGE tables must be in the same database"
nla: "Incorrecte tabel definitie; alle MERGE tabellen moeten tot dezelfde database behoren"

# ER_LOCK_DEADLOCK 40001
source: "Deadlock found when trying to get lock; try restarting transaction"
nla: "Deadlock gevonden tijdens lock-aanvraag poging; Probeer herstart van de transactie"

# ER_TABLE_CANT_HANDLE_FT
source: "The storage engine %s doesn't support FULLTEXT indexes"
nla: "Het gebruikte tabel type (%s) ondersteund geen FULLTEXT indexen"

# ER_CANNOT_ADD_FOREIGN
source: "Cannot add foreign key constraint for `%s`"
nla: "Kan foreign key beperking niet toevoegen vor `%s`"

# ER_NO_REFERENCED_ROW 23000
source: "Cannot add or update a child row: a foreign key constraint fails"
nla: "Kan onderliggende rij niet toevoegen: foreign key beperking gefaald"

# ER_CONNECT_TO_MASTER 08S01
source: "Error connecting to master: %-.128s"
nla: "Fout bij opbouwen verbinding naar master: %-.128s"

# ER_QUERY_ON_MASTER
source: "Error running query on master: %-.128s"
nla: "Fout bij uitvoeren query op master: %-.128s"

# ER_ERROR_WHEN_EXECUTING_COMMAND
source: "Error when executing command %s: %-.128s"
nla: "Fout tijdens uitvoeren van commando %s: %-.128s"

# ER_WRONG_USAGE
source: "Incorrect usage of %s and %s"
nla: "Foutief gebruik van %s en %s"

# ER_WRONG_NUMBER_OF_COLUMNS_IN_SELECT 21000
source: "The used SELECT statements have a different number of columns"
nla: "De gebruikte SELECT commando's hebben een verschillend aantal kolommen"

# ER_CANT_UPDATE_WITH_READLOCK
source: "Can't execute the query because you have a conflicting read lock"
nla: "Kan de query niet uitvoeren vanwege een conflicterende read lock"

# ER_MIXING_NOT_ALLOWED
source: "Mixing of transactional and non-transactional tables is disabled"
nla: "Het combineren van transactionele en niet-transactionele tabellen is uitgeschakeld"

# ER_DUP_ARGUMENT
source: "Option '%s' used twice in statement"
nla: "Optie '%s' tweemaal gebruikt in opdracht"

# ER_USER_LIMIT_REACHED 42000
source: "User '%-.64s' has exceeded the '%s' resource (current value: %ld)"
nla: "Gebruiker '%-.64s' heeft het maximale gebruik van de '%s' faciliteit overschreden (huidige waarde: %ld)"

# ER_SPECIFIC_ACCESS_DENIED_ERROR 42000
source: "Access denied; you need (at least one of) the %-.128s privilege(s) for this operation"
nla: "Toegang geweigerd. U moet het %-.128s privilege hebben voor deze operatie"

# ER_LOCAL_VARIABLE
source: "Variable '%-.64s' is a SESSION variable and can't be used with SET GLOBAL"
nla: "Variabele '%-.64s' is SESSION en kan niet worden gebruikt met SET GLOBAL"

# ER_GLOBAL_VARIABLE
source: "Variable '%-.64s' is a GLOBAL variable and should be set with SET GLOBAL"
nla: "Variabele '%-.64s' is GLOBAL en dient te worden gewijzigd met SET GLOBAL"

# ER_NO_DEFAULT 42000
source: "Variable '%-.64s' doesn't have a default value"
nla: "Variabele '%-.64s' heeft geen standaard waarde"

# ER_WRONG_VALUE_FOR_VAR 42000
source: "Variable '%-.64s' can't be set to the value of '%-.200T'"
nla: "Variabele '%-.64s' kan niet worden gewijzigd naar de waarde '%-.200T'"

# ER_WRONG_TYPE_FOR_VAR 42000
source: "Incorrect argument type to variable '%-.64s'"
nla: "Foutief argumenttype voor variabele '%-.64s'"

# ER_VAR_CANT_BE_READ
source: "Variable '%-.64s' can only be set, not read"
nla: "Variabele '%-.64s' kan alleen worden gewijzigd, niet gelezen"

# ER_CANT_USE_OPTION_HERE 42000
source: "Incorrect usage/placement of '%s'"
nla: "Foutieve toepassing/plaatsing van '%s'"

# ER_NOT_SUPPORTED_YET 42000
source: "This version of MariaDB doesn't yet support '%s'"
nla: "Deze versie van MariaDB ondersteunt nog geen '%s'"

# ER_MASTER_FATAL_ERROR_READING_BINLOG
source: "Got fatal error %d from master when reading data from binary log: '%-.320s'"
nla: "Kreeg fatale fout %d: '%-.320s' van master tijdens lezen van data uit binaire log"

# ER_SLAVE_IGNORED_TABLE
source: "Slave SQL thread ignored the query because of replicate-*-table rules"
nla: "Slave SQL thread negeerde de query vanwege replicate-*-table opties"

# ER_INCORRECT_GLOBAL_LOCAL_VAR
source: "Variable '%-.192s' is a %s variable"
nla: "Variabele '%-.192s' is geen %s variabele"

# ER_WRONG_FK_DEF 42000
source: "Incorrect foreign key definition for '%-.192s': %s"
nla: "Incorrecte foreign key definitie voor '%-.192s': %s"

# ER_KEY_REF_DO_NOT_MATCH_TABLE_REF
source: "Key reference and table reference don't match"
nla: "Sleutel- en tabelreferentie komen niet overeen"

# ER_OPERAND_COLUMNS 21000
source: "Operand should contain %d column(s)"
nla: "Operand behoort %d kolommen te bevatten"

# ER_SUBQUERY_NO_1_ROW 21000
source: "Subquery returns more than 1 row"
nla: "Subquery retourneert meer dan 1 rij"

# ER_UNKNOWN_STMT_HANDLER
source: "Unknown prepared statement handler (%.*s) given to %s"
nla: "Onebekende prepared statement handler (%.*s) voor %s aangegeven"

# ER_CORRUPT_HELP_DB
source: "Help database is corrupt or does not exist"
nla: "Help database is beschadigd of bestaat niet"

# ER_CYCLIC_REFERENCE
source: "Cyclic reference on subqueries"
nla: "Cyclische verwijzing in subqueries"

# ER_AUTO_CONVERT
source: "Converting column '%s' from %s to %s"
nla: "Veld '%s' wordt van %s naar %s geconverteerd"

# ER_ILLEGAL_REFERENCE 42S22
source: "Reference '%-.64s' not supported (%s)"
nla: "Verwijzing '%-.64s' niet ondersteund (%s)"

# ER_DERIVED_MUST_HAVE_ALIAS 42000
source: "Every derived table must have its own alias"
nla: "Voor elke afgeleide tabel moet een unieke alias worden gebruikt"

# ER_SELECT_REDUCED 01000
source: "Select %u was reduced during optimization"
nla: "Select %u werd geredureerd tijdens optimtalisatie"

# ER_TABLENAME_NOT_ALLOWED_HERE 42000
source: "Table '%-.192s' from one of the SELECTs cannot be used in %-.32s"
nla: "Tabel '%-.192s' uit een van de SELECTS kan niet in %-.32s gebruikt worden"

# ER_NOT_SUPPORTED_AUTH_MODE 08004
source: "Client does not support authentication protocol requested by server; consider upgrading MariaDB client"
nla: "Client ondersteunt het door de server verwachtte authenticatieprotocol niet. Overweeg een nieuwere MariaDB client te gebruiken"

# ER_SPATIAL_CANT_HAVE_NULL 42000
source: "All parts of a SPATIAL index must be NOT NULL"
nla: "Alle delete van een SPATIAL index dienen als NOT NULL gedeclareerd te worden"

# ER_COLLATION_CHARSET_MISMATCH 42000
source: "COLLATION '%s' is not valid for CHARACTER SET '%s'"
nla: "COLLATION '%s' is niet geldig voor CHARACTER SET '%s'"

# ER_SLAVE_WAS_RUNNING
source: "Slave is already running"
nla: "Slave is reeds actief"

# ER_SLAVE_WAS_NOT_RUNNING
source: "Slave already has been stopped"
nla: "Slave is reeds gestopt"

# ER_TOO_BIG_FOR_UNCOMPRESS
source: "Uncompressed data size too large; the maximum size is %d (probably, length of uncompressed data was corrupted)"
nla: "Ongecomprimeerder data is te groot; de maximum lengte is %d (waarschijnlijk, de lengte van de gecomprimeerde data was beschadigd)"

# ER_ZLIB_Z_MEM_ERROR
source: "ZLIB: Not enough memory"
nla: "ZLIB: Onvoldoende geheugen"

# ER_ZLIB_Z_BUF_ERROR
source: "ZLIB: Not enough room in the output buffer (probably, length of uncompressed data was corrupted)"
nla: "ZLIB: Onvoldoende ruimte in uitgaande buffer (waarschijnlijk, de lengte van de ongecomprimeerde data was beschadigd)"

# ER_ZLIB_Z_DATA_ERROR
source: "ZLIB: Input data corrupted"
nla: "ZLIB: Invoer data beschadigd"

# ER_WARN_TOO_FEW_RECORDS 01000
source: "Row %lu doesn't contain data for all columns"
nla: "Rij %lu bevat niet de data voor alle kolommen"

# ER_WARN_TOO_MANY_RECORDS 01000
source: "Row %lu was truncated; it contained more data than there were input columns"
nla: "Regel %lu ingekort, bevatte meer data dan invoer kolommen"

# ER_DUP_ENTRY_WITH_KEY_NAME 23000 S1009
source: "Duplicate entry '%-.64T' for key '%-.192s'"
nla: "Dubbele ingang '%-.64T' voor zoeksleutel '%-.192s'"

# ER_ACCESS_DENIED_NO_PASSWORD_ERROR 28000
source: "Access denied for user '%s'@'%s'"
nla: "Toegang geweigerd voor gebruiker: '%s'@'%s'"

# ER_DUP_UNKNOWN_IN_INDEX 23000
source: "Duplicate entry for key '%-.192s'"
nla: "Dubbele ingang voor zoeksleutel '%-.192s'"

# ER_SLAVE_IGNORED_SHARED_TABLE
source: "Slave SQL thread ignored the '%s' because table is shared"
nla: "Slave SQL thread negeerde de query '%s'"
