Repository: vladbogo/test-translation
Catalog: nla.xlf
Languages: nla

# ER_NO
source: "NO"
nla: "NEE"

# ER_YES
source: "YES"
nla: "JA"

# ER_CANT_CREATE_FILE
source: "Can't create file '%-.200s' (errno: %M)"
nla: "Kan file '%-.200s' niet aanmaken (Errcode: %M)"

# ER_CANT_CREATE_TABLE
source: "Can't create table %`s.%`s (errno: %M)"
nla: "Kan tabel %`s.%`s niet aanmaken (Errcode: %M)"

# ER_CANT_CREATE_DB
source: "Can't create database '%-.192s' (errno: %M)"
nla: "Kan database '%-.192s' niet aanmaken (Errcode: %M)"

# ER_DB_CREATE_EXISTS
source: "Can't create database '%-.192s'; database exists"
nla: "Kan database '%-.192s' niet aanmaken; database bestaat reeds"

# ER_DB_DROP_EXISTS
source: "Can't drop database '%-.192s'; database doesn't exist"
nla: "Kan database '%-.192s' niet verwijderen; database bestaat niet"

# ER_DB_DROP_DELETE
source: "Error dropping database (can't delete '%-.192s', errno: %M)"
nla: "Fout bij verwijderen database (kan '%-.192s' niet verwijderen, Errcode: %M)"

# ER_DB_DROP_RMDIR
source: "Error dropping database (can't rmdir '%-.192s', errno: %M)"
nla: "Fout bij verwijderen database (kan rmdir '%-.192s' niet uitvoeren, Errcode: %M)"

# ER_CANT_DELETE_FILE
source: "Error on delete of '%-.192s' (errno: %M)"
nla: "Fout bij het verwijderen van '%-.192s' (Errcode: %M)"

# ER_CANT_FIND_SYSTEM_REC
source: "Can't read record in system table"
nla: "Kan record niet lezen in de systeem tabel"

# ER_CANT_GET_STAT
source: "Can't get status of '%-.200s' (errno: %M)"
nla: "Kan de status niet krijgen van '%-.200s' (Errcode: %M)"

# ER_CANT_GET_WD
source: "Can't get working directory (errno: %M)"
nla: "Kan de werkdirectory niet krijgen (Errcode: %M)"

# ER_CANT_LOCK
source: "Can't lock file (errno: %M)"
nla: "Kan de file niet blokeren (Errcode: %M)"

# ER_CANT_OPEN_FILE
source: "Can't open file: '%-.200s' (errno: %M)"
nla: "Kan de file '%-.200s' niet openen (Errcode: %M)"

# ER_FILE_NOT_FOUND
source: "Can't find file: '%-.200s' (errno: %M)"
nla: "Kan de file: '%-.200s' niet vinden (Errcode: %M)"

# ER_CANT_READ_DIR
source: "Can't read dir of '%-.192s' (errno: %M)"
nla: "Kan de directory niet lezen van '%-.192s' (Errcode: %M)"

# ER_CANT_SET_WD
source: "Can't change dir to '%-.192s' (errno: %M)"
nla: "Kan de directory niet veranderen naar '%-.192s' (Errcode: %M)"

# ER_CHECKREAD
source: "Record has changed since last read in table '%-.192s'"
nla: "Record is veranderd sinds de laatste lees activiteit in de tabel '%-.192s'"

# ER_DISK_FULL
source: "Disk full (%s); waiting for someone to free some space... (errno: %M)"
nla: "Schijf vol (%s). Aan het wachten totdat er ruimte vrij wordt gemaakt... (Errcode: %M)"

# ER_DUP_KEY 23000
source: "Can't write; duplicate key in table '%-.192s'"
nla: "Kan niet schrijven, dubbele zoeksleutel in tabel '%-.192s'"

# ER_ERROR_ON_CLOSE
source: "Error on close of '%-.192s' (errno: %M)"
nla: "Fout bij het sluiten van '%-.192s' (Errcode: %M)"

# ER_ERROR_ON_READ
source: "Error reading file '%-.200s' (errno: %M)"
nla: "Fout bij het lezen van file '%-.200s' (Errcode: %M)"

# ER_ERROR_ON_RENAME
source: "Error on rename of '%-.210s' to '%-.210s' (errno: %M)"
nla: "Fout bij het hernoemen van '%-.210s' naar '%-.210s' (Errcode: %M)"

# ER_ERROR_ON_WRITE
source: "Error writing file '%-.200s' (errno: %M)"
nla: "Fout bij het wegschrijven van file '%-.200s' (Errcode: %M)"

# ER_FILE_USED
source: "'%-.192s' is locked against change"
nla: "'%-.192s' is geblokeerd tegen veranderingen"

# ER_FILSORT_ABORT
source: "Sort aborted"
nla: "Sorteren afgebroken"

# ER_FORM_NOT_FOUND
source: "View '%-.192s' doesn't exist for '%-.192s'"
nla: "View '%-.192s' bestaat niet voor '%-.192s'"

# ER_GET_ERRNO
source: "Got error %M from storage engine %s"
nla: "Fout %M van tabel handler %s"

# ER_KEY_NOT_FOUND
source: "Can't find record in '%-.192s'"
nla: "Kan record niet vinden in '%-.192s'"

# ER_NOT_FORM_FILE
source: "Incorrect information in file: '%-.200s'"
nla: "Verkeerde info in file: '%-.200s'"

# ER_NOT_KEYFILE
source: "Index for table '%-.200s' is corrupt; try to repair it"
nla: "Verkeerde zoeksleutel file voor tabel: '%-.200s'; probeer het te repareren"

# ER_OLD_KEYFILE
source: "Old key file for table '%-.192s'; repair it!"
nla: "Oude zoeksleutel file voor tabel '%-.192s'; repareer het!"

# ER_OPEN_AS_READONLY
source: "Table '%-.192s' is read only"
nla: "'%-.192s' is alleen leesbaar"

# ER_OUTOFMEMORY HY001 S1001
source: "Out of memory; restart server and try again (needed %d bytes)"
nla: "Geen geheugen meer. Herstart server en probeer opnieuw (%d bytes nodig)"

# ER_OUT_OF_SORTMEMORY HY001 S1001
source: "Out of sort memory, consider increasing server sort buffer size"
nla: "Geen geheugen om te sorteren. Verhoog de server sort buffer size"

# ER_UNEXPECTED_EOF
source: "Unexpected EOF found when reading file '%-.192s' (errno: %M)"
nla: "Onverwachte eof gevonden tijdens het lezen van file '%-.192s' (Errcode: %M)"

# ER_CON_COUNT_ERROR 08004
source: "Too many connections"
nla: "Te veel verbindingen"

# ER_OUT_OF_RESOURCES
source: "Out of memory."
nla: "Geen thread geheugen meer; controleer of mariadbd of andere processen al het beschikbare geheugen gebruikt. Zo niet, dan moet u wellicht 'ulimit' gebruiken om mariadbd toe te laten meer geheugen te benutten, of u kunt extra swap ruimte toevoegen"

# ER_BAD_HOST_ERROR 08S01
source: "Can't get hostname for your address"
nla: "Kan de hostname niet krijgen van uw adres"

# ER_HANDSHAKE_ERROR 08S01
source: "Bad handshake"
nla: "Verkeerde handshake"

# ER_DBACCESS_DENIED_ERROR 42000
source: "Access denied for user '%s'@'%s' to database '%-.192s'"
nla: "Toegang geweigerd voor gebruiker: '%s'@'%s' naar database '%-.192s'"

# ER_ACCESS_DENIED_ERROR 28000
source: "Access denied for user '%s'@'%s' (using password: %s)"
nla: "Toegang geweigerd voor gebruiker: '%s'@'%s' (Wachtwoord gebruikt: %s)"

# ER_NO_DB_ERROR 3D000
source: "No database selected"
nla: "Geen database geselecteerd"

# ER_UNKNOWN_COM_ERROR 08S01
source: "Unknown command"
nla: "Onbekend commando"

# ER_BAD_NULL_ERROR 23000
source: "Column '%-.192s' cannot be null"
nla: "Kolom '%-.192s' kan niet null zijn"

# ER_BAD_DB_ERROR 42000
source: "Unknown database '%-.192s'"
nla: "Onbekende database '%-.192s'"

# ER_TABLE_EXISTS_ERROR 42S01
source: "Table '%-.192s' already exists"
nla: "Tabel '%-.192s' bestaat al"

# ER_BAD_TABLE_ERROR 42S02
source: "Unknown table '%-.100T'"
nla: "Onbekende tabel '%-.100T'"

# ER_NON_UNIQ_ERROR 23000
source: "Column '%-.192s' in %-.192s is ambiguous"
nla: "Kolom: '%-.192s' in %-.192s is niet eenduidig"

# ER_SERVER_SHUTDOWN 08S01
source: "Server shutdown in progress"
nla: "Bezig met het stoppen van de server"

# ER_BAD_FIELD_ERROR 42S22 S0022
source: "Unknown column '%-.192s' in '%-.192s'"
nla: "Onbekende kolom '%-.192s' in %-.192s"

# ER_WRONG_FIELD_WITH_GROUP 42000 S1009
source: "'%-.192s' isn't in GROUP BY"
nla: "Opdracht gebruikt '%-.192s' dat niet in de GROUP BY voorkomt"

# ER_WRONG_GROUP_FIELD 42000 S1009
source: "Can't group on '%-.192s'"
nla: "Kan '%-.192s' niet groeperen"

# ER_WRONG_SUM_SELECT 42000 S1009
source: "Statement has sum functions and columns in same statement"
nla: "Opdracht heeft totaliseer functies en kolommen in dezelfde opdracht"

# ER_WRONG_VALUE_COUNT 21S01
source: "Column count doesn't match value count"
nla: "Het aantal kolommen komt niet overeen met het aantal opgegeven waardes"

# ER_TOO_LONG_IDENT 42000 S1009
source: "Identifier name '%-.100T' is too long"
nla: "Naam voor herkenning '%-.100T' is te lang"

# ER_DUP_FIELDNAME 42S21 S1009
source: "Duplicate column name '%-.192s'"
nla: "Dubbele kolom naam '%-.192s'"

# ER_DUP_KEYNAME 42000 S1009
source: "Duplicate key name '%-.192s'"
nla: "Dubbele zoeksleutel naam '%-.192s'"

# ER_DUP_ENTRY 23000 S1009
source: "Duplicate entry '%-.192T' for key %d"
nla: "Dubbele ingang '%-.192T' voor zoeksleutel %d"

# ER_WRONG_FIELD_SPEC 42000 S1009
source: "Incorrect column specifier for column '%-.192s'"
nla: "Verkeerde kolom specificatie voor kolom '%-.192s'"

# ER_PARSE_ERROR 42000 s1009
source: "%s near '%-.80T' at line %d"
nla: "%s bij '%-.80T' in regel %d"

# ER_EMPTY_QUERY 42000
source: "Query was empty"
nla: "Query was leeg"

# ER_NONUNIQ_TABLE 42000 S1009
source: "Not unique table/alias: '%-.192s'"
nla: "Niet unieke waarde tabel/alias: '%-.192s'"

# ER_INVALID_DEFAULT 42000 S1009
source: "Invalid default value for '%-.192s'"
nla: "Foutieve standaard waarde voor '%-.192s'"

# ER_MULTIPLE_PRI_KEY 42000 S1009
source: "Multiple primary key defined"
nla: "Meerdere primaire zoeksleutels gedefinieerd"

# ER_TOO_MANY_KEYS 42000 S1009
source: "Too many keys specified; max %d keys allowed"
nla: "Teveel zoeksleutels gedefinieerd. Maximaal zijn %d zoeksleutels toegestaan"

# ER_TOO_MANY_KEY_PARTS 42000 S1009
source: "Too many key parts specified; max %d parts allowed"
nla: "Teveel zoeksleutel onderdelen gespecificeerd. Maximaal %d onderdelen toegestaan"

# ER_TOO_LONG_KEY 42000 S1009
source: "Specified key was too long; max key length is %d bytes"
nla: "Gespecificeerde zoeksleutel was te lang. De maximale lengte is %d"

# ER_KEY_COLUMN_DOES_NOT_EXIST 42000 S1009
source: "Key column '%-.192s' doesn't exist in table"
nla: "Zoeksleutel kolom '%-.192s' bestaat niet in tabel"

# ER_TOO_BIG_FIELDLENGTH 42000 S1009
source: "Column length too big for column '%-.192s' (max = %lu); use BLOB or TEXT instead"
nla: "Te grote kolomlengte voor '%-.192s' (max = %lu). Maak hiervoor gebruik van het type BLOB"

# ER_WRONG_AUTO_KEY 42000 S1009
source: "Incorrect table definition; there can be only one auto column and it must be defined as a key"
nla: "Er kan slechts 1 autofield zijn en deze moet als zoeksleutel worden gedefinieerd"

# ER_NORMAL_SHUTDOWN
source: "%s (initiated by: %s): Normal shutdown"
nla: "%s (%s): Normaal afgesloten "

# ER_GOT_SIGNAL
source: "%s: Got signal %d. Aborting!\n"
nla: "%s: Signaal %d. Systeem breekt af!\n"

# ER_SHUTDOWN_COMPLETE
source: "%s: Shutdown complete\n"
nla: "%s: Afsluiten afgerond\n"

# ER_FORCING_CLOSE 08S01
source: "%s: Forcing close of thread %ld user: '%-.48s'\n"
nla: "%s: Afsluiten afgedwongen van thread %ld gebruiker: '%-.48s'\n"

# ER_IPSOCK_ERROR 08S01
source: "Can't create IP socket"
nla: "Kan IP-socket niet openen"

# ER_NO_SUCH_INDEX 42S12 S1009
source: "Table '%-.192s' has no index like the one used in CREATE INDEX; recreate the table"
nla: "Tabel '%-.192s' heeft geen INDEX zoals deze gemaakt worden met CREATE INDEX. Maak de tabel opnieuw"

# ER_WRONG_FIELD_TERMINATORS 42000 S1009
source: "Field separator argument is not what is expected; check the manual"
nla: "De argumenten om velden te scheiden zijn anders dan verwacht. Raadpleeg de handleiding"

# ER_BLOBS_AND_NO_TERMINATED 42000 S1009
source: "You can't use fixed rowlength with BLOBs; please use 'fields terminated by'"
nla: "Bij het gebruik van BLOBs is het niet mogelijk om vaste rijlengte te gebruiken. Maak s.v.p. gebruik van 'fields terminated by'"

# ER_TEXTFILE_NOT_READABLE
source: "The file '%-.128s' must be in the database directory or be readable by all"
nla: "Het bestand '%-.128s' dient in de database directory voor the komen of leesbaar voor iedereen te zijn"

# ER_FILE_EXISTS_ERROR
source: "File '%-.200s' already exists"
nla: "Het bestand '%-.200s' bestaat reeds"

# ER_LOAD_INFO
source: "Records: %ld Deleted: %ld Skipped: %ld Warnings: %ld"
nla: "Records: %ld Verwijderd: %ld Overgeslagen: %ld Waarschuwingen: %ld"

# ER_ALTER_INFO
source: "Records: %ld Duplicates: %ld"
nla: "Records: %ld Dubbel: %ld"

# ER_WRONG_SUB_KEY
source: "Incorrect prefix key; the used key part isn't a string, the used length is longer than the key part, or the storage engine doesn't support unique prefix keys"
nla: "Foutief sub-gedeelte van de zoeksleutel. De gebruikte zoeksleutel is geen onderdeel van een string of of de gebruikte lengte is langer dan de zoeksleutel"

# ER_CANT_REMOVE_ALL_FIELDS 42000
source: "You can't delete all columns with ALTER TABLE; use DROP TABLE instead"
nla: "Het is niet mogelijk alle velden te verwijderen met ALTER TABLE. Gebruik a.u.b. DROP TABLE hiervoor!"

# ER_CANT_DROP_FIELD_OR_KEY 42000
source: "Can't DROP %s %`-.192s; check that it exists"
nla: "DROP %s: Kan %`-.192s niet weggooien. Controleer of het veld of de zoeksleutel daadwerkelijk bestaat"

# ER_INSERT_INFO
source: "Records: %ld Duplicates: %ld Warnings: %ld"
nla: "Records: %ld Dubbel: %ld Waarschuwing: %ld"

# ER_NO_SUCH_THREAD
source: "Unknown thread id: %lu"
nla: "Onbekend thread id: %lu"

# ER_KILL_DENIED_ERROR
source: "You are not owner of thread %lld"
nla: "U bent geen bezitter van thread %lld"

# ER_NO_TABLES_USED
source: "No tables used"
nla: "Geen tabellen gebruikt"

# ER_TOO_BIG_SET
source: "Too many strings for column %-.192s and SET"
nla: "Teveel strings voor kolom %-.192s en SET"

# ER_NO_UNIQUE_LOGFILE
source: "Can't generate a unique log-filename %-.200s.(1-999)\n"
nla: "Het is niet mogelijk een unieke naam te maken voor de logfile %-.200s.(1-999)\n"

# ER_TABLE_NOT_LOCKED_FOR_WRITE
source: "Table '%-.192s' was locked with a READ lock and can't be updated"
nla: "Tabel '%-.192s' was gelocked met een lock om te lezen. Derhalve kunnen geen wijzigingen worden opgeslagen"

# ER_TABLE_NOT_LOCKED
source: "Table '%-.192s' was not locked with LOCK TABLES"
nla: "Tabel '%-.192s' was niet gelocked met LOCK TABLES"

# ER_WRONG_DB_NAME 42000
source: "Incorrect database name '%-.100T'"
nla: "Databasenaam '%-.100T' is niet getoegestaan"

# ER_WRONG_TABLE_NAME 42000
source: "Incorrect table name '%-.100s'"
nla: "Niet toegestane tabelnaam '%-.100s'"

# ER_TOO_BIG_SELECT 42000
source: "The SELECT would examine more than MAX_JOIN_SIZE rows; check your WHERE and use SET SQL_BIG_SELECTS=1 or SET MAX_JOIN_SIZE=# if the SELECT is okay"
nla: "Het SELECT-statement zou te veel records analyseren en dus veel tijd in beslagnemen. Kijk het WHERE-gedeelte van de query na en kies SET SQL_BIG_SELECTS=1 als het stament in orde is"

# ER_UNKNOWN_ERROR
source: "Unknown error"
nla: "Onbekende Fout"

# ER_UNKNOWN_PROCEDURE 42000
source: "Unknown procedure '%-.192s'"
nla: "Onbekende procedure %-.192s"

# ER_WRONG_PARAMCOUNT_TO_PROCEDURE 42000
source: "Incorrect parameter count to procedure '%-.192s'"
nla: "Foutief aantal parameters doorgegeven aan procedure %-.192s"

# ER_WRONG_PARAMETERS_TO_PROCEDURE
source: "Incorrect parameters to procedure '%-.192s'"
nla: "Foutieve parameters voor procedure %-.192s"

# ER_UNKNOWN_TABLE 42S02
source: "Unknown table '%-.192s' in %-.32s"
nla: "Onbekende tabel '%-.192s' in %-.32s"

# ER_FIELD_SPECIFIED_TWICE 42000
source: "Column '%-.192s' specified twice"
nla: "Veld '%-.192s' is dubbel gespecificeerd"

# ER_INVALID_GROUP_FUNC_USE
source: "Invalid use of group function"
nla: "Ongeldig gebruik van GROUP-functie"

# ER_UNSUPPORTED_EXTENSION 42000
source: "Table '%-.192s' uses an extension that doesn't exist in this MariaDB version"
nla: "Tabel '%-.192s' gebruikt een extensie, die niet in deze MariaDB-versie voorkomt"

# ER_TABLE_MUST_HAVE_COLUMNS 42000
source: "A table must have at least 1 column"
nla: "Een tabel moet minstens 1 kolom bevatten"

# ER_RECORD_FILE_FULL
source: "The table '%-.192s' is full"
nla: "De tabel '%-.192s' is vol"

# ER_UNKNOWN_CHARACTER_SET 42000
source: "Unknown character set: '%-.64s'"
nla: "Onbekende character set: '%-.64s'"

# ER_TOO_MANY_TABLES
source: "Too many tables; MariaDB can only use %d tables in a join"
nla: "Teveel tabellen. MariaDB kan slechts %d tabellen in een join bevatten"

# ER_TOO_MANY_FIELDS
source: "Too many columns"
nla: "Te veel velden"

# ER_TOO_BIG_ROWSIZE 42000
source: "Row size too large. The maximum row size for the used table type, not counting BLOBs, is %ld. This includes storage overhead, check the manual. You have to change some columns to TEXT or BLOBs"
nla: "Rij-grootte is groter dan toegestaan. Maximale rij grootte, blobs niet meegeteld, is %ld. U dient sommige velden in blobs te veranderen"

# ER_STACK_OVERRUN
source: "Thread stack overrun: Used: %ld of a %ld stack. Use 'mariadbd --thread_stack=#' to specify a bigger stack if needed"
nla: "Thread stapel overrun: Gebruikte: %ld van een %ld stack. Gebruik 'mariadbd --thread_stack=#' om een grotere stapel te definieren (indien noodzakelijk)"

# ER_WRONG_OUTER_JOIN 42000
source: "Cross dependency found in OUTER JOIN; examine your ON conditions"
nla: "Gekruiste afhankelijkheid gevonden in OUTER JOIN. Controleer uw ON-conditions"

# ER_CANT_FIND_UDF
source: "Can't load function '%-.192s'"
nla: "Kan functie '%-.192s' niet laden"

# ER_CANT_INITIALIZE_UDF
source: "Can't initialize function '%-.192s'; %-.80s"
nla: "Kan functie '%-.192s' niet initialiseren; %-.80s"

# ER_UDF_NO_PATHS
source: "No paths allowed for shared library"
nla: "Geen pad toegestaan voor shared library"

# ER_UDF_EXISTS
source: "Function '%-.192s' already exists"
nla: "Functie '%-.192s' bestaat reeds"

# ER_CANT_OPEN_LIBRARY
source: "Can't open shared library '%-.192s' (errno: %d, %-.128s)"
nla: "Kan shared library '%-.192s' niet openen (Errcode: %d, %-.128s)"

# ER_CANT_FIND_DL_ENTRY
source: "Can't find symbol '%-.128s' in library"
nla: "Kan functie '%-.128s' niet in library vinden"

# ER_FUNCTION_NOT_DEFINED
source: "Function '%-.192s' is not defined"
nla: "Functie '%-.192s' is niet gedefinieerd"

# ER_HOST_IS_BLOCKED
source: "Host '%-.64s' is blocked because of many connection errors; unblock with 'mariadb-admin flush-hosts'"
nla: "Host '%-.64s' is geblokkeeerd vanwege te veel verbindings fouten. Deblokkeer met 'mariadb-admin flush-hosts'"

# ER_HOST_NOT_PRIVILEGED
source: "Host '%-.64s' is not allowed to connect to this MariaDB server"
nla: "Het is host '%-.64s' is niet toegestaan verbinding te maken met deze MariaDB server"

# ER_PASSWORD_ANONYMOUS_USER 42000
source: "You are using MariaDB as an anonymous user and anonymous users are not allowed to modify user settings"
nla: "U gebruikt MariaDB als anonieme gebruiker en deze mogen geen wachtwoorden wijzigen"

# ER_PASSWORD_NOT_ALLOWED 42000
source: "You must have privileges to update tables in the mysql database to be able to change passwords for others"
nla: "U moet tabel update priveleges hebben in de MariaDB database om wachtwoorden voor anderen te mogen wijzigen"

# ER_PASSWORD_NO_MATCH 28000
source: "Can't find any matching row in the user table"
nla: "Kan geen enkele passende rij vinden in de gebruikers tabel"

# ER_UPDATE_INFO
source: "Rows matched: %ld Changed: %ld Warnings: %ld"
nla: "Passende rijen: %ld Gewijzigd: %ld Waarschuwingen: %ld"

# ER_CANT_CREATE_THREAD
source: "Can't create a new thread (errno %M); if you are not out of available memory, you can consult the manual for a possible OS-dependent bug"
nla: "Kan geen nieuwe thread aanmaken (Errcode: %M). Indien er geen tekort aan geheugen is kunt u de handleiding consulteren over een mogelijke OS afhankelijke fout"

# ER_WRONG_VALUE_COUNT_ON_ROW 21S01
source: "Column count doesn't match value count at row %lu"
nla: "Kolom aantal komt niet overeen met waarde aantal in rij %lu"

# ER_CANT_REOPEN_TABLE
source: "Can't reopen table: '%-.192s'"
nla: "Kan tabel niet opnieuw openen: '%-.192s"

# ER_INVALID_USE_OF_NULL 22004
source: "Invalid use of NULL value"
nla: "Foutief gebruik van de NULL waarde"

# ER_REGEXP_ERROR 42000
source: "Regex error '%s'"
nla: "Fout '%s' ontvangen van regexp"

# ER_MIX_OF_GROUP_FUNC_AND_FIELDS 42000
source: "Mixing of GROUP columns (MIN(),MAX(),COUNT(),...) with no GROUP columns is illegal if there is no GROUP BY clause"
nla: "Het mixen van GROUP kolommen (MIN(),MAX(),COUNT()...) met no-GROUP kolommen is foutief indien er geen GROUP BY clausule is"

# ER_NONEXISTING_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s'"
nla: "Deze toegang (GRANT) is niet toegekend voor gebruiker '%-.48s' op host '%-.64s'"

# ER_TABLEACCESS_DENIED_ERROR 42000
source: "%-.100T command denied to user '%s'@'%s' for table '%-.192s'"
nla: "%-.100T commando geweigerd voor gebruiker: '%s'@'%s' voor tabel '%-.192s'"

# ER_COLUMNACCESS_DENIED_ERROR 42000
source: "%-.32s command denied to user '%s'@'%s' for column '%-.192s' in table '%-.192s'"
nla: "%-.32s commando geweigerd voor gebruiker: '%s'@'%s' voor kolom '%-.192s' in tabel '%-.192s'"

# ER_ILLEGAL_GRANT_FOR_TABLE 42000
source: "Illegal GRANT/REVOKE command; please consult the manual to see which privileges can be used"
nla: "Foutief GRANT/REVOKE commando. Raadpleeg de handleiding welke priveleges gebruikt kunnen worden"

# ER_GRANT_WRONG_HOST_OR_USER 42000
source: "The host or user argument to GRANT is too long"
nla: "De host of gebruiker parameter voor GRANT is te lang"

# ER_NO_SUCH_TABLE 42S02
source: "Table '%-.192s.%-.192s' doesn't exist"
nla: "Tabel '%-.192s.%-.192s' bestaat niet"

# ER_NONEXISTING_TABLE_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s' on table '%-.192s'"
nla: "Deze toegang (GRANT) is niet toegekend voor gebruiker '%-.48s' op host '%-.64s' op tabel '%-.192s'"

# ER_NOT_ALLOWED_COMMAND 42000
source: "The used command is not allowed with this MariaDB version"
nla: "Het used commando is niet toegestaan in deze MariaDB versie"

# ER_SYNTAX_ERROR 42000
source: "You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use"
nla: "Er is iets fout in de gebruikte syntax"

# ER_DELAYED_CANT_CHANGE_LOCK
source: "Delayed insert thread couldn't get requested lock for table %-.192s"
nla: "'Delayed insert' thread kon de aangevraagde 'lock' niet krijgen voor tabel %-.192s"

# ER_TOO_MANY_DELAYED_THREADS
source: "Too many delayed threads in use"
nla: "Te veel 'delayed' threads in gebruik"

# ER_ABORTING_CONNECTION 08S01
source: "Aborted connection %ld to db: '%-.192s' user: '%-.48s' (%-.64s)"
nla: "Afgebroken verbinding %ld naar db: '%-.192s' gebruiker: '%-.48s' (%-.64s)"

# ER_NET_PACKET_TOO_LARGE 08S01
source: "Got a packet bigger than 'max_allowed_packet' bytes"
nla: "Groter pakket ontvangen dan 'max_allowed_packet'"

# ER_NET_READ_ERROR_FROM_PIPE 08S01
source: "Got a read error from the connection pipe"
nla: "Kreeg leesfout van de verbindings pipe"

# ER_NET_FCNTL_ERROR 08S01
source: "Got an error from fcntl()"
nla: "Kreeg fout van fcntl()"

# ER_NET_PACKETS_OUT_OF_ORDER 08S01
source: "Got packets out of order"
nla: "Pakketten in verkeerde volgorde ontvangen"

# ER_NET_UNCOMPRESS_ERROR 08S01
source: "Couldn't uncompress communication packet"
nla: "Communicatiepakket kon niet worden gedecomprimeerd"

# ER_NET_READ_ERROR 08S01
source: "Got an error reading communication packets"
nla: "Fout bij het lezen van communicatiepakketten"

# ER_NET_READ_INTERRUPTED 08S01
source: "Got timeout reading communication packets"
nla: "Timeout bij het lezen van communicatiepakketten"

# ER_NET_ERROR_ON_WRITE 08S01
source: "Got an error writing communication packets"
nla: "Fout bij het schrijven van communicatiepakketten"

# ER_NET_WRITE_INTERRUPTED 08S01
source: "Got timeout writing communication packets"
nla: "Timeout bij het schrijven van communicatiepakketten"

# ER_TOO_LONG_STRING 42000
source: "Result string is longer than 'max_allowed_packet' bytes"
nla: "Resultaat string is langer dan 'max_allowed_packet'"

# ER_TABLE_CANT_HANDLE_BLOB 42000
source: "Storage engine %s doesn't support BLOB/TEXT columns"
nla: "Het gebruikte tabel type (%s) ondersteunt geen BLOB/TEXT kolommen"

# ER_TABLE_CANT_HANDLE_AUTO_INCREMENT 42000
source: "Storage engine %s doesn't support AUTO_INCREMENT columns"
nla: "Het gebruikte tabel type (%s) ondersteunt geen AUTO_INCREMENT kolommen"

# ER_DELAYED_INSERT_TABLE_LOCKED
source: "INSERT DELAYED can't be used with table '%-.192s' because it is locked with LOCK TABLES"
nla: "INSERT DELAYED kan niet worden gebruikt bij table '%-.192s', vanwege een 'lock met LOCK TABLES"

# ER_WRONG_COLUMN_NAME 42000
source: "Incorrect column name '%-.100s'"
nla: "Incorrecte kolom naam '%-.100s'"
