Repository: vladbogo/test-translation
Catalog: nor.xlf
Languages: nor

# ER_NO
source: "NO"
nor: "NEI"

# ER_YES
source: "YES"
nor: "JA"

# ER_CANT_CREATE_FILE
source: "Can't create file '%-.200s' (errno: %M)"
nor: "Kan ikke opprette fila '%-.200s' (Feilkode: %M)"

# ER_CANT_CREATE_TABLE
source: "Can't create table %`s.%`s (errno: %M)"
nor: "Kan ikke opprette tabellen %`s.%`s (Feilkode: %M)"

# ER_CANT_CREATE_DB
source: "Can't create database '%-.192s' (errno: %M)"
nor: "Kan ikke opprette databasen '%-.192s' (Feilkode: %M)"

# ER_DB_CREATE_EXISTS
source: "Can't create database '%-.192s'; database exists"
nor: "Kan ikke opprette databasen '%-.192s'; databasen eksisterer"

# ER_DB_DROP_EXISTS
source: "Can't drop database '%-.192s'; database doesn't exist"
nor: "Kan ikke fjerne (drop) '%-.192s'; databasen eksisterer ikke"

# ER_DB_DROP_DELETE
source: "Error dropping database (can't delete '%-.192s', errno: %M)"
nor: "Feil ved fjerning (drop) av databasen (kan ikke slette '%-.192s', feil %M)"

# ER_DB_DROP_RMDIR
source: "Error dropping database (can't rmdir '%-.192s', errno: %M)"
nor: "Feil ved sletting av database (kan ikke slette katalogen '%-.192s', feil %M)"

# ER_CANT_DELETE_FILE
source: "Error on delete of '%-.192s' (errno: %M)"
nor: "Feil ved sletting av '%-.192s' (Feilkode: %M)"

# ER_CANT_FIND_SYSTEM_REC
source: "Can't read record in system table"
nor: "Kan ikke lese posten i systemkatalogen"

# ER_CANT_GET_STAT
source: "Can't get status of '%-.200s' (errno: %M)"
nor: "Kan ikke lese statusen til '%-.200s' (Feilkode: %M)"

# ER_CANT_GET_WD
source: "Can't get working directory (errno: %M)"
nor: "Kan ikke lese aktiv katalog(Feilkode: %M)"

# ER_CANT_LOCK
source: "Can't lock file (errno: %M)"
nor: "Kan ikke låse fila (Feilkode: %M)"

# ER_CANT_OPEN_FILE
source: "Can't open file: '%-.200s' (errno: %M)"
nor: "Kan ikke åpne fila: '%-.200s' (Feilkode: %M)"

# ER_FILE_NOT_FOUND
source: "Can't find file: '%-.200s' (errno: %M)"
nor: "Kan ikke finne fila: '%-.200s' (Feilkode: %M)"

# ER_CANT_READ_DIR
source: "Can't read dir of '%-.192s' (errno: %M)"
nor: "Kan ikke lese katalogen '%-.192s' (Feilkode: %M)"

# ER_CANT_SET_WD
source: "Can't change dir to '%-.192s' (errno: %M)"
nor: "Kan ikke skifte katalog til '%-.192s' (Feilkode: %M)"

# ER_CHECKREAD
source: "Record has changed since last read in table '%-.192s'"
nor: "Posten har blitt endret siden den ble lest '%-.192s'"

# ER_DISK_FULL
source: "Disk full (%s); waiting for someone to free some space... (errno: %M)"
nor: "Ikke mer diskplass (%s). Venter på å få frigjort plass... (Feilkode: %M)"

# ER_DUP_KEY 23000
source: "Can't write; duplicate key in table '%-.192s'"
nor: "Kan ikke skrive, flere like nøkler i tabellen '%-.192s'"

# ER_ERROR_ON_CLOSE
source: "Error on close of '%-.192s' (errno: %M)"
nor: "Feil ved lukking av '%-.192s' (Feilkode: %M)"

# ER_ERROR_ON_READ
source: "Error reading file '%-.200s' (errno: %M)"
nor: "Feil ved lesing av '%-.200s' (Feilkode: %M)"

# ER_ERROR_ON_RENAME
source: "Error on rename of '%-.210s' to '%-.210s' (errno: %M)"
nor: "Feil ved omdøping av '%-.210s' til '%-.210s' (Feilkode: %M)"

# ER_ERROR_ON_WRITE
source: "Error writing file '%-.200s' (errno: %M)"
nor: "Feil ved skriving av fila '%-.200s' (Feilkode: %M)"

# ER_FILE_USED
source: "'%-.192s' is locked against change"
nor: "'%-.192s' er låst mot oppdateringer"

# ER_FILSORT_ABORT
source: "Sort aborted"
nor: "Sortering avbrutt"

# ER_FORM_NOT_FOUND
source: "View '%-.192s' doesn't exist for '%-.192s'"
nor: "View '%-.192s' eksisterer ikke for '%-.192s'"

# ER_GET_ERRNO
source: "Got error %M from storage engine %s"
nor: "Mottok feil %M fra tabell håndterer %s"

# ER_KEY_NOT_FOUND
source: "Can't find record in '%-.192s'"
nor: "Kan ikke finne posten i '%-.192s'"

# ER_NOT_FORM_FILE
source: "Incorrect information in file: '%-.200s'"
nor: "Feil informasjon i filen: '%-.200s'"

# ER_NOT_KEYFILE
source: "Index for table '%-.200s' is corrupt; try to repair it"
nor: "Tabellen '%-.200s' har feil i nøkkelfilen; forsøk å reparer den"

# ER_OLD_KEYFILE
source: "Old key file for table '%-.192s'; repair it!"
nor: "Gammel nøkkelfil for tabellen '%-.192s'; reparer den!"

# ER_OPEN_AS_READONLY
source: "Table '%-.192s' is read only"
nor: "'%-.192s' er skrivebeskyttet"

# ER_OUTOFMEMORY HY001 S1001
source: "Out of memory; restart server and try again (needed %d bytes)"
nor: "Ikke mer minne. Star på nytt tjenesten og prøv igjen (trengte %d byter)"

# ER_OUT_OF_SORTMEMORY HY001 S1001
source: "Out of sort memory, consider increasing server sort buffer size"
nor: "Ikke mer sorteringsminne. Vurder å øke sorteringsminnet (sort buffer size) for tjenesten"

# ER_UNEXPECTED_EOF
source: "Unexpected EOF found when reading file '%-.192s' (errno: %M)"
nor: "Uventet slutt på fil (eof) ved lesing av filen '%-.192s' (Feilkode: %M)"

# ER_CON_COUNT_ERROR 08004
source: "Too many connections"
nor: "For mange tilkoblinger (connections)"

# ER_OUT_OF_RESOURCES
source: "Out of memory."
nor: "Tomt for tråd plass/minne"

# ER_BAD_HOST_ERROR 08S01
source: "Can't get hostname for your address"
nor: "Kan ikke få tak i vertsnavn for din adresse"

# ER_HANDSHAKE_ERROR 08S01
source: "Bad handshake"
nor: "Feil håndtrykk (handshake)"

# ER_DBACCESS_DENIED_ERROR 42000
source: "Access denied for user '%s'@'%s' to database '%-.192s'"
nor: "Tilgang nektet for bruker: '%s'@'%s' til databasen '%-.192s' nektet"

# ER_ACCESS_DENIED_ERROR 28000
source: "Access denied for user '%s'@'%s' (using password: %s)"
nor: "Tilgang nektet for bruker: '%s'@'%s' (Bruker passord: %s)"

# ER_NO_DB_ERROR 3D000
source: "No database selected"
nor: "Ingen database valgt"

# ER_UNKNOWN_COM_ERROR 08S01
source: "Unknown command"
nor: "Ukjent kommando"

# ER_BAD_NULL_ERROR 23000
source: "Column '%-.192s' cannot be null"
nor: "Kolonne '%-.192s' kan ikke vere null"

# ER_BAD_DB_ERROR 42000
source: "Unknown database '%-.192s'"
nor: "Ukjent database '%-.192s'"

# ER_TABLE_EXISTS_ERROR 42S01
source: "Table '%-.192s' already exists"
nor: "Tabellen '%-.192s' eksisterer allerede"

# ER_BAD_TABLE_ERROR 42S02
source: "Unknown table '%-.100T'"
nor: "Ukjent tabell '%-.100T'"

# ER_NON_UNIQ_ERROR 23000
source: "Column '%-.192s' in %-.192s is ambiguous"
nor: "Felt: '%-.192s' i tabell %-.192s er ikke entydig"

# ER_SERVER_SHUTDOWN 08S01
source: "Server shutdown in progress"
nor: "Database nedkobling er i gang"

# ER_BAD_FIELD_ERROR 42S22 S0022
source: "Unknown column '%-.192s' in '%-.192s'"
nor: "Ukjent kolonne '%-.192s' i tabell %-.192s"

# ER_WRONG_FIELD_WITH_GROUP 42000 S1009
source: "'%-.192s' isn't in GROUP BY"
nor: "Brukte '%-.192s' som ikke var i group by"

# ER_WRONG_GROUP_FIELD 42000 S1009
source: "Can't group on '%-.192s'"
nor: "Kan ikke gruppere på '%-.192s'"

# ER_WRONG_SUM_SELECT 42000 S1009
source: "Statement has sum functions and columns in same statement"
nor: "Uttrykket har summer (sum) funksjoner og kolonner i samme uttrykk"

# ER_WRONG_VALUE_COUNT 21S01
source: "Column count doesn't match value count"
nor: "Felt telling stemmer verdi telling"

# ER_TOO_LONG_IDENT 42000 S1009
source: "Identifier name '%-.100T' is too long"
nor: "Identifikator '%-.100T' er for lang"

# ER_DUP_FIELDNAME 42S21 S1009
source: "Duplicate column name '%-.192s'"
nor: "Feltnavnet '%-.192s' eksisterte fra før"

# ER_DUP_KEYNAME 42000 S1009
source: "Duplicate key name '%-.192s'"
nor: "Nøkkelnavnet '%-.192s' eksisterte fra før"

# ER_DUP_ENTRY 23000 S1009
source: "Duplicate entry '%-.192T' for key %d"
nor: "Like verdier '%-.192T' for nøkkel %d"

# ER_WRONG_FIELD_SPEC 42000 S1009
source: "Incorrect column specifier for column '%-.192s'"
nor: "Feil kolonne spesifikator for felt '%-.192s'"

# ER_PARSE_ERROR 42000 s1009
source: "%s near '%-.80T' at line %d"
nor: "%s nær '%-.80T' på linje %d"

# ER_EMPTY_QUERY 42000
source: "Query was empty"
nor: "Forespørsel var tom"

# ER_NONUNIQ_TABLE 42000 S1009
source: "Not unique table/alias: '%-.192s'"
nor: "Ikke unikt tabell/alias: '%-.192s'"

# ER_INVALID_DEFAULT 42000 S1009
source: "Invalid default value for '%-.192s'"
nor: "Ugyldig standardverdi for '%-.192s'"

# ER_MULTIPLE_PRI_KEY 42000 S1009
source: "Multiple primary key defined"
nor: "Fleire primærnøkle spesifisert"

# ER_TOO_MANY_KEYS 42000 S1009
source: "Too many keys specified; max %d keys allowed"
nor: "For mange nøkler spesifisert. Maks %d nøkler tillatt"

# ER_TOO_MANY_KEY_PARTS 42000 S1009
source: "Too many key parts specified; max %d parts allowed"
nor: "For mange nøkkeldeler spesifisert. Maks %d deler tillatt"

# ER_TOO_LONG_KEY 42000 S1009
source: "Specified key was too long; max key length is %d bytes"
nor: "Spesifisert nøkkel var for lang. Maks nøkkellengde er is %d"

# ER_KEY_COLUMN_DOES_NOT_EXIST 42000 S1009
source: "Key column '%-.192s' doesn't exist in table"
nor: "Nøkkel felt '%-.192s' eksiterer ikke i tabellen"

# ER_TOO_BIG_FIELDLENGTH 42000 S1009
source: "Column length too big for column '%-.192s' (max = %lu); use BLOB or TEXT instead"
nor: "For stor nøkkellengde for kolonne '%-.192s' (maks = %lu). Bruk BLOB istedenfor"

# ER_WRONG_AUTO_KEY 42000 S1009
source: "Incorrect table definition; there can be only one auto column and it must be defined as a key"
nor: "Bare ett auto felt kan være definert som nøkkel"

# ER_NORMAL_SHUTDOWN
source: "%s (initiated by: %s): Normal shutdown"
nor: "%s (%s): Normal avslutning"

# ER_GOT_SIGNAL
source: "%s: Got signal %d. Aborting!\n"
nor: "%s: Oppdaget signal %d. Avslutter!\n"

# ER_SHUTDOWN_COMPLETE
source: "%s: Shutdown complete\n"
nor: "%s: Avslutning komplett\n"

# ER_FORCING_CLOSE 08S01
source: "%s: Forcing close of thread %ld user: '%-.48s'\n"
nor: "%s: Påtvinget avslutning av tråd %ld bruker: '%-.48s'\n"

# ER_IPSOCK_ERROR 08S01
source: "Can't create IP socket"
nor: "Kan ikke opprette IP socket"

# ER_NO_SUCH_INDEX 42S12 S1009
source: "Table '%-.192s' has no index like the one used in CREATE INDEX; recreate the table"
nor: "Tabellen '%-.192s' har ingen index som den som er brukt i CREATE INDEX. Gjenopprett tabellen"

# ER_WRONG_FIELD_TERMINATORS 42000 S1009
source: "Field separator argument is not what is expected; check the manual"
nor: "Felt skiller argumentene er ikke som forventet, se dokumentasjonen"

# ER_BLOBS_AND_NO_TERMINATED 42000 S1009
source: "You can't use fixed rowlength with BLOBs; please use 'fields terminated by'"
nor: "En kan ikke bruke faste feltlengder med BLOB. Vennlisgt bruk 'fields terminated by'"

# ER_TEXTFILE_NOT_READABLE
source: "The file '%-.128s' must be in the database directory or be readable by all"
nor: "Filen '%-.128s' må være i database-katalogen for å være lesbar for alle"

# ER_FILE_EXISTS_ERROR
source: "File '%-.200s' already exists"
nor: "Filen '%-.200s' eksisterte allerede"

# ER_LOAD_INFO
source: "Records: %ld Deleted: %ld Skipped: %ld Warnings: %ld"
nor: "Poster: %ld Fjernet: %ld Hoppet over: %ld Advarsler: %ld"

# ER_ALTER_INFO
source: "Records: %ld Duplicates: %ld"
nor: "Poster: %ld Like: %ld"

# ER_WRONG_SUB_KEY
source: "Incorrect prefix key; the used key part isn't a string, the used length is longer than the key part, or the storage engine doesn't support unique prefix keys"
nor: "Feil delnøkkel. Den brukte delnøkkelen er ikke en streng eller den oppgitte lengde er lengre enn nøkkel lengden"

# ER_CANT_REMOVE_ALL_FIELDS 42000
source: "You can't delete all columns with ALTER TABLE; use DROP TABLE instead"
nor: "En kan ikke slette alle felt med ALTER TABLE. Bruk DROP TABLE isteden"

# ER_CANT_DROP_FIELD_OR_KEY 42000
source: "Can't DROP %s %`-.192s; check that it exists"
nor: "Kan ikke DROP %s %`-.192s. Undersøk om felt/nøkkel eksisterer"

# ER_INSERT_INFO
source: "Records: %ld Duplicates: %ld Warnings: %ld"
nor: "Poster: %ld Like: %ld Advarsler: %ld"

# ER_NO_SUCH_THREAD
source: "Unknown thread id: %lu"
nor: "Ukjent tråd id: %lu"

# ER_KILL_DENIED_ERROR
source: "You are not owner of thread %lld"
nor: "Du er ikke eier av tråden %lld"

# ER_NO_TABLES_USED
source: "No tables used"
nor: "Ingen tabeller i bruk"

# ER_TOO_BIG_SET
source: "Too many strings for column %-.192s and SET"
nor: "For mange tekststrenger kolonne %-.192s og SET"

# ER_NO_UNIQUE_LOGFILE
source: "Can't generate a unique log-filename %-.200s.(1-999)\n"
nor: "Kan ikke lage unikt loggfilnavn %-.200s.(1-999)\n"

# ER_TABLE_NOT_LOCKED_FOR_WRITE
source: "Table '%-.192s' was locked with a READ lock and can't be updated"
nor: "Tabellen '%-.192s' var låst med READ lås og kan ikke oppdateres"

# ER_TABLE_NOT_LOCKED
source: "Table '%-.192s' was not locked with LOCK TABLES"
nor: "Tabellen '%-.192s' var ikke låst med LOCK TABLES"

# ER_WRONG_DB_NAME 42000
source: "Incorrect database name '%-.100T'"
nor: "Ugyldig database navn '%-.100T'"

# ER_WRONG_TABLE_NAME 42000
source: "Incorrect table name '%-.100s'"
nor: "Ugyldig tabell navn '%-.100s'"

# ER_TOO_BIG_SELECT 42000
source: "The SELECT would examine more than MAX_JOIN_SIZE rows; check your WHERE and use SET SQL_BIG_SELECTS=1 or SET MAX_JOIN_SIZE=# if the SELECT is okay"
nor: "SELECT ville undersøke for mange poster og ville sannsynligvis ta veldig lang tid. Undersøk WHERE klausulen og bruk SET SQL_BIG_SELECTS=1 om SELECTen er korrekt"

# ER_UNKNOWN_ERROR
source: "Unknown error"
nor: "Ukjent feil"

# ER_UNKNOWN_PROCEDURE 42000
source: "Unknown procedure '%-.192s'"
nor: "Ukjent prosedyre %-.192s"

# ER_WRONG_PARAMCOUNT_TO_PROCEDURE 42000
source: "Incorrect parameter count to procedure '%-.192s'"
nor: "Feil parameter antall til prosedyren %-.192s"

# ER_WRONG_PARAMETERS_TO_PROCEDURE
source: "Incorrect parameters to procedure '%-.192s'"
nor: "Feil parametre til prosedyren %-.192s"

# ER_UNKNOWN_TABLE 42S02
source: "Unknown table '%-.192s' in %-.32s"
nor: "Ukjent tabell '%-.192s' i %-.32s"

# ER_FIELD_SPECIFIED_TWICE 42000
source: "Column '%-.192s' specified twice"
nor: "Feltet '%-.192s' er spesifisert to ganger"

# ER_UNSUPPORTED_EXTENSION 42000
source: "Table '%-.192s' uses an extension that doesn't exist in this MariaDB version"
nor: "Table '%-.192s' uses a extension that doesn't exist in this MariaDB version"

# ER_CANT_CREATE_THREAD
source: "Can't create a new thread (errno %M); if you are not out of available memory, you can consult the manual for a possible OS-dependent bug"
nor: "Can't create a new thread (errno %M); if you are not out of available memory you can consult the manual for any possible OS dependent bug"

# ER_ILLEGAL_GRANT_FOR_TABLE 42000
source: "Illegal GRANT/REVOKE command; please consult the manual to see which privileges can be used"
nor: "Illegal GRANT/REVOKE command; please consult the manual to see which privleges can be used"

# ER_SYNTAX_ERROR 42000
source: "You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use"
nor: "Something is wrong in your syntax"

# ER_WRONG_MRG_TABLE
source: "Unable to open underlying table which is differently defined or of non-MyISAM type or doesn't exist"
nor: "All tables in the MERGE table are not defined identically"

# ER_BLOB_KEY_WITHOUT_LENGTH 42000
source: "BLOB/TEXT column '%-.192s' used in key specification without a key length"
nor: "BLOB column '%-.192s' used in key specification without a key length"

# ER_CHECK_NOT_IMPLEMENTED 42000
source: "The storage engine for the table doesn't support %s"
nor: "The handler for the table doesn't support %s"

# ER_GET_ERRMSG
source: "Got error %d '%-.200s' from %s"
nor: "Mottok feil %d '%-.200s' fa %s"

# ER_GET_TEMPORARY_ERRMSG
source: "Got temporary error %d '%-.200s' from %s"
nor: "Mottok temporary feil %d '%-.200s' fra %s"

# ER_DUP_ENTRY_WITH_KEY_NAME 23000 S1009
source: "Duplicate entry '%-.64T' for key '%-.192s'"
nor: "Like verdier '%-.64T' for nøkkel '%-.192s'"

# ER_ACCESS_DENIED_NO_PASSWORD_ERROR 28000
source: "Access denied for user '%s'@'%s'"
nor: "Tilgang nektet for bruker: '%s'@'%s'"

# ER_DUP_UNKNOWN_IN_INDEX 23000
source: "Duplicate entry for key '%-.192s'"
nor: "Like verdier for nøkkel '%-.192s'"
