Repository: vladbogo/test-translation
Catalog: norwegian-ny.xlf
Languages: norwegian_ny

# ER_NO
source: "NO"
norwegian_ny: "NEI"

# ER_YES
source: "YES"
norwegian_ny: "JA"

# ER_CANT_CREATE_FILE
source: "Can't create file '%-.200s' (errno: %M)"
norwegian_ny: "Kan ikkje opprette fila '%-.200s' (Feilkode: %M)"

# ER_CANT_CREATE_TABLE
source: "Can't create table %`s.%`s (errno: %M)"
norwegian_ny: "Kan ikkje opprette tabellen %`s.%`s (Feilkode: %M)"

# ER_CANT_CREATE_DB
source: "Can't create database '%-.192s' (errno: %M)"
norwegian_ny: "Kan ikkje opprette databasen '%-.192s' (Feilkode: %M)"

# ER_DB_CREATE_EXISTS
source: "Can't create database '%-.192s'; database exists"
norwegian_ny: "Kan ikkje opprette databasen '%-.192s'; databasen eksisterer"

# ER_DB_DROP_EXISTS
source: "Can't drop database '%-.192s'; database doesn't exist"
norwegian_ny: "Kan ikkje fjerne (drop) '%-.192s'; databasen eksisterer ikkje"

# ER_DB_DROP_DELETE
source: "Error dropping database (can't delete '%-.192s', errno: %M)"
norwegian_ny: "Feil ved fjerning (drop) av databasen (kan ikkje slette '%-.192s', feil %M)"

# ER_DB_DROP_RMDIR
source: "Error dropping database (can't rmdir '%-.192s', errno: %M)"
norwegian_ny: "Feil ved sletting av database (kan ikkje slette katalogen '%-.192s', feil %M)"

# ER_CANT_DELETE_FILE
source: "Error on delete of '%-.192s' (errno: %M)"
norwegian_ny: "Feil ved sletting av '%-.192s' (Feilkode: %M)"

# ER_CANT_FIND_SYSTEM_REC
source: "Can't read record in system table"
norwegian_ny: "Kan ikkje lese posten i systemkatalogen"

# ER_CANT_GET_STAT
source: "Can't get status of '%-.200s' (errno: %M)"
norwegian_ny: "Kan ikkje lese statusen til '%-.200s' (Feilkode: %M)"

# ER_CANT_GET_WD
source: "Can't get working directory (errno: %M)"
norwegian_ny: "Kan ikkje lese aktiv katalog(Feilkode: %M)"

# ER_CANT_LOCK
source: "Can't lock file (errno: %M)"
norwegian_ny: "Kan ikkje låse fila (Feilkode: %M)"

# ER_CANT_OPEN_FILE
source: "Can't open file: '%-.200s' (errno: %M)"
norwegian_ny: "Kan ikkje åpne fila: '%-.200s' (Feilkode: %M)"

# ER_FILE_NOT_FOUND
source: "Can't find file: '%-.200s' (errno: %M)"
norwegian_ny: "Kan ikkje finne fila: '%-.200s' (Feilkode: %M)"

# ER_CANT_READ_DIR
source: "Can't read dir of '%-.192s' (errno: %M)"
norwegian_ny: "Kan ikkje lese katalogen '%-.192s' (Feilkode: %M)"

# ER_CANT_SET_WD
source: "Can't change dir to '%-.192s' (errno: %M)"
norwegian_ny: "Kan ikkje skifte katalog til '%-.192s' (Feilkode: %M)"

# ER_CHECKREAD
source: "Record has changed since last read in table '%-.192s'"
norwegian_ny: "Posten har vorte endra sidan den sist vart lesen '%-.192s'"

# ER_DISK_FULL
source: "Disk full (%s); waiting for someone to free some space... (errno: %M)"
norwegian_ny: "Ikkje meir diskplass (%s). Ventar på å få frigjort plass... (Feilkode: %M)"

# ER_DUP_KEY 23000
source: "Can't write; duplicate key in table '%-.192s'"
norwegian_ny: "Kan ikkje skrive, flere like nyklar i tabellen '%-.192s'"

# ER_ERROR_ON_CLOSE
source: "Error on close of '%-.192s' (errno: %M)"
norwegian_ny: "Feil ved lukking av '%-.192s' (Feilkode: %M)"

# ER_ERROR_ON_READ
source: "Error reading file '%-.200s' (errno: %M)"
norwegian_ny: "Feil ved lesing av '%-.200s' (Feilkode: %M)"

# ER_ERROR_ON_RENAME
source: "Error on rename of '%-.210s' to '%-.210s' (errno: %M)"
norwegian_ny: "Feil ved omdøyping av '%-.210s' til '%-.210s' (Feilkode: %M)"

# ER_ERROR_ON_WRITE
source: "Error writing file '%-.200s' (errno: %M)"
norwegian_ny: "Feil ved skriving av fila '%-.200s' (Feilkode: %M)"

# ER_FILE_USED
source: "'%-.192s' is locked against change"
norwegian_ny: "'%-.192s' er låst mot oppdateringar"

# ER_FILSORT_ABORT
source: "Sort aborted"
norwegian_ny: "Sortering avbrote"

# ER_FORM_NOT_FOUND
source: "View '%-.192s' doesn't exist for '%-.192s'"
norwegian_ny: "View '%-.192s' eksisterar ikkje for '%-.192s'"

# ER_GET_ERRNO
source: "Got error %M from storage engine %s"
norwegian_ny: "Mottok feil %M fra tabell handterar %s"

# ER_KEY_NOT_FOUND
source: "Can't find record in '%-.192s'"
norwegian_ny: "Kan ikkje finne posten i '%-.192s'"

# ER_NOT_FORM_FILE
source: "Incorrect information in file: '%-.200s'"
norwegian_ny: "Feil informasjon i fila: '%-.200s'"

# ER_NOT_KEYFILE
source: "Index for table '%-.200s' is corrupt; try to repair it"
norwegian_ny: "Tabellen '%-.200s' har feil i nykkelfila; prøv å reparere den"

# ER_OLD_KEYFILE
source: "Old key file for table '%-.192s'; repair it!"
norwegian_ny: "Gammel nykkelfil for tabellen '%-.192s'; reparer den!"

# ER_OPEN_AS_READONLY
source: "Table '%-.192s' is read only"
norwegian_ny: "'%-.192s' er skrivetryggja"

# ER_OUTOFMEMORY HY001 S1001
source: "Out of memory; restart server and try again (needed %d bytes)"
norwegian_ny: "Ikkje meir minne. Start på nytt tenesten og prøv igjen (trengte %d bytar)"

# ER_OUT_OF_SORTMEMORY HY001 S1001
source: "Out of sort memory, consider increasing server sort buffer size"
norwegian_ny: "Ikkje meir sorteringsminne. Vurder å auke sorteringsminnet (sorteringsbuffer storleik) for tenesten"

# ER_UNEXPECTED_EOF
source: "Unexpected EOF found when reading file '%-.192s' (errno: %M)"
norwegian_ny: "Uventa slutt på fil (eof) ved lesing av fila '%-.192s' (Feilkode: %M)"

# ER_CON_COUNT_ERROR 08004
source: "Too many connections"
norwegian_ny: "For mange tilkoplingar (connections)"

# ER_OUT_OF_RESOURCES
source: "Out of memory."
norwegian_ny: "Tomt for tråd plass/minne"

# ER_BAD_HOST_ERROR 08S01
source: "Can't get hostname for your address"
norwegian_ny: "Kan ikkje få tak i vertsnavn for di adresse"

# ER_HANDSHAKE_ERROR 08S01
source: "Bad handshake"
norwegian_ny: "Feil handtrykk (handshake)"

# ER_DBACCESS_DENIED_ERROR 42000
source: "Access denied for user '%s'@'%s' to database '%-.192s'"
norwegian_ny: "Tilgang ikkje tillate for brukar: '%s'@'%s' til databasen '%-.192s' nekta"

# ER_ACCESS_DENIED_ERROR 28000
source: "Access denied for user '%s'@'%s' (using password: %s)"
norwegian_ny: "Tilgang ikke tillate for brukar: '%s'@'%s' (Brukar passord: %s)"

# ER_NO_DB_ERROR 3D000
source: "No database selected"
norwegian_ny: "Ingen database vald"

# ER_UNKNOWN_COM_ERROR 08S01
source: "Unknown command"
norwegian_ny: "Ukjent kommando"

# ER_BAD_NULL_ERROR 23000
source: "Column '%-.192s' cannot be null"
norwegian_ny: "Kolonne '%-.192s' kan ikkje vere null"

# ER_BAD_DB_ERROR 42000
source: "Unknown database '%-.192s'"
norwegian_ny: "Ukjent database '%-.192s'"

# ER_TABLE_EXISTS_ERROR 42S01
source: "Table '%-.192s' already exists"
norwegian_ny: "Tabellen '%-.192s' eksisterar allereide"

# ER_BAD_TABLE_ERROR 42S02
source: "Unknown table '%-.100T'"
norwegian_ny: "Ukjent tabell '%-.100T'"

# ER_NON_UNIQ_ERROR 23000
source: "Column '%-.192s' in %-.192s is ambiguous"
norwegian_ny: "Kolonne: '%-.192s' i tabell %-.192s er ikkje eintydig"

# ER_SERVER_SHUTDOWN 08S01
source: "Server shutdown in progress"
norwegian_ny: "Tenar nedkopling er i gang"

# ER_BAD_FIELD_ERROR 42S22 S0022
source: "Unknown column '%-.192s' in '%-.192s'"
norwegian_ny: "Ukjent felt '%-.192s' i tabell %-.192s"

# ER_WRONG_FIELD_WITH_GROUP 42000 S1009
source: "'%-.192s' isn't in GROUP BY"
norwegian_ny: "Brukte '%-.192s' som ikkje var i group by"

# ER_WRONG_GROUP_FIELD 42000 S1009
source: "Can't group on '%-.192s'"
norwegian_ny: "Kan ikkje gruppere på '%-.192s'"

# ER_WRONG_SUM_SELECT 42000 S1009
source: "Statement has sum functions and columns in same statement"
norwegian_ny: "Uttrykket har summer (sum) funksjoner og kolonner i same uttrykk"

# ER_WRONG_VALUE_COUNT 21S01
source: "Column count doesn't match value count"
norwegian_ny: "Kolonne telling stemmer verdi telling"

# ER_TOO_LONG_IDENT 42000 S1009
source: "Identifier name '%-.100T' is too long"
norwegian_ny: "Identifikator '%-.100T' er for lang"

# ER_DUP_FIELDNAME 42S21 S1009
source: "Duplicate column name '%-.192s'"
norwegian_ny: "Feltnamnet '%-.192s' eksisterte frå før"

# ER_DUP_KEYNAME 42000 S1009
source: "Duplicate key name '%-.192s'"
norwegian_ny: "Nøkkelnamnet '%-.192s' eksisterte frå før"

# ER_DUP_ENTRY 23000 S1009
source: "Duplicate entry '%-.192T' for key %d"
norwegian_ny: "Like verdiar '%-.192T' for nykkel %d"

# ER_WRONG_FIELD_SPEC 42000 S1009
source: "Incorrect column specifier for column '%-.192s'"
norwegian_ny: "Feil kolonne spesifikator for kolonne '%-.192s'"

# ER_PARSE_ERROR 42000 s1009
source: "%s near '%-.80T' at line %d"
norwegian_ny: "%s attmed '%-.80T' på line %d"

# ER_EMPTY_QUERY 42000
source: "Query was empty"
norwegian_ny: "Førespurnad var tom"

# ER_NONUNIQ_TABLE 42000 S1009
source: "Not unique table/alias: '%-.192s'"
norwegian_ny: "Ikkje unikt tabell/alias: '%-.192s'"

# ER_INVALID_DEFAULT 42000 S1009
source: "Invalid default value for '%-.192s'"
norwegian_ny: "Ugyldig standardverdi for '%-.192s'"

# ER_MULTIPLE_PRI_KEY 42000 S1009
source: "Multiple primary key defined"
norwegian_ny: "Fleire primærnyklar spesifisert"

# ER_TOO_MANY_KEYS 42000 S1009
source: "Too many keys specified; max %d keys allowed"
norwegian_ny: "For mange nykler spesifisert. Maks %d nyklar tillatt"

# ER_TOO_MANY_KEY_PARTS 42000 S1009
source: "Too many key parts specified; max %d parts allowed"
norwegian_ny: "For mange nykkeldelar spesifisert. Maks %d delar tillatt"

# ER_TOO_LONG_KEY 42000 S1009
source: "Specified key was too long; max key length is %d bytes"
norwegian_ny: "Spesifisert nykkel var for lang. Maks nykkellengde er %d"

# ER_KEY_COLUMN_DOES_NOT_EXIST 42000 S1009
source: "Key column '%-.192s' doesn't exist in table"
norwegian_ny: "Nykkel kolonne '%-.192s' eksiterar ikkje i tabellen"

# ER_TOO_BIG_FIELDLENGTH 42000 S1009
source: "Column length too big for column '%-.192s' (max = %lu); use BLOB or TEXT instead"
norwegian_ny: "For stor nykkellengde for felt '%-.192s' (maks = %lu). Bruk BLOB istadenfor"

# ER_WRONG_AUTO_KEY 42000 S1009
source: "Incorrect table definition; there can be only one auto column and it must be defined as a key"
norwegian_ny: "Bare eitt auto felt kan være definert som nøkkel"

# ER_NORMAL_SHUTDOWN
source: "%s (initiated by: %s): Normal shutdown"
norwegian_ny: "%s (%s): Normal nedkopling"

# ER_GOT_SIGNAL
source: "%s: Got signal %d. Aborting!\n"
norwegian_ny: "%s: Oppdaga signal %d. Avsluttar!\n"

# ER_SHUTDOWN_COMPLETE
source: "%s: Shutdown complete\n"
norwegian_ny: "%s: Nedkopling komplett\n"

# ER_FORCING_CLOSE 08S01
source: "%s: Forcing close of thread %ld user: '%-.48s'\n"
norwegian_ny: "%s: Påtvinga avslutning av tråd %ld brukar: '%-.48s'\n"

# ER_IPSOCK_ERROR 08S01
source: "Can't create IP socket"
norwegian_ny: "Kan ikkje opprette IP socket"

# ER_NO_SUCH_INDEX 42S12 S1009
source: "Table '%-.192s' has no index like the one used in CREATE INDEX; recreate the table"
norwegian_ny: "Tabellen '%-.192s' har ingen index som den som er brukt i CREATE INDEX. Oprett tabellen på nytt"

# ER_WRONG_FIELD_TERMINATORS 42000 S1009
source: "Field separator argument is not what is expected; check the manual"
norwegian_ny: "Felt skiljer argumenta er ikkje som venta, sjå dokumentasjonen"

# ER_BLOBS_AND_NO_TERMINATED 42000 S1009
source: "You can't use fixed rowlength with BLOBs; please use 'fields terminated by'"
norwegian_ny: "Ein kan ikkje bruke faste feltlengder med BLOB. Vennlisgt bruk 'fields terminated by'"

# ER_TEXTFILE_NOT_READABLE
source: "The file '%-.128s' must be in the database directory or be readable by all"
norwegian_ny: "Filen '%-.128s' må være i database-katalogen for å være lesbar for alle"

# ER_FILE_EXISTS_ERROR
source: "File '%-.200s' already exists"
norwegian_ny: "Filen '%-.200s' eksisterte allereide"

# ER_LOAD_INFO
source: "Records: %ld Deleted: %ld Skipped: %ld Warnings: %ld"
norwegian_ny: "Poster: %ld Fjerna: %ld Hoppa over: %ld Åtvaringar: %ld"

# ER_ALTER_INFO
source: "Records: %ld Duplicates: %ld"
norwegian_ny: "Poster: %ld Like: %ld"

# ER_WRONG_SUB_KEY
source: "Incorrect prefix key; the used key part isn't a string, the used length is longer than the key part, or the storage engine doesn't support unique prefix keys"
norwegian_ny: "Feil delnykkel. Den brukte delnykkelen er ikkje ein streng eller den oppgitte lengda er lengre enn nykkellengden"

# ER_CANT_REMOVE_ALL_FIELDS 42000
source: "You can't delete all columns with ALTER TABLE; use DROP TABLE instead"
norwegian_ny: "Ein kan ikkje slette alle felt med ALTER TABLE. Bruk DROP TABLE istadenfor"

# ER_CANT_DROP_FIELD_OR_KEY 42000
source: "Can't DROP %s %`-.192s; check that it exists"
norwegian_ny: "Kan ikkje DROP %s %`-.192s. Undersøk om felt/nøkkel eksisterar"

# ER_INSERT_INFO
source: "Records: %ld Duplicates: %ld Warnings: %ld"
norwegian_ny: "Postar: %ld Like: %ld Åtvaringar: %ld"

# ER_NO_SUCH_THREAD
source: "Unknown thread id: %lu"
norwegian_ny: "Ukjent tråd id: %lu"

# ER_KILL_DENIED_ERROR
source: "You are not owner of thread %lld"
norwegian_ny: "Du er ikkje eigar av tråd %lld"

# ER_NO_TABLES_USED
source: "No tables used"
norwegian_ny: "Ingen tabellar i bruk"

# ER_TOO_BIG_SET
source: "Too many strings for column %-.192s and SET"
norwegian_ny: "For mange tekststrengar felt %-.192s og SET"

# ER_NO_UNIQUE_LOGFILE
source: "Can't generate a unique log-filename %-.200s.(1-999)\n"
norwegian_ny: "Kan ikkje lage unikt loggfilnavn %-.200s.(1-999)\n"

# ER_TABLE_NOT_LOCKED_FOR_WRITE
source: "Table '%-.192s' was locked with a READ lock and can't be updated"
norwegian_ny: "Tabellen '%-.192s' var låst med READ lås og kan ikkje oppdaterast"

# ER_TABLE_NOT_LOCKED
source: "Table '%-.192s' was not locked with LOCK TABLES"
norwegian_ny: "Tabellen '%-.192s' var ikkje låst med LOCK TABLES"

# ER_WRONG_DB_NAME 42000
source: "Incorrect database name '%-.100T'"
norwegian_ny: "Ugyldig database namn '%-.100T'"

# ER_WRONG_TABLE_NAME 42000
source: "Incorrect table name '%-.100s'"
norwegian_ny: "Ugyldig tabell namn '%-.100s'"

# ER_TOO_BIG_SELECT 42000
source: "The SELECT would examine more than MAX_JOIN_SIZE rows; check your WHERE and use SET SQL_BIG_SELECTS=1 or SET MAX_JOIN_SIZE=# if the SELECT is okay"
norwegian_ny: "SELECT ville undersøkje for mange postar og ville sannsynligvis ta veldig lang tid. Undersøk WHERE klausulen og bruk SET SQL_BIG_SELECTS=1 om SELECTen er korrekt"

# ER_UNKNOWN_ERROR
source: "Unknown error"
norwegian_ny: "Ukjend feil"

# ER_UNKNOWN_PROCEDURE 42000
source: "Unknown procedure '%-.192s'"
norwegian_ny: "Ukjend prosedyre %-.192s"

# ER_WRONG_PARAMCOUNT_TO_PROCEDURE 42000
source: "Incorrect parameter count to procedure '%-.192s'"
norwegian_ny: "Feil parameter tal til prosedyra %-.192s"

# ER_WRONG_PARAMETERS_TO_PROCEDURE
source: "Incorrect parameters to procedure '%-.192s'"
norwegian_ny: "Feil parameter til prosedyra %-.192s"

# ER_UNKNOWN_TABLE 42S02
source: "Unknown table '%-.192s' in %-.32s"
norwegian_ny: "Ukjend tabell '%-.192s' i %-.32s"

# ER_FIELD_SPECIFIED_TWICE 42000
source: "Column '%-.192s' specified twice"
norwegian_ny: "Feltet '%-.192s' er spesifisert to gangar"

# ER_UNSUPPORTED_EXTENSION 42000
source: "Table '%-.192s' uses an extension that doesn't exist in this MariaDB version"
norwegian_ny: "Table '%-.192s' uses a extension that doesn't exist in this MariaDB version"

# ER_CANT_CREATE_THREAD
source: "Can't create a new thread (errno %M); if you are not out of available memory, you can consult the manual for a possible OS-dependent bug"
norwegian_ny: "Can't create a new thread (errno %M); if you are not out of available memory you can consult the manual for any possible OS dependent bug"

# ER_ILLEGAL_GRANT_FOR_TABLE 42000
source: "Illegal GRANT/REVOKE command; please consult the manual to see which privileges can be used"
norwegian_ny: "Illegal GRANT/REVOKE command; please consult the manual to see which privleges can be used"

# ER_SYNTAX_ERROR 42000
source: "You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use"
norwegian_ny: "Something is wrong in your syntax"

# ER_WRONG_MRG_TABLE
source: "Unable to open underlying table which is differently defined or of non-MyISAM type or doesn't exist"
norwegian_ny: "All tables in the MERGE table are not defined identically"

# ER_BLOB_KEY_WITHOUT_LENGTH 42000
source: "BLOB/TEXT column '%-.192s' used in key specification without a key length"
norwegian_ny: "BLOB column '%-.192s' used in key specification without a key length"

# ER_CHECK_NOT_IMPLEMENTED 42000
source: "The storage engine for the table doesn't support %s"
norwegian_ny: "The handler for the table doesn't support %s"

# ER_NO_REFERENCED_ROW 23000
source: "Cannot add or update a child row: a foreign key constraint fails"
norwegian_ny: "Cannot add a child row: a foreign key constraint fails"

# ER_GET_ERRMSG
source: "Got error %d '%-.200s' from %s"
norwegian_ny: "Mottok feil %d '%-.200s' fra %s"

# ER_GET_TEMPORARY_ERRMSG
source: "Got temporary error %d '%-.200s' from %s"
norwegian_ny: "Mottok temporary feil %d '%-.200s' fra %s"

# ER_DUP_ENTRY_WITH_KEY_NAME 23000 S1009
source: "Duplicate entry '%-.64T' for key '%-.192s'"
norwegian_ny: "Like verdiar '%-.64T' for nykkel '%-.192s'"

# ER_ACCESS_DENIED_NO_PASSWORD_ERROR 28000
source: "Access denied for user '%s'@'%s'"
norwegian_ny: "Tilgang ikke tillate for brukar: '%s'@'%s'"

# ER_DUP_UNKNOWN_IN_INDEX 23000
source: "Duplicate entry for key '%-.192s'"
norwegian_ny: "Like verdiar for nykkel '%-.192s'"
