Repository: vladbogo/test-translation
Catalog: pol.xlf
Languages: pol

# ER_NO
source: "NO"
pol: "NIE"

# ER_YES
source: "YES"
pol: "TAK"

# ER_CANT_CREATE_FILE
source: "Can't create file '%-.200s' (errno: %M)"
pol: "Nie można stworzyć pliku '%-.200s' (Kod błędu: %M)"

# ER_CANT_CREATE_TABLE
source: "Can't create table %`s.%`s (errno: %M)"
pol: "Nie można stworzyć tabeli %`s.%`s (Kod błędu: %M)"

# ER_CANT_CREATE_DB
source: "Can't create database '%-.192s' (errno: %M)"
pol: "Nie można stworzyć bazy danych '%-.192s' (Kod błędu: %M)"

# ER_DB_CREATE_EXISTS
source: "Can't create database '%-.192s'; database exists"
pol: "Nie można stworzyć bazy danych '%-.192s'; baza danych już istnieje"

# ER_DB_DROP_EXISTS
source: "Can't drop database '%-.192s'; database doesn't exist"
pol: "Nie można usun?ć bazy danych '%-.192s'; baza danych nie istnieje"

# ER_DB_DROP_DELETE
source: "Error dropping database (can't delete '%-.192s', errno: %M)"
pol: "Bł?d podczas usuwania bazy danych (nie można usun?ć '%-.192s', bł?d %M)"

# ER_DB_DROP_RMDIR
source: "Error dropping database (can't rmdir '%-.192s', errno: %M)"
pol: "Bł?d podczas usuwania bazy danych (nie można wykonać rmdir '%-.192s', bł?d %M)"

# ER_CANT_DELETE_FILE
source: "Error on delete of '%-.192s' (errno: %M)"
pol: "Bł?d podczas usuwania '%-.192s' (Kod błędu: %M)"

# ER_CANT_FIND_SYSTEM_REC
source: "Can't read record in system table"
pol: "Nie można odczytać rekordu z tabeli systemowej"

# ER_CANT_GET_STAT
source: "Can't get status of '%-.200s' (errno: %M)"
pol: "Nie można otrzymać statusu '%-.200s' (Kod błędu: %M)"

# ER_CANT_GET_WD
source: "Can't get working directory (errno: %M)"
pol: "Nie można rozpoznać aktualnego katalogu (Kod błędu: %M)"

# ER_CANT_LOCK
source: "Can't lock file (errno: %M)"
pol: "Nie można zablokować pliku (Kod błędu: %M)"

# ER_CANT_OPEN_FILE
source: "Can't open file: '%-.200s' (errno: %M)"
pol: "Nie można otworzyć pliku: '%-.200s' (Kod błędu: %M)"

# ER_FILE_NOT_FOUND
source: "Can't find file: '%-.200s' (errno: %M)"
pol: "Nie można znaleĽć pliku: '%-.200s' (Kod błędu: %M)"

# ER_CANT_READ_DIR
source: "Can't read dir of '%-.192s' (errno: %M)"
pol: "Nie można odczytać katalogu '%-.192s' (Kod błędu: %M)"

# ER_CANT_SET_WD
source: "Can't change dir to '%-.192s' (errno: %M)"
pol: "Nie można zmienić katalogu na '%-.192s' (Kod błędu: %M)"

# ER_CHECKREAD
source: "Record has changed since last read in table '%-.192s'"
pol: "Rekord został zmieniony od ostaniego odczytania z tabeli '%-.192s'"

# ER_DISK_FULL
source: "Disk full (%s); waiting for someone to free some space... (errno: %M)"
pol: "Dysk pełny (%s). Oczekiwanie na zwolnienie miejsca... (Kod błędu: %M)"

# ER_DUP_KEY 23000
source: "Can't write; duplicate key in table '%-.192s'"
pol: "Nie można zapisać, powtórzone klucze w tabeli '%-.192s'"

# ER_ERROR_ON_CLOSE
source: "Error on close of '%-.192s' (errno: %M)"
pol: "Bł?d podczas zamykania '%-.192s' (Kod błędu: %M)"

# ER_ERROR_ON_READ
source: "Error reading file '%-.200s' (errno: %M)"
pol: "Bł?d podczas odczytu pliku '%-.200s' (Kod błędu: %M)"

# ER_ERROR_ON_RENAME
source: "Error on rename of '%-.210s' to '%-.210s' (errno: %M)"
pol: "Bł?d podczas zmieniania nazwy '%-.210s' na '%-.210s' (Kod błędu: %M)"

# ER_ERROR_ON_WRITE
source: "Error writing file '%-.200s' (errno: %M)"
pol: "Bł?d podczas zapisywania pliku '%-.200s' (Kod błędu: %M)"

# ER_FILE_USED
source: "'%-.192s' is locked against change"
pol: "'%-.192s' jest zablokowany na wypadek zmian"

# ER_FILSORT_ABORT
source: "Sort aborted"
pol: "Sortowanie przerwane"

# ER_FORM_NOT_FOUND
source: "View '%-.192s' doesn't exist for '%-.192s'"
pol: "Widok '%-.192s' nie istnieje dla '%-.192s'"

# ER_GET_ERRNO
source: "Got error %M from storage engine %s"
pol: "Otrzymano bł?d %M z obsługi tabeli %s"

# ER_KEY_NOT_FOUND
source: "Can't find record in '%-.192s'"
pol: "Nie można znaleĽć rekordu w '%-.192s'"

# ER_NOT_FORM_FILE
source: "Incorrect information in file: '%-.200s'"
pol: "Niewła?ciwa informacja w pliku: '%-.200s'"

# ER_NOT_KEYFILE
source: "Index for table '%-.200s' is corrupt; try to repair it"
pol: "Niewła?ciwy plik kluczy dla tabeli: '%-.200s'; spróbuj go naprawić"

# ER_OLD_KEYFILE
source: "Old key file for table '%-.192s'; repair it!"
pol: "Plik kluczy dla tabeli '%-.192s' jest starego typu; napraw go!"

# ER_OPEN_AS_READONLY
source: "Table '%-.192s' is read only"
pol: "'%-.192s' jest tylko do odczytu"

# ER_OUTOFMEMORY HY001 S1001
source: "Out of memory; restart server and try again (needed %d bytes)"
pol: "Zbyt mało pamięci. Uruchom ponownie demona i spróbuj ponownie (potrzeba %d bajtów)"

# ER_OUT_OF_SORTMEMORY HY001 S1001
source: "Out of sort memory, consider increasing server sort buffer size"
pol: "Zbyt mało pamięci dla sortowania. Zwiększ wielko?ć bufora demona dla sortowania"

# ER_UNEXPECTED_EOF
source: "Unexpected EOF found when reading file '%-.192s' (errno: %M)"
pol: "Nieoczekiwany 'eof' napotkany podczas czytania z pliku '%-.192s' (Kod błędu: %M)"

# ER_CON_COUNT_ERROR 08004
source: "Too many connections"
pol: "Zbyt wiele poł?czeń"

# ER_OUT_OF_RESOURCES
source: "Out of memory."
pol: "Zbyt mało miejsca/pamięci dla w?tku"

# ER_BAD_HOST_ERROR 08S01
source: "Can't get hostname for your address"
pol: "Nie można otrzymać nazwy hosta dla twojego adresu"

# ER_HANDSHAKE_ERROR 08S01
source: "Bad handshake"
pol: "Zły uchwyt(handshake)"

# ER_NO_DB_ERROR 3D000
source: "No database selected"
pol: "Nie wybrano żadnej bazy danych"

# ER_UNKNOWN_COM_ERROR 08S01
source: "Unknown command"
pol: "Nieznana komenda"

# ER_BAD_NULL_ERROR 23000
source: "Column '%-.192s' cannot be null"
pol: "Kolumna '%-.192s' nie może być null"

# ER_BAD_DB_ERROR 42000
source: "Unknown database '%-.192s'"
pol: "Nieznana baza danych '%-.192s'"

# ER_TABLE_EXISTS_ERROR 42S01
source: "Table '%-.192s' already exists"
pol: "Tabela '%-.192s' już istnieje"

# ER_BAD_TABLE_ERROR 42S02
source: "Unknown table '%-.100T'"
pol: "Nieznana tabela '%-.100T'"

# ER_NON_UNIQ_ERROR 23000
source: "Column '%-.192s' in %-.192s is ambiguous"
pol: "Kolumna: '%-.192s' w %-.192s jest dwuznaczna"

# ER_SERVER_SHUTDOWN 08S01
source: "Server shutdown in progress"
pol: "Trwa kończenie działania serwera"

# ER_BAD_FIELD_ERROR 42S22 S0022
source: "Unknown column '%-.192s' in '%-.192s'"
pol: "Nieznana kolumna '%-.192s' w %-.192s"

# ER_WRONG_FIELD_WITH_GROUP 42000 S1009
source: "'%-.192s' isn't in GROUP BY"
pol: "Użyto '%-.192s' bez umieszczenia w group by"

# ER_WRONG_GROUP_FIELD 42000 S1009
source: "Can't group on '%-.192s'"
pol: "Nie można grupować po '%-.192s'"

# ER_WRONG_SUM_SELECT 42000 S1009
source: "Statement has sum functions and columns in same statement"
pol: "Zapytanie ma funkcje sumuj?ce i kolumny w tym samym zapytaniu"

# ER_WRONG_VALUE_COUNT 21S01
source: "Column count doesn't match value count"
pol: "Liczba kolumn nie odpowiada liczbie warto?ci"

# ER_TOO_LONG_IDENT 42000 S1009
source: "Identifier name '%-.100T' is too long"
pol: "Nazwa identyfikatora '%-.100T' jest zbyt długa"

# ER_DUP_FIELDNAME 42S21 S1009
source: "Duplicate column name '%-.192s'"
pol: "Powtórzona nazwa kolumny '%-.192s'"

# ER_DUP_KEYNAME 42000 S1009
source: "Duplicate key name '%-.192s'"
pol: "Powtórzony nazwa klucza '%-.192s'"

# ER_DUP_ENTRY 23000 S1009
source: "Duplicate entry '%-.192T' for key %d"
pol: "Powtórzone wystąpienie '%-.192T' dla klucza %d"

# ER_WRONG_FIELD_SPEC 42000 S1009
source: "Incorrect column specifier for column '%-.192s'"
pol: "Błędna specyfikacja kolumny dla kolumny '%-.192s'"

# ER_PARSE_ERROR 42000 s1009
source: "%s near '%-.80T' at line %d"
pol: "%s obok '%-.80T' w linii %d"

# ER_EMPTY_QUERY 42000
source: "Query was empty"
pol: "Zapytanie było puste"

# ER_NONUNIQ_TABLE 42000 S1009
source: "Not unique table/alias: '%-.192s'"
pol: "Tabela/alias nie s? unikalne: '%-.192s'"

# ER_INVALID_DEFAULT 42000 S1009
source: "Invalid default value for '%-.192s'"
pol: "Niewła?ciwa warto?ć domy?lna dla '%-.192s'"

# ER_MULTIPLE_PRI_KEY 42000 S1009
source: "Multiple primary key defined"
pol: "Zdefiniowano wiele kluczy podstawowych"

# ER_TOO_MANY_KEYS 42000 S1009
source: "Too many keys specified; max %d keys allowed"
pol: "Okre?lono zbyt wiele kluczy. Dostępnych jest maksymalnie %d kluczy"

# ER_TOO_MANY_KEY_PARTS 42000 S1009
source: "Too many key parts specified; max %d parts allowed"
pol: "Okre?lono zbyt wiele czę?ci klucza. Dostępnych jest maksymalnie %d czę?ci"

# ER_TOO_LONG_KEY 42000 S1009
source: "Specified key was too long; max key length is %d bytes"
pol: "Zdefinowany klucz jest zbyt długi. Maksymaln? długo?ci? klucza jest %d"

# ER_KEY_COLUMN_DOES_NOT_EXIST 42000 S1009
source: "Key column '%-.192s' doesn't exist in table"
pol: "Kolumna '%-.192s' zdefiniowana w kluczu nie istnieje w tabeli"

# ER_TOO_BIG_FIELDLENGTH 42000 S1009
source: "Column length too big for column '%-.192s' (max = %lu); use BLOB or TEXT instead"
pol: "Zbyt duża długo?ć kolumny '%-.192s' (maks. = %lu). W zamian użyj typu BLOB"

# ER_WRONG_AUTO_KEY 42000 S1009
source: "Incorrect table definition; there can be only one auto column and it must be defined as a key"
pol: "W tabeli może być tylko jedno pole auto i musi ono być zdefiniowane jako klucz"

# ER_NORMAL_SHUTDOWN
source: "%s (initiated by: %s): Normal shutdown"
pol: "%s (%s): Standardowe zakończenie działania"

# ER_GOT_SIGNAL
source: "%s: Got signal %d. Aborting!\n"
pol: "%s: Otrzymano sygnał %d. Kończenie działania!\n"

# ER_SHUTDOWN_COMPLETE
source: "%s: Shutdown complete\n"
pol: "%s: Zakończenie działania wykonane\n"

# ER_FORCING_CLOSE 08S01
source: "%s: Forcing close of thread %ld user: '%-.48s'\n"
pol: "%s: Wymuszenie zamknięcia w?tku %ld użytkownik: '%-.48s'\n"

# ER_IPSOCK_ERROR 08S01
source: "Can't create IP socket"
pol: "Nie można stworzyć socket'u IP"

# ER_NO_SUCH_INDEX 42S12 S1009
source: "Table '%-.192s' has no index like the one used in CREATE INDEX; recreate the table"
pol: "Tabela '%-.192s' nie ma indeksu takiego jak w CREATE INDEX. Stwórz tabelę"

# ER_WRONG_FIELD_TERMINATORS 42000 S1009
source: "Field separator argument is not what is expected; check the manual"
pol: "Nie oczekiwano separatora. SprawdĽ podręcznik"

# ER_BLOBS_AND_NO_TERMINATED 42000 S1009
source: "You can't use fixed rowlength with BLOBs; please use 'fields terminated by'"
pol: "Nie można użyć stałej długo?ci wiersza z polami typu BLOB. Użyj 'fields terminated by'"

# ER_TEXTFILE_NOT_READABLE
source: "The file '%-.128s' must be in the database directory or be readable by all"
pol: "Plik '%-.128s' musi znajdować sie w katalogu bazy danych lub mieć prawa czytania przez wszystkich"

# ER_FILE_EXISTS_ERROR
source: "File '%-.200s' already exists"
pol: "Plik '%-.200s' już istnieje"

# ER_LOAD_INFO
source: "Records: %ld Deleted: %ld Skipped: %ld Warnings: %ld"
pol: "Recordów: %ld Usuniętych: %ld Pominiętych: %ld Ostrzeżeń: %ld"

# ER_ALTER_INFO
source: "Records: %ld Duplicates: %ld"
pol: "Rekordów: %ld Duplikatów: %ld"

# ER_WRONG_SUB_KEY
source: "Incorrect prefix key; the used key part isn't a string, the used length is longer than the key part, or the storage engine doesn't support unique prefix keys"
pol: "Błędna podczę?ć klucza. Użyta czę?ć klucza nie jest łańcuchem lub użyta długo?ć jest większa niż czę?ć klucza"

# ER_CANT_REMOVE_ALL_FIELDS 42000
source: "You can't delete all columns with ALTER TABLE; use DROP TABLE instead"
pol: "Nie można usun?ć wszystkich pól wykorzystuj?c ALTER TABLE. W zamian użyj DROP TABLE"

# ER_CANT_DROP_FIELD_OR_KEY 42000
source: "Can't DROP %s %`-.192s; check that it exists"
pol: "Nie można wykonać operacji DROP %s %`-.192s. SprawdĽ, czy to pole/klucz istnieje"

# ER_INSERT_INFO
source: "Records: %ld Duplicates: %ld Warnings: %ld"
pol: "Rekordów: %ld Duplikatów: %ld Ostrzeżeń: %ld"

# ER_NO_SUCH_THREAD
source: "Unknown thread id: %lu"
pol: "Nieznany identyfikator w?tku: %lu"

# ER_KILL_DENIED_ERROR
source: "You are not owner of thread %lld"
pol: "Nie jeste? wła?cicielem w?tku %lld"

# ER_NO_TABLES_USED
source: "No tables used"
pol: "Nie ma żadej użytej tabeli"

# ER_TOO_BIG_SET
source: "Too many strings for column %-.192s and SET"
pol: "Zbyt wiele łańcuchów dla kolumny %-.192s i polecenia SET"

# ER_NO_UNIQUE_LOGFILE
source: "Can't generate a unique log-filename %-.200s.(1-999)\n"
pol: "Nie można stworzyć unikalnej nazwy pliku z logiem %-.200s.(1-999)\n"

# ER_TABLE_NOT_LOCKED_FOR_WRITE
source: "Table '%-.192s' was locked with a READ lock and can't be updated"
pol: "Tabela '%-.192s' została zablokowana przez READ i nie może zostać zaktualizowana"

# ER_TABLE_NOT_LOCKED
source: "Table '%-.192s' was not locked with LOCK TABLES"
pol: "Tabela '%-.192s' nie została zablokowana poleceniem LOCK TABLES"

# ER_WRONG_DB_NAME 42000
source: "Incorrect database name '%-.100T'"
pol: "Niedozwolona nazwa bazy danych '%-.100T'"

# ER_WRONG_TABLE_NAME 42000
source: "Incorrect table name '%-.100s'"
pol: "Niedozwolona nazwa tabeli '%-.100s'..."

# ER_TOO_BIG_SELECT 42000
source: "The SELECT would examine more than MAX_JOIN_SIZE rows; check your WHERE and use SET SQL_BIG_SELECTS=1 or SET MAX_JOIN_SIZE=# if the SELECT is okay"
pol: "Operacja SELECT będzie dotyczyła zbyt wielu rekordów i prawdopodobnie zajmie bardzo dużo czasu. SprawdĽ warunek WHERE i użyj SQL_OPTION BIG_SELECTS=1 je?li operacja SELECT jest poprawna"

# ER_UNKNOWN_PROCEDURE 42000
source: "Unknown procedure '%-.192s'"
pol: "Unkown procedure %-.192s"

# ER_FIELD_SPECIFIED_TWICE 42000
source: "Column '%-.192s' specified twice"
pol: "Field '%-.192s' specified twice"

# ER_UNSUPPORTED_EXTENSION 42000
source: "Table '%-.192s' uses an extension that doesn't exist in this MariaDB version"
pol: "Table '%-.192s' uses a extension that doesn't exist in this MariaDB version"

# ER_CANT_CREATE_THREAD
source: "Can't create a new thread (errno %M); if you are not out of available memory, you can consult the manual for a possible OS-dependent bug"
pol: "Can't create a new thread (errno %M); if you are not out of available memory you can consult the manual for any possible OS dependent bug"

# ER_ILLEGAL_GRANT_FOR_TABLE 42000
source: "Illegal GRANT/REVOKE command; please consult the manual to see which privileges can be used"
pol: "Illegal GRANT/REVOKE command; please consult the manual to see which privleges can be used"

# ER_SYNTAX_ERROR 42000
source: "You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use"
pol: "Something is wrong in your syntax"

# ER_WRONG_MRG_TABLE
source: "Unable to open underlying table which is differently defined or of non-MyISAM type or doesn't exist"
pol: "All tables in the MERGE table are not defined identically"

# ER_BLOB_KEY_WITHOUT_LENGTH 42000
source: "BLOB/TEXT column '%-.192s' used in key specification without a key length"
pol: "BLOB column '%-.192s' used in key specification without a key length"

# ER_CHECK_NOT_IMPLEMENTED 42000
source: "The storage engine for the table doesn't support %s"
pol: "The handler for the table doesn't support %s"

# ER_DUP_ENTRY_WITH_KEY_NAME 23000 S1009
source: "Duplicate entry '%-.64T' for key '%-.192s'"
pol: "Powtórzone wystąpienie '%-.64T' dla klucza '%-.192s'"

# ER_DUP_UNKNOWN_IN_INDEX 23000
source: "Duplicate entry for key '%-.192s'"
pol: "Powtórzone wystąpienie dla klucza '%-.192s'"
