Repository: vladbogo/test-translation
Catalog: por.xlf
Languages: por

# ER_WRONG_MRG_TABLE
source: "Unable to open underlying table which is differently defined or of non-MyISAM type or doesn't exist"
por: "Todas as tabelas contidas na tabela fundida (MERGE) não estão definidas identicamente"

# ER_DUP_UNIQUE 23000
source: "Can't write, because of unique constraint, to table '%-.192s'"
por: "Não pode gravar, devido à restrição UNIQUE, na tabela '%-.192s'"

# ER_BLOB_KEY_WITHOUT_LENGTH 42000
source: "BLOB/TEXT column '%-.192s' used in key specification without a key length"
por: "Coluna BLOB '%-.192s' usada na especificação de chave sem o comprimento da chave"

# ER_PRIMARY_CANT_HAVE_NULL 42000
source: "All parts of a PRIMARY KEY must be NOT NULL; if you need NULL in a key, use UNIQUE instead"
por: "Todas as partes de uma chave primária devem ser não-nulas. Se você precisou usar um valor nulo (NULL) em uma chave, use a cláusula UNIQUE em seu lugar"

# ER_TOO_MANY_ROWS 42000
source: "Result consisted of more than one row"
por: "O resultado consistiu em mais do que uma linha"

# ER_REQUIRES_PRIMARY_KEY 42000
source: "This table type requires a primary key"
por: "Este tipo de tabela requer uma chave primária"

# ER_NO_RAID_COMPILED
source: "This version of MariaDB is not compiled with RAID support"
por: "Esta versão do MariaDB não foi compilada com suporte a RAID"

# ER_UPDATE_WITHOUT_KEY_IN_SAFE_MODE
source: "You are using safe update mode and you tried to update a table without a WHERE that uses a KEY column"
por: "Você está usando modo de atualização seguro e tentou atualizar uma tabela sem uma cláusula WHERE que use uma coluna chave"

# ER_KEY_DOES_NOT_EXISTS 42000 S1009
source: "Key '%-.192s' doesn't exist in table '%-.192s'"
por: "Chave '%-.192s' não existe na tabela '%-.192s'"

# ER_CHECK_NO_SUCH_TABLE 42000
source: "Can't open table"
por: "Não pode abrir a tabela"

# ER_CHECK_NOT_IMPLEMENTED 42000
source: "The storage engine for the table doesn't support %s"
por: "O manipulador de tabela não suporta %s"

# ER_CANT_DO_THIS_DURING_AN_TRANSACTION 25000
source: "You are not allowed to execute this command in a transaction"
por: "Não lhe é permitido executar este comando em uma transação"

# ER_ERROR_DURING_COMMIT
source: "Got error %M during COMMIT"
por: "Obteve erro %M durante COMMIT"

# ER_ERROR_DURING_ROLLBACK
source: "Got error %M during ROLLBACK"
por: "Obteve erro %M durante ROLLBACK"

# ER_ERROR_DURING_FLUSH_LOGS
source: "Got error %M during FLUSH_LOGS"
por: "Obteve erro %M durante FLUSH_LOGS"

# ER_ERROR_DURING_CHECKPOINT
source: "Got error %M during CHECKPOINT"
por: "Obteve erro %M durante CHECKPOINT"

# ER_NEW_ABORTING_CONNECTION 08S01
source: "Aborted connection %lld to db: '%-.192s' user: '%-.48s' host: '%-.64s' (%-.64s)"
por: "Conexão %lld abortada para banco de dados '%-.192s' - usuário '%-.48s' - 'host' '%-.64s' ('%-.64s')"

# ER_FLUSH_MASTER_BINLOG_CLOSED
source: "Binlog closed, cannot RESET MASTER"
por: "Binlog fechado. Não pode fazer RESET MASTER"

# ER_INDEX_REBUILD
source: "Failed rebuilding the index of dumped table '%-.192s'"
por: "Falhou na reconstrução do índice da tabela 'dumped' '%-.192s'"

# ER_MASTER
source: "Error from master: '%-.64s'"
por: "Erro no 'master' '%-.64s'"

# ER_MASTER_NET_READ 08S01
source: "Net error reading from master"
por: "Erro de rede lendo do 'master'"

# ER_MASTER_NET_WRITE 08S01
source: "Net error writing to master"
por: "Erro de rede gravando no 'master'"

# ER_FT_MATCHING_KEY_NOT_FOUND
source: "Can't find FULLTEXT index matching the column list"
por: "Não pode encontrar um índice para o texto todo que combine com a lista de colunas"

# ER_LOCK_OR_ACTIVE_TRANSACTION
source: "Can't execute the given command because you have active locked tables or an active transaction"
por: "Não pode executar o comando dado porque você tem tabelas ativas travadas ou uma transação ativa"

# ER_UNKNOWN_SYSTEM_VARIABLE
source: "Unknown system variable '%-.*s'"
por: "Variável de sistema '%-.*s' desconhecida"

# ER_CRASHED_ON_USAGE
source: "Table '%-.192s' is marked as crashed and should be repaired"
por: "Tabela '%-.192s' está marcada como danificada e deve ser reparada"

# ER_CRASHED_ON_REPAIR
source: "Table '%-.192s' is marked as crashed and last (automatic?) repair failed"
por: "Tabela '%-.192s' está marcada como danificada e a última reparação (automática?) falhou"

# ER_WARNING_NOT_COMPLETE_ROLLBACK
source: "Some non-transactional changed tables couldn't be rolled back"
por: "Aviso: Algumas tabelas não-transacionais alteradas não puderam ser reconstituídas (rolled back)"

# ER_TRANS_CACHE_FULL
source: "Multi-statement transaction required more than 'max_binlog_cache_size' bytes of storage; increase this mariadbd variable and try again"
por: "Transações multi-declaradas (multi-statement transactions) requeriram mais do que o valor limite (max_binlog_cache_size) de bytes para armazenagem. Aumente o valor desta variável do mariadbd e tente novamente"

# ER_SLAVE_MUST_STOP
source: "This operation cannot be performed as you have a running slave '%2$*1$s'; run STOP SLAVE '%2$*1$s' first"
por: "Esta operação não pode ser realizada com um 'slave' '%2$*1$s' em execução. Execute STOP SLAVE '%2$*1$s' primeiro"

# ER_SLAVE_NOT_RUNNING
source: "This operation requires a running slave; configure slave and do START SLAVE"
por: "Esta operação requer um 'slave' em execução. Configure o 'slave' e execute START SLAVE"

# ER_BAD_SLAVE
source: "The server is not configured as slave; fix in config file or with CHANGE MASTER TO"
por: "O servidor não está configurado como 'slave'. Acerte o arquivo de configuração ou use CHANGE MASTER TO"

# ER_SLAVE_THREAD
source: "Could not create slave thread; check system resources"
por: "Não conseguiu criar 'thread' de 'slave'. Verifique os recursos do sistema"

# ER_TOO_MANY_USER_CONNECTIONS 42000
source: "User %-.64s already has more than 'max_user_connections' active connections"
por: "Usuário '%-.64s' já possui mais que o valor máximo de conexões (max_user_connections) ativas"

# ER_SET_CONSTANTS_ONLY
source: "You may only use constant expressions in this statement"
por: "Você pode usar apenas expressões constantes com SET"

# ER_LOCK_WAIT_TIMEOUT
source: "Lock wait timeout exceeded; try restarting transaction"
por: "Tempo de espera (timeout) de travamento excedido. Tente reiniciar a transação"

# ER_LOCK_TABLE_FULL
source: "The total number of locks exceeds the lock table size"
por: "O número total de travamentos excede o tamanho da tabela de travamentos"

# ER_READ_ONLY_TRANSACTION 25000
source: "Update locks cannot be acquired during a READ UNCOMMITTED transaction"
por: "Travamentos de atualização não podem ser obtidos durante uma transação de tipo READ UNCOMMITTED"

# ER_DROP_DB_WITH_READ_LOCK
source: "DROP DATABASE not allowed while thread is holding global read lock"
por: "DROP DATABASE não permitido enquanto uma 'thread' está mantendo um travamento global de leitura"

# ER_CREATE_DB_WITH_READ_LOCK
source: "CREATE DATABASE not allowed while thread is holding global read lock"
por: "CREATE DATABASE não permitido enquanto uma 'thread' está mantendo um travamento global de leitura"

# ER_WRONG_ARGUMENTS
source: "Incorrect arguments to %s"
por: "Argumentos errados para %s"

# ER_NO_PERMISSION_TO_CREATE_USER 42000
source: "'%s'@'%s' is not allowed to create new users"
por: "Não é permitido a '%s'@'%s' criar novos usuários"

# ER_UNION_TABLES_IN_DIFFERENT_DIR
source: "Incorrect table definition; all MERGE tables must be in the same database"
por: "Definição incorreta da tabela. Todas as tabelas contidas na junção devem estar no mesmo banco de dados"

# ER_LOCK_DEADLOCK 40001
source: "Deadlock found when trying to get lock; try restarting transaction"
por: "Encontrado um travamento fatal (deadlock) quando tentava obter uma trava. Tente reiniciar a transação"

# ER_TABLE_CANT_HANDLE_FT
source: "The storage engine %s doesn't support FULLTEXT indexes"
por: "O tipo de tabela utilizado (%s) não suporta índices de texto completo (fulltext indexes)"

# ER_CANNOT_ADD_FOREIGN
source: "Cannot add foreign key constraint for `%s`"
por: "Não pode acrescentar uma restrição de chave estrangeira para `%s`"

# ER_NO_REFERENCED_ROW 23000
source: "Cannot add or update a child row: a foreign key constraint fails"
por: "Não pode acrescentar uma linha filha: uma restrição de chave estrangeira falhou"

# ER_ROW_IS_REFERENCED 23000
source: "Cannot delete or update a parent row: a foreign key constraint fails"
por: "Não pode apagar uma linha pai: uma restrição de chave estrangeira falhou"

# ER_CONNECT_TO_MASTER 08S01
source: "Error connecting to master: %-.128s"
por: "Erro conectando com o master: %-.128s"

# ER_QUERY_ON_MASTER
source: "Error running query on master: %-.128s"
por: "Erro rodando consulta no master: %-.128s"

# ER_ERROR_WHEN_EXECUTING_COMMAND
source: "Error when executing command %s: %-.128s"
por: "Erro quando executando comando %s: %-.128s"

# ER_WRONG_USAGE
source: "Incorrect usage of %s and %s"
por: "Uso errado de %s e %s"

# ER_WRONG_NUMBER_OF_COLUMNS_IN_SELECT 21000
source: "The used SELECT statements have a different number of columns"
por: "Os comandos SELECT usados têm diferente número de colunas"

# ER_CANT_UPDATE_WITH_READLOCK
source: "Can't execute the query because you have a conflicting read lock"
por: "Não posso executar a consulta porque você tem um conflito de travamento de leitura"

# ER_MIXING_NOT_ALLOWED
source: "Mixing of transactional and non-transactional tables is disabled"
por: "Mistura de tabelas transacional e não-transacional está desabilitada"

# ER_DUP_ARGUMENT
source: "Option '%s' used twice in statement"
por: "Opção '%s' usada duas vezes no comando"

# ER_USER_LIMIT_REACHED 42000
source: "User '%-.64s' has exceeded the '%s' resource (current value: %ld)"
por: "Usuário '%-.64s' tem excedido o '%s' recurso (atual valor: %ld)"

# ER_SPECIFIC_ACCESS_DENIED_ERROR 42000
source: "Access denied; you need (at least one of) the %-.128s privilege(s) for this operation"
por: "Acesso negado. Você precisa o privilégio %-.128s para essa operação"

# ER_LOCAL_VARIABLE
source: "Variable '%-.64s' is a SESSION variable and can't be used with SET GLOBAL"
por: "Variável '%-.64s' é uma SESSION variável e não pode ser usada com SET GLOBAL"

# ER_GLOBAL_VARIABLE
source: "Variable '%-.64s' is a GLOBAL variable and should be set with SET GLOBAL"
por: "Variável '%-.64s' é uma GLOBAL variável e deve ser configurada com SET GLOBAL"

# ER_NO_DEFAULT 42000
source: "Variable '%-.64s' doesn't have a default value"
por: "Variável '%-.64s' não tem um valor padrão"

# ER_WRONG_VALUE_FOR_VAR 42000
source: "Variable '%-.64s' can't be set to the value of '%-.200T'"
por: "Variável '%-.64s' não pode ser configurada para o valor de '%-.200T'"

# ER_WRONG_TYPE_FOR_VAR 42000
source: "Incorrect argument type to variable '%-.64s'"
por: "Tipo errado de argumento para variável '%-.64s'"

# ER_VAR_CANT_BE_READ
source: "Variable '%-.64s' can only be set, not read"
por: "Variável '%-.64s' somente pode ser configurada, não lida"

# ER_CANT_USE_OPTION_HERE 42000
source: "Incorrect usage/placement of '%s'"
por: "Errado uso/colocação de '%s'"

# ER_NOT_SUPPORTED_YET 42000
source: "This version of MariaDB doesn't yet support '%s'"
por: "Esta versão de MariaDB não suporta ainda '%s'"

# ER_MASTER_FATAL_ERROR_READING_BINLOG
source: "Got fatal error %d from master when reading data from binary log: '%-.320s'"
por: "Obteve fatal erro %d: '%-.320s' do master quando lendo dados do binary log"

# ER_SLAVE_IGNORED_TABLE
source: "Slave SQL thread ignored the query because of replicate-*-table rules"
por: "Slave SQL thread ignorado a consulta devido às normas de replicação-*-tabela"

# ER_WRONG_FK_DEF 42000
source: "Incorrect foreign key definition for '%-.192s': %s"
por: "Definição errada da chave estrangeira para '%-.192s': %s"

# ER_KEY_REF_DO_NOT_MATCH_TABLE_REF
source: "Key reference and table reference don't match"
por: "Referência da chave e referência da tabela não coincidem"

# ER_SUBQUERY_NO_1_ROW 21000
source: "Subquery returns more than 1 row"
por: "Subconsulta retorna mais que 1 registro"

# ER_UNKNOWN_STMT_HANDLER
source: "Unknown prepared statement handler (%.*s) given to %s"
por: "Desconhecido manipulador de declaração preparado (%.*s) determinado para %s"

# ER_CORRUPT_HELP_DB
source: "Help database is corrupt or does not exist"
por: "Banco de dado de ajuda corrupto ou não existente"

# ER_CYCLIC_REFERENCE
source: "Cyclic reference on subqueries"
por: "Referência cíclica em subconsultas"

# ER_AUTO_CONVERT
source: "Converting column '%s' from %s to %s"
por: "Convertendo coluna '%s' de %s para %s"

# ER_ILLEGAL_REFERENCE 42S22
source: "Reference '%-.64s' not supported (%s)"
por: "Referência '%-.64s' não suportada (%s)"

# ER_DERIVED_MUST_HAVE_ALIAS 42000
source: "Every derived table must have its own alias"
por: "Cada tabela derivada deve ter seu próprio alias"

# ER_SELECT_REDUCED 01000
source: "Select %u was reduced during optimization"
por: "Select %u foi reduzido durante otimização"

# ER_TABLENAME_NOT_ALLOWED_HERE 42000
source: "Table '%-.192s' from one of the SELECTs cannot be used in %-.32s"
por: "Tabela '%-.192s' de um dos SELECTs não pode ser usada em %-.32s"

# ER_NOT_SUPPORTED_AUTH_MODE 08004
source: "Client does not support authentication protocol requested by server; consider upgrading MariaDB client"
por: "Cliente não suporta o protocolo de autenticação exigido pelo servidor; considere a atualização do cliente MariaDB"

# ER_SPATIAL_CANT_HAVE_NULL 42000
source: "All parts of a SPATIAL index must be NOT NULL"
por: "Todas as partes de uma SPATIAL index devem ser NOT NULL"

# ER_COLLATION_CHARSET_MISMATCH 42000
source: "COLLATION '%s' is not valid for CHARACTER SET '%s'"
por: "COLLATION '%s' não é válida para CHARACTER SET '%s'"

# ER_SLAVE_WAS_RUNNING
source: "Slave is already running"
por: "O slave já está rodando"

# ER_SLAVE_WAS_NOT_RUNNING
source: "Slave already has been stopped"
por: "O slave já está parado"

# ER_TOO_BIG_FOR_UNCOMPRESS
source: "Uncompressed data size too large; the maximum size is %d (probably, length of uncompressed data was corrupted)"
por: "Tamanho muito grande dos dados des comprimidos. O máximo tamanho é %d. (provavelmente, o comprimento dos dados descomprimidos está corrupto)"

# ER_ZLIB_Z_MEM_ERROR
source: "ZLIB: Not enough memory"
por: "ZLIB: Não suficiente memória disponível"

# ER_ZLIB_Z_BUF_ERROR
source: "ZLIB: Not enough room in the output buffer (probably, length of uncompressed data was corrupted)"
por: "ZLIB: Não suficiente espaço no buffer emissor (provavelmente, o comprimento dos dados descomprimidos está corrupto)"

# ER_ZLIB_Z_DATA_ERROR
source: "ZLIB: Input data corrupted"
por: "ZLIB: Dados de entrada está corrupto"

# ER_WARN_TOO_FEW_RECORDS 01000
source: "Row %lu doesn't contain data for all columns"
por: "Conta de registro é menor que a conta de coluna na linha %lu"

# ER_WARN_TOO_MANY_RECORDS 01000
source: "Row %lu was truncated; it contained more data than there were input columns"
por: "Conta de registro é maior que a conta de coluna na linha %lu"

# ER_WARN_NULL_TO_NOTNULL 22004
source: "Column set to default value; NULL supplied to NOT NULL column '%s' at row %lu"
por: "Dado truncado, NULL fornecido para NOT NULL coluna '%s' na linha %lu"

# WARN_DATA_TRUNCATED 01000
source: "Data truncated for column '%s' at row %lu"
por: "Dado truncado para coluna '%s' na linha %lu"

# ER_WARN_USING_OTHER_HANDLER
source: "Using storage engine %s for table '%s'"
por: "Usando engine de armazenamento %s para tabela '%s'"

# ER_CANT_AGGREGATE_2COLLATIONS
source: "Illegal mix of collations (%s,%s) and (%s,%s) for operation '%s'"
por: "Combinação ilegal de collations (%s,%s) e (%s,%s) para operação '%s'"

# ER_REVOKE_GRANTS
source: "Can't revoke all privileges for one or more of the requested users"
por: "Não pode revocar todos os privilégios, grant para um ou mais dos usuários pedidos"

# ER_CANT_AGGREGATE_3COLLATIONS
source: "Illegal mix of collations (%s,%s), (%s,%s), (%s,%s) for operation '%s'"
por: "Ilegal combinação de collations (%s,%s), (%s,%s), (%s,%s) para operação '%s'"

# ER_CANT_AGGREGATE_NCOLLATIONS
source: "Illegal mix of collations for operation '%s'"
por: "Ilegal combinação de collations para operação '%s'"

# ER_VARIABLE_IS_NOT_STRUCT
source: "Variable '%-.64s' is not a variable component (can't be used as XXXX.variable_name)"
por: "Variável '%-.64s' não é uma variável componente (Não pode ser usada como XXXX.variável_nome)"

# ER_UNKNOWN_COLLATION
source: "Unknown collation: '%-.64s'"
por: "Collation desconhecida: '%-.64s'"

# ER_SLAVE_IGNORED_SSL_PARAMS
source: "SSL parameters in CHANGE MASTER are ignored because this MariaDB slave was compiled without SSL support; they can be used later if MariaDB slave with SSL is started"
por: "SSL parâmetros em CHANGE MASTER são ignorados porque este escravo MariaDB foi compilado sem o SSL suporte. Os mesmos podem ser usados mais tarde quando o escravo MariaDB com SSL seja iniciado."

# ER_SERVER_IS_IN_SECURE_AUTH_MODE
source: "Server is running in --secure-auth mode, but '%s'@'%s' has a password in the old format; please change the password to the new format"
por: "Servidor está rodando em --secure-auth modo, porêm '%s'@'%s' tem senha no formato antigo; por favor troque a senha para o novo formato"

# ER_WARN_FIELD_RESOLVED
source: "Field or reference '%-.192s%s%-.192s%s%-.192s' of SELECT #%d was resolved in SELECT #%d"
por: "Campo ou referência '%-.192s%s%-.192s%s%-.192s' de SELECT #%d foi resolvido em SELECT #%d"

# ER_BAD_SLAVE_UNTIL_COND
source: "Incorrect parameter or combination of parameters for START SLAVE UNTIL"
por: "Parâmetro ou combinação de parâmetros errado para START SLAVE UNTIL"

# ER_MISSING_SKIP_SLAVE
source: "It is recommended to use --skip-slave-start when doing step-by-step replication with START SLAVE UNTIL; otherwise, you will get problems if you get an unexpected slave's mariadbd restart"
por: "É recomendado para rodar com --skip-slave-start quando fazendo replicação passo-por-passo com START SLAVE UNTIL, de outra forma você não está seguro em caso de inesperada reinicialição do mariadbd escravo"

# ER_UNTIL_COND_IGNORED
source: "SQL thread is not to be started so UNTIL options are ignored"
por: "Thread SQL não pode ser inicializado tal que opções UNTIL são ignoradas"

# ER_WRONG_NAME_FOR_INDEX 42000
source: "Incorrect index name '%-.100s'"
por: "Incorreto nome de índice '%-.100s'"

# ER_WRONG_NAME_FOR_CATALOG 42000
source: "Incorrect catalog name '%-.100s'"
por: "Incorreto nome de catálogo '%-.100s'"

# ER_WARN_QC_RESIZE
source: "Query cache failed to set size %llu; new query cache size is %lu"
por: "Falha em Query cache para configurar tamanho %llu, novo tamanho de query cache é %lu"

# ER_BAD_FT_COLUMN
source: "Column '%-.192s' cannot be part of FULLTEXT index"
por: "Coluna '%-.192s' não pode ser parte de índice FULLTEXT"

# ER_UNKNOWN_KEY_CACHE
source: "Unknown key cache '%-.100s'"
por: "Key cache desconhecida '%-.100s'"

# ER_WARN_HOSTNAME_WONT_WORK
source: "MariaDB is started in --skip-name-resolve mode; you must restart it without this switch for this grant to work"
por: "MariaDB foi inicializado em modo --skip-name-resolve. Você necesita reincializá-lo sem esta opção para este grant funcionar"

# ER_UNKNOWN_STORAGE_ENGINE 42000
source: "Unknown storage engine '%s'"
por: "Motor de tabela desconhecido '%s'"

# ER_WARN_DEPRECATED_SYNTAX
source: "'%s' is deprecated and will be removed in a future release. Please use %s instead"
por: "'%s' é desatualizado. Use '%s' em seu lugar"

# ER_NON_UPDATABLE_TABLE
source: "The target table %-.100s of the %s is not updatable"
por: "A tabela destino %-.100s do %s não é atualizável"

# ER_FEATURE_DISABLED
source: "The '%s' feature is disabled; you need MariaDB built with '%s' to have it working"
por: "O recurso '%s' foi desativado; você necessita MariaDB construído com '%s' para ter isto funcionando"

# ER_OPTION_PREVENTS_STATEMENT
source: "The MariaDB server is running with the %s option so it cannot execute this statement"
por: "O servidor MariaDB está rodando com a opção %s razão pela qual não pode executar esse commando"

# ER_DUPLICATED_VALUE_IN_TYPE
source: "Column '%-.100s' has duplicated value '%-.64s' in %s"
por: "Coluna '%-.100s' tem valor duplicado '%-.64s' em %s"

# ER_TRUNCATED_WRONG_VALUE 22007
source: "Truncated incorrect %-.32T value: '%-.128T'"
por: "Truncado errado %-.32T valor: '%-.128T'"

# ER_TOO_MUCH_AUTO_TIMESTAMP_COLS
source: "Incorrect table definition; there can be only one TIMESTAMP column with CURRENT_TIMESTAMP in DEFAULT or ON UPDATE clause"
por: "Incorreta definição de tabela; Pode ter somente uma coluna TIMESTAMP com CURRENT_TIMESTAMP em DEFAULT ou ON UPDATE cláusula"

# ER_INVALID_ON_UPDATE
source: "Invalid ON UPDATE clause for '%-.192s' column"
por: "Inválida cláusula ON UPDATE para campo '%-.192s'"

# ER_DUP_ENTRY_WITH_KEY_NAME 23000 S1009
source: "Duplicate entry '%-.64T' for key '%-.192s'"
por: "Entrada '%-.64T' duplicada para a chave '%-.192s'"

# ER_TOO_LONG_TABLE_COMMENT
source: "Comment for table '%-.64s' is too long (max = %u)"
por: "Comentário para a tabela '%-.64s' é longo demais (max = %u)"

# ER_TOO_LONG_FIELD_COMMENT
source: "Comment for field '%-.64s' is too long (max = %u)"
por: "Comentário para o campo '%-.64s' é longo demais (max = %u)"

# ER_ACCESS_DENIED_NO_PASSWORD_ERROR 28000
source: "Access denied for user '%s'@'%s'"
por: "Acesso negado para o usuário '%s'@'%s'"

# ER_DA_INVALID_CONDITION_NUMBER 35000
source: "Invalid condition number"
por: "Número de condição inválido"

# ER_DUP_UNKNOWN_IN_INDEX 23000
source: "Duplicate entry for key '%-.192s'"
por: "Entrada duplicada para a chave '%-.192s'"

# ER_SLAVE_IGNORED_SHARED_TABLE
source: "Slave SQL thread ignored the '%s' because table is shared"
por: "Slave SQL thread ignorado a consulta devido '%s'"
