Repository: vladbogo/test-translation
Catalog: por.xlf
Languages: por

# ER_NO
source: "NO"
por: "NÃO"

# ER_YES
source: "YES"
por: "SIM"

# ER_CANT_CREATE_FILE
source: "Can't create file '%-.200s' (errno: %M)"
por: "Não pode criar o arquivo '%-.200s' (erro no. %M)"

# ER_CANT_CREATE_TABLE
source: "Can't create table %`s.%`s (errno: %M)"
por: "Não pode criar a tabela %`s.%`s (erro no. %M)"

# ER_CANT_CREATE_DB
source: "Can't create database '%-.192s' (errno: %M)"
por: "Não pode criar o banco de dados '%-.192s' (erro no. %M)"

# ER_DB_CREATE_EXISTS
source: "Can't create database '%-.192s'; database exists"
por: "Não pode criar o banco de dados '%-.192s'; este banco de dados já existe"

# ER_DB_DROP_EXISTS
source: "Can't drop database '%-.192s'; database doesn't exist"
por: "Não pode eliminar o banco de dados '%-.192s'; este banco de dados não existe"

# ER_DB_DROP_DELETE
source: "Error dropping database (can't delete '%-.192s', errno: %M)"
por: "Erro ao eliminar banco de dados (não pode eliminar '%-.192s' - erro no. %M)"

# ER_DB_DROP_RMDIR
source: "Error dropping database (can't rmdir '%-.192s', errno: %M)"
por: "Erro ao eliminar banco de dados (não pode remover diretório '%-.192s' - erro no. %M)"

# ER_CANT_DELETE_FILE
source: "Error on delete of '%-.192s' (errno: %M)"
por: "Erro na remoção de '%-.192s' (erro no. %M)"

# ER_CANT_FIND_SYSTEM_REC
source: "Can't read record in system table"
por: "Não pode ler um registro numa tabela do sistema"

# ER_CANT_GET_STAT
source: "Can't get status of '%-.200s' (errno: %M)"
por: "Não pode obter o status de '%-.200s' (erro no. %M)"

# ER_CANT_GET_WD
source: "Can't get working directory (errno: %M)"
por: "Não pode obter o diretório corrente (erro no. %M)"

# ER_CANT_LOCK
source: "Can't lock file (errno: %M)"
por: "Não pode travar o arquivo (erro no. %M)"

# ER_CANT_OPEN_FILE
source: "Can't open file: '%-.200s' (errno: %M)"
por: "Não pode abrir o arquivo '%-.200s' (erro no. %M)"

# ER_FILE_NOT_FOUND
source: "Can't find file: '%-.200s' (errno: %M)"
por: "Não pode encontrar o arquivo '%-.200s' (erro no. %M)"

# ER_CANT_READ_DIR
source: "Can't read dir of '%-.192s' (errno: %M)"
por: "Não pode ler o diretório de '%-.192s' (erro no. %M)"

# ER_CANT_SET_WD
source: "Can't change dir to '%-.192s' (errno: %M)"
por: "Não pode mudar para o diretório '%-.192s' (erro no. %M)"

# ER_CHECKREAD
source: "Record has changed since last read in table '%-.192s'"
por: "Registro alterado desde a última leitura da tabela '%-.192s'"

# ER_DISK_FULL
source: "Disk full (%s); waiting for someone to free some space... (errno: %M)"
por: "Disco cheio (%s). Aguardando alguém liberar algum espaço... (erro no. %M)"

# ER_DUP_KEY 23000
source: "Can't write; duplicate key in table '%-.192s'"
por: "Não pode gravar. Chave duplicada na tabela '%-.192s'"

# ER_ERROR_ON_CLOSE
source: "Error on close of '%-.192s' (errno: %M)"
por: "Erro ao fechar '%-.192s' (erro no. %M)"

# ER_ERROR_ON_READ
source: "Error reading file '%-.200s' (errno: %M)"
por: "Erro ao ler arquivo '%-.200s' (erro no. %M)"

# ER_ERROR_ON_RENAME
source: "Error on rename of '%-.210s' to '%-.210s' (errno: %M)"
por: "Erro ao renomear '%-.210s' para '%-.210s' (erro no. %M)"

# ER_ERROR_ON_WRITE
source: "Error writing file '%-.200s' (errno: %M)"
por: "Erro ao gravar arquivo '%-.200s' (erro no. %M)"

# ER_FILE_USED
source: "'%-.192s' is locked against change"
por: "'%-.192s' está com travamento contra alterações"

# ER_FILSORT_ABORT
source: "Sort aborted"
por: "Ordenação abortada"

# ER_FORM_NOT_FOUND
source: "View '%-.192s' doesn't exist for '%-.192s'"
por: "Visão '%-.192s' não existe para '%-.192s'"

# ER_GET_ERRNO
source: "Got error %M from storage engine %s"
por: "Obteve erro %M no manipulador de tabelas %s"

# ER_KEY_NOT_FOUND
source: "Can't find record in '%-.192s'"
por: "Não pode encontrar registro em '%-.192s'"

# ER_NOT_FORM_FILE
source: "Incorrect information in file: '%-.200s'"
por: "Informação incorreta no arquivo '%-.200s'"

# ER_NOT_KEYFILE
source: "Index for table '%-.200s' is corrupt; try to repair it"
por: "Arquivo de índice incorreto para tabela '%-.200s'; tente repará-lo"

# ER_OLD_KEYFILE
source: "Old key file for table '%-.192s'; repair it!"
por: "Arquivo de índice desatualizado para tabela '%-.192s'; repare-o!"

# ER_OPEN_AS_READONLY
source: "Table '%-.192s' is read only"
por: "Tabela '%-.192s' é somente para leitura"

# ER_OUTOFMEMORY HY001 S1001
source: "Out of memory; restart server and try again (needed %d bytes)"
por: "Sem memória. Reinicie o programa e tente novamente (necessita de %d bytes)"

# ER_OUT_OF_SORTMEMORY HY001 S1001
source: "Out of sort memory, consider increasing server sort buffer size"
por: "Não há memória suficiente para ordenação. Considere aumentar o tamanho do retentor (buffer) de ordenação"

# ER_UNEXPECTED_EOF
source: "Unexpected EOF found when reading file '%-.192s' (errno: %M)"
por: "Encontrado fim de arquivo inesperado ao ler arquivo '%-.192s' (erro no. %M)"

# ER_CON_COUNT_ERROR 08004
source: "Too many connections"
por: "Excesso de conexões"

# ER_OUT_OF_RESOURCES
source: "Out of memory."
por: "Sem memória."

# ER_BAD_HOST_ERROR 08S01
source: "Can't get hostname for your address"
por: "Não pode obter nome do 'host' para seu endereço"

# ER_HANDSHAKE_ERROR 08S01
source: "Bad handshake"
por: "Negociação de acesso falhou"

# ER_DBACCESS_DENIED_ERROR 42000
source: "Access denied for user '%s'@'%s' to database '%-.192s'"
por: "Acesso negado para o usuário '%s'@'%s' ao banco de dados '%-.192s'"

# ER_ACCESS_DENIED_ERROR 28000
source: "Access denied for user '%s'@'%s' (using password: %s)"
por: "Acesso negado para o usuário '%s'@'%s' (senha usada: %s)"

# ER_NO_DB_ERROR 3D000
source: "No database selected"
por: "Nenhum banco de dados foi selecionado"

# ER_UNKNOWN_COM_ERROR 08S01
source: "Unknown command"
por: "Comando desconhecido"

# ER_BAD_NULL_ERROR 23000
source: "Column '%-.192s' cannot be null"
por: "Coluna '%-.192s' não pode ser vazia"

# ER_BAD_DB_ERROR 42000
source: "Unknown database '%-.192s'"
por: "Banco de dados '%-.192s' desconhecido"

# ER_TABLE_EXISTS_ERROR 42S01
source: "Table '%-.192s' already exists"
por: "Tabela '%-.192s' já existe"

# ER_BAD_TABLE_ERROR 42S02
source: "Unknown table '%-.100T'"
por: "Tabela '%-.100T' desconhecida"

# ER_NON_UNIQ_ERROR 23000
source: "Column '%-.192s' in %-.192s is ambiguous"
por: "Coluna '%-.192s' em '%-.192s' é ambígua"

# ER_SERVER_SHUTDOWN 08S01
source: "Server shutdown in progress"
por: "'Shutdown' do servidor em andamento"

# ER_BAD_FIELD_ERROR 42S22 S0022
source: "Unknown column '%-.192s' in '%-.192s'"
por: "Coluna '%-.192s' desconhecida em '%-.192s'"

# ER_WRONG_FIELD_WITH_GROUP 42000 S1009
source: "'%-.192s' isn't in GROUP BY"
por: "'%-.192s' não está em 'GROUP BY'"

# ER_WRONG_GROUP_FIELD 42000 S1009
source: "Can't group on '%-.192s'"
por: "Não pode agrupar em '%-.192s'"

# ER_WRONG_SUM_SELECT 42000 S1009
source: "Statement has sum functions and columns in same statement"
por: "Cláusula contém funções de soma e colunas juntas"

# ER_WRONG_VALUE_COUNT 21S01
source: "Column count doesn't match value count"
por: "Contagem de colunas não confere com a contagem de valores"

# ER_TOO_LONG_IDENT 42000 S1009
source: "Identifier name '%-.100T' is too long"
por: "Nome identificador '%-.100T' é longo demais"

# ER_DUP_FIELDNAME 42S21 S1009
source: "Duplicate column name '%-.192s'"
por: "Nome da coluna '%-.192s' duplicado"

# ER_DUP_KEYNAME 42000 S1009
source: "Duplicate key name '%-.192s'"
por: "Nome da chave '%-.192s' duplicado"

# ER_DUP_ENTRY 23000 S1009
source: "Duplicate entry '%-.192T' for key %d"
por: "Entrada '%-.192T' duplicada para a chave %d"

# ER_WRONG_FIELD_SPEC 42000 S1009
source: "Incorrect column specifier for column '%-.192s'"
por: "Especificador de coluna incorreto para a coluna '%-.192s'"

# ER_PARSE_ERROR 42000 s1009
source: "%s near '%-.80T' at line %d"
por: "%s próximo a '%-.80T' na linha %d"

# ER_EMPTY_QUERY 42000
source: "Query was empty"
por: "Consulta (query) estava vazia"

# ER_NONUNIQ_TABLE 42000 S1009
source: "Not unique table/alias: '%-.192s'"
por: "Tabela/alias '%-.192s' não única"

# ER_INVALID_DEFAULT 42000 S1009
source: "Invalid default value for '%-.192s'"
por: "Valor padrão (default) inválido para '%-.192s'"

# ER_MULTIPLE_PRI_KEY 42000 S1009
source: "Multiple primary key defined"
por: "Definida mais de uma chave primária"

# ER_TOO_MANY_KEYS 42000 S1009
source: "Too many keys specified; max %d keys allowed"
por: "Especificadas chaves demais. O máximo permitido são %d chaves"

# ER_TOO_MANY_KEY_PARTS 42000 S1009
source: "Too many key parts specified; max %d parts allowed"
por: "Especificadas partes de chave demais. O máximo permitido são %d partes"

# ER_TOO_LONG_KEY 42000 S1009
source: "Specified key was too long; max key length is %d bytes"
por: "Chave especificada longa demais. O comprimento de chave máximo permitido é %d"

# ER_KEY_COLUMN_DOES_NOT_EXIST 42000 S1009
source: "Key column '%-.192s' doesn't exist in table"
por: "Coluna chave '%-.192s' não existe na tabela"

# ER_TOO_BIG_FIELDLENGTH 42000 S1009
source: "Column length too big for column '%-.192s' (max = %lu); use BLOB or TEXT instead"
por: "Comprimento da coluna '%-.192s' grande demais (max = %lu); use BLOB em seu lugar"

# ER_WRONG_AUTO_KEY 42000 S1009
source: "Incorrect table definition; there can be only one auto column and it must be defined as a key"
por: "Definição incorreta de tabela. Somente é permitido um único campo auto-incrementado e ele tem que ser definido como chave"

# ER_NORMAL_SHUTDOWN
source: "%s (initiated by: %s): Normal shutdown"
por: "%s (%s): 'Shutdown' normal"

# ER_GOT_SIGNAL
source: "%s: Got signal %d. Aborting!\n"
por: "%s: Obteve sinal %d. Abortando!\n"

# ER_SHUTDOWN_COMPLETE
source: "%s: Shutdown complete\n"
por: "%s: 'Shutdown' completo\n"

# ER_FORCING_CLOSE 08S01
source: "%s: Forcing close of thread %ld user: '%-.48s'\n"
por: "%s: Forçando finalização da 'thread' %ld - usuário '%-.48s'\n"

# ER_IPSOCK_ERROR 08S01
source: "Can't create IP socket"
por: "Não pode criar o soquete IP"

# ER_NO_SUCH_INDEX 42S12 S1009
source: "Table '%-.192s' has no index like the one used in CREATE INDEX; recreate the table"
por: "Tabela '%-.192s' não possui um índice como o usado em CREATE INDEX. Recrie a tabela"

# ER_WRONG_FIELD_TERMINATORS 42000 S1009
source: "Field separator argument is not what is expected; check the manual"
por: "Argumento separador de campos não é o esperado. Cheque o manual"

# ER_BLOBS_AND_NO_TERMINATED 42000 S1009
source: "You can't use fixed rowlength with BLOBs; please use 'fields terminated by'"
por: "Você não pode usar comprimento de linha fixo com BLOBs. Por favor, use campos com comprimento limitado"

# ER_TEXTFILE_NOT_READABLE
source: "The file '%-.128s' must be in the database directory or be readable by all"
por: "Arquivo '%-.128s' tem que estar no diretório do banco de dados ou ter leitura possível para todos"

# ER_FILE_EXISTS_ERROR
source: "File '%-.200s' already exists"
por: "Arquivo '%-.200s' já existe"

# ER_LOAD_INFO
source: "Records: %ld Deleted: %ld Skipped: %ld Warnings: %ld"
por: "Registros: %ld - Deletados: %ld - Ignorados: %ld - Avisos: %ld"

# ER_ALTER_INFO
source: "Records: %ld Duplicates: %ld"
por: "Registros: %ld - Duplicados: %ld"

# ER_WRONG_SUB_KEY
source: "Incorrect prefix key; the used key part isn't a string, the used length is longer than the key part, or the storage engine doesn't support unique prefix keys"
por: "Sub parte da chave incorreta. A parte da chave usada não é uma 'string' ou o comprimento usado é maior que parte da chave ou o manipulador de tabelas não suporta sub chaves únicas"

# ER_CANT_REMOVE_ALL_FIELDS 42000
source: "You can't delete all columns with ALTER TABLE; use DROP TABLE instead"
por: "Você não pode deletar todas as colunas com ALTER TABLE; use DROP TABLE em seu lugar"

# ER_CANT_DROP_FIELD_OR_KEY 42000
source: "Can't DROP %s %`-.192s; check that it exists"
por: "Não se pode fazer DROP %s %`-.192s. Confira se esta coluna/chave existe"

# ER_INSERT_INFO
source: "Records: %ld Duplicates: %ld Warnings: %ld"
por: "Registros: %ld - Duplicados: %ld - Avisos: %ld"

# ER_NO_SUCH_THREAD
source: "Unknown thread id: %lu"
por: "'Id' de 'thread' %lu desconhecido"

# ER_KILL_DENIED_ERROR
source: "You are not owner of thread %lld"
por: "Você não é proprietário da 'thread' %lld"

# ER_NO_TABLES_USED
source: "No tables used"
por: "Nenhuma tabela usada"

# ER_TOO_BIG_SET
source: "Too many strings for column %-.192s and SET"
por: "'Strings' demais para coluna '%-.192s' e SET"

# ER_NO_UNIQUE_LOGFILE
source: "Can't generate a unique log-filename %-.200s.(1-999)\n"
por: "Não pode gerar um nome de arquivo de 'log' único '%-.200s'.(1-999)\n"

# ER_TABLE_NOT_LOCKED_FOR_WRITE
source: "Table '%-.192s' was locked with a READ lock and can't be updated"
por: "Tabela '%-.192s' foi travada com trava de leitura e não pode ser atualizada"

# ER_TABLE_NOT_LOCKED
source: "Table '%-.192s' was not locked with LOCK TABLES"
por: "Tabela '%-.192s' não foi travada com LOCK TABLES"

# ER_WRONG_DB_NAME 42000
source: "Incorrect database name '%-.100T'"
por: "Nome de banco de dados '%-.100T' incorreto"

# ER_WRONG_TABLE_NAME 42000
source: "Incorrect table name '%-.100s'"
por: "Nome de tabela '%-.100s' incorreto"

# ER_TOO_BIG_SELECT 42000
source: "The SELECT would examine more than MAX_JOIN_SIZE rows; check your WHERE and use SET SQL_BIG_SELECTS=1 or SET MAX_JOIN_SIZE=# if the SELECT is okay"
por: "O SELECT examinaria registros demais e provavelmente levaria muito tempo. Cheque sua cláusula WHERE e use SET SQL_BIG_SELECTS=1, se o SELECT estiver correto"

# ER_UNKNOWN_ERROR
source: "Unknown error"
por: "Erro desconhecido"

# ER_UNKNOWN_PROCEDURE 42000
source: "Unknown procedure '%-.192s'"
por: "'Procedure' '%-.192s' desconhecida"

# ER_WRONG_PARAMCOUNT_TO_PROCEDURE 42000
source: "Incorrect parameter count to procedure '%-.192s'"
por: "Número de parâmetros incorreto para a 'procedure' '%-.192s'"

# ER_WRONG_PARAMETERS_TO_PROCEDURE
source: "Incorrect parameters to procedure '%-.192s'"
por: "Parâmetros incorretos para a 'procedure' '%-.192s'"

# ER_UNKNOWN_TABLE 42S02
source: "Unknown table '%-.192s' in %-.32s"
por: "Tabela '%-.192s' desconhecida em '%-.32s'"

# ER_FIELD_SPECIFIED_TWICE 42000
source: "Column '%-.192s' specified twice"
por: "Coluna '%-.192s' especificada duas vezes"

# ER_INVALID_GROUP_FUNC_USE
source: "Invalid use of group function"
por: "Uso inválido de função de agrupamento (GROUP)"

# ER_UNSUPPORTED_EXTENSION 42000
source: "Table '%-.192s' uses an extension that doesn't exist in this MariaDB version"
por: "Tabela '%-.192s' usa uma extensão que não existe nesta versão do MariaDB"

# ER_TABLE_MUST_HAVE_COLUMNS 42000
source: "A table must have at least 1 column"
por: "Uma tabela tem que ter pelo menos uma (1) coluna"

# ER_RECORD_FILE_FULL
source: "The table '%-.192s' is full"
por: "Tabela '%-.192s' está cheia"

# ER_UNKNOWN_CHARACTER_SET 42000
source: "Unknown character set: '%-.64s'"
por: "Conjunto de caracteres '%-.64s' desconhecido"

# ER_TOO_MANY_TABLES
source: "Too many tables; MariaDB can only use %d tables in a join"
por: "Tabelas demais. O MariaDB pode usar somente %d tabelas em uma junção (JOIN)"

# ER_TOO_MANY_FIELDS
source: "Too many columns"
por: "Colunas demais"

# ER_TOO_BIG_ROWSIZE 42000
source: "Row size too large. The maximum row size for the used table type, not counting BLOBs, is %ld. This includes storage overhead, check the manual. You have to change some columns to TEXT or BLOBs"
por: "Tamanho de linha grande demais. O máximo tamanho de linha, não contando BLOBs, é %ld. Você tem que mudar alguns campos para BLOBs"

# ER_STACK_OVERRUN
source: "Thread stack overrun: Used: %ld of a %ld stack. Use 'mariadbd --thread_stack=#' to specify a bigger stack if needed"
por: "Estouro da pilha do 'thread'. Usados %ld de uma pilha de %ld. Use 'mariadbd --thread_stack=#' para especificar uma pilha maior, se necessário"

# ER_WRONG_OUTER_JOIN 42000
source: "Cross dependency found in OUTER JOIN; examine your ON conditions"
por: "Dependência cruzada encontrada em junção externa (OUTER JOIN); examine as condições utilizadas nas cláusulas 'ON'"

# ER_CANT_FIND_UDF
source: "Can't load function '%-.192s'"
por: "Não pode carregar a função '%-.192s'"

# ER_CANT_INITIALIZE_UDF
source: "Can't initialize function '%-.192s'; %-.80s"
por: "Não pode inicializar a função '%-.192s' - '%-.80s'"

# ER_UDF_NO_PATHS
source: "No paths allowed for shared library"
por: "Não há caminhos (paths) permitidos para biblioteca compartilhada"

# ER_UDF_EXISTS
source: "Function '%-.192s' already exists"
por: "Função '%-.192s' já existe"

# ER_CANT_OPEN_LIBRARY
source: "Can't open shared library '%-.192s' (errno: %d, %-.128s)"
por: "Não pode abrir biblioteca compartilhada '%-.192s' (erro no. %d, %-.128s)"

# ER_CANT_FIND_DL_ENTRY
source: "Can't find symbol '%-.128s' in library"
por: "Não pode encontrar a função '%-.128s' na biblioteca"

# ER_FUNCTION_NOT_DEFINED
source: "Function '%-.192s' is not defined"
por: "Função '%-.192s' não está definida"

# ER_HOST_IS_BLOCKED
source: "Host '%-.64s' is blocked because of many connection errors; unblock with 'mariadb-admin flush-hosts'"
por: "'Host' '%-.64s' está bloqueado devido a muitos erros de conexão. Desbloqueie com 'mariadb-admin flush-hosts'"

# ER_HOST_NOT_PRIVILEGED
source: "Host '%-.64s' is not allowed to connect to this MariaDB server"
por: "'Host' '%-.64s' não tem permissão para se conectar com este servidor MariaDB"

# ER_PASSWORD_ANONYMOUS_USER 42000
source: "You are using MariaDB as an anonymous user and anonymous users are not allowed to modify user settings"
por: "Você está usando o MariaDB como usuário anônimo e usuários anônimos não têm permissão para mudar senhas"

# ER_PASSWORD_NOT_ALLOWED 42000
source: "You must have privileges to update tables in the mysql database to be able to change passwords for others"
por: "Você deve ter privilégios para atualizar tabelas no banco de dados mysql para ser capaz de mudar a senha de outros"

# ER_PASSWORD_NO_MATCH 28000
source: "Can't find any matching row in the user table"
por: "Não pode encontrar nenhuma linha que combine na tabela usuário (user table)"

# ER_UPDATE_INFO
source: "Rows matched: %ld Changed: %ld Warnings: %ld"
por: "Linhas que combinaram: %ld - Alteradas: %ld - Avisos: %ld"

# ER_CANT_CREATE_THREAD
source: "Can't create a new thread (errno %M); if you are not out of available memory, you can consult the manual for a possible OS-dependent bug"
por: "Não pode criar uma nova 'thread' (erro no. %M). Se você não estiver sem memória disponível, você pode consultar o manual sobre um possível 'bug' dependente do sistema operacional"

# ER_WRONG_VALUE_COUNT_ON_ROW 21S01
source: "Column count doesn't match value count at row %lu"
por: "Contagem de colunas não confere com a contagem de valores na linha %lu"

# ER_CANT_REOPEN_TABLE
source: "Can't reopen table: '%-.192s'"
por: "Não pode reabrir a tabela '%-.192s"

# ER_INVALID_USE_OF_NULL 22004
source: "Invalid use of NULL value"
por: "Uso inválido do valor NULL"

# ER_REGEXP_ERROR 42000
source: "Regex error '%s'"
por: "Obteve erro '%s' em regexp"

# ER_MIX_OF_GROUP_FUNC_AND_FIELDS 42000
source: "Mixing of GROUP columns (MIN(),MAX(),COUNT(),...) with no GROUP columns is illegal if there is no GROUP BY clause"
por: "Mistura de colunas agrupadas (com MIN(), MAX(), COUNT(), ...) com colunas não agrupadas é ilegal, se não existir uma cláusula de agrupamento (cláusula GROUP BY)"

# ER_NONEXISTING_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s'"
por: "Não existe tal permissão (grant) definida para o usuário '%-.48s' no 'host' '%-.64s'"

# ER_TABLEACCESS_DENIED_ERROR 42000
source: "%-.100T command denied to user '%s'@'%s' for table '%-.192s'"
por: "Comando '%-.100T' negado para o usuário '%s'@'%s' na tabela '%-.192s'"

# ER_COLUMNACCESS_DENIED_ERROR 42000
source: "%-.32s command denied to user '%s'@'%s' for column '%-.192s' in table '%-.192s'"
por: "Comando '%-.32s' negado para o usuário '%s'@'%s' na coluna '%-.192s', na tabela '%-.192s'"

# ER_ILLEGAL_GRANT_FOR_TABLE 42000
source: "Illegal GRANT/REVOKE command; please consult the manual to see which privileges can be used"
por: "Comando GRANT/REVOKE ilegal. Por favor consulte no manual quais privilégios podem ser usados"

# ER_GRANT_WRONG_HOST_OR_USER 42000
source: "The host or user argument to GRANT is too long"
por: "Argumento de 'host' ou de usuário para o GRANT é longo demais"

# ER_NO_SUCH_TABLE 42S02
source: "Table '%-.192s.%-.192s' doesn't exist"
por: "Tabela '%-.192s.%-.192s' não existe"

# ER_NONEXISTING_TABLE_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s' on table '%-.192s'"
por: "Não existe tal permissão (grant) definido para o usuário '%-.48s' no 'host' '%-.64s', na tabela '%-.192s'"

# ER_NOT_ALLOWED_COMMAND 42000
source: "The used command is not allowed with this MariaDB version"
por: "Comando usado não é permitido para esta versão do MariaDB"

# ER_SYNTAX_ERROR 42000
source: "You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use"
por: "Você tem um erro de sintaxe no seu SQL"

# ER_DELAYED_CANT_CHANGE_LOCK
source: "Delayed insert thread couldn't get requested lock for table %-.192s"
por: "'Thread' de inserção retardada (atrasada) pois não conseguiu obter a trava solicitada para tabela '%-.192s'"

# ER_TOO_MANY_DELAYED_THREADS
source: "Too many delayed threads in use"
por: "Excesso de 'threads' retardadas (atrasadas) em uso"

# ER_ABORTING_CONNECTION 08S01
source: "Aborted connection %ld to db: '%-.192s' user: '%-.48s' (%-.64s)"
por: "Conexão %ld abortou para o banco de dados '%-.192s' - usuário '%-.48s' (%-.64s)"

# ER_NET_PACKET_TOO_LARGE 08S01
source: "Got a packet bigger than 'max_allowed_packet' bytes"
por: "Obteve um pacote maior do que a taxa máxima de pacotes definida (max_allowed_packet)"

# ER_NET_READ_ERROR_FROM_PIPE 08S01
source: "Got a read error from the connection pipe"
por: "Obteve um erro de leitura no 'pipe' da conexão"

# ER_NET_FCNTL_ERROR 08S01
source: "Got an error from fcntl()"
por: "Obteve um erro em fcntl()"

# ER_NET_PACKETS_OUT_OF_ORDER 08S01
source: "Got packets out of order"
por: "Obteve pacotes fora de ordem"

# ER_NET_UNCOMPRESS_ERROR 08S01
source: "Couldn't uncompress communication packet"
por: "Não conseguiu descomprimir pacote de comunicação"

# ER_NET_READ_ERROR 08S01
source: "Got an error reading communication packets"
por: "Obteve um erro na leitura de pacotes de comunicação"

# ER_NET_READ_INTERRUPTED 08S01
source: "Got timeout reading communication packets"
por: "Obteve expiração de tempo (timeout) na leitura de pacotes de comunicação"

# ER_NET_ERROR_ON_WRITE 08S01
source: "Got an error writing communication packets"
por: "Obteve um erro na escrita de pacotes de comunicação"

# ER_NET_WRITE_INTERRUPTED 08S01
source: "Got timeout writing communication packets"
por: "Obteve expiração de tempo ('timeout') na escrita de pacotes de comunicação"

# ER_TOO_LONG_STRING 42000
source: "Result string is longer than 'max_allowed_packet' bytes"
por: "'String' resultante é mais longa do que 'max_allowed_packet'"

# ER_TABLE_CANT_HANDLE_BLOB 42000
source: "Storage engine %s doesn't support BLOB/TEXT columns"
por: "Tipo de tabela usado (%s) não permite colunas BLOB/TEXT"

# ER_TABLE_CANT_HANDLE_AUTO_INCREMENT 42000
source: "Storage engine %s doesn't support AUTO_INCREMENT columns"
por: "Tipo de tabela usado (%s) não permite colunas AUTO_INCREMENT"

# ER_DELAYED_INSERT_TABLE_LOCKED
source: "INSERT DELAYED can't be used with table '%-.192s' because it is locked with LOCK TABLES"
por: "INSERT DELAYED não pode ser usado com a tabela '%-.192s', porque ela está travada com LOCK TABLES"

# ER_WRONG_COLUMN_NAME 42000
source: "Incorrect column name '%-.100s'"
por: "Nome de coluna '%-.100s' incorreto"
