Repository: vladbogo/test-translation
Catalog: rum.xlf
Languages: rum

# ER_NO
source: "NO"
rum: "NU---"

# ER_YES
source: "YES"
rum: "DA?"

# ER_CANT_CREATE_FILE
source: "Can't create file '%-.200s' (errno: %M)"
rum: "Nu pot sa creez fisierul '%-.200s' (Eroare: %M)"

# ER_CANT_CREATE_TABLE
source: "Can't create table %`s.%`s (errno: %M)"
rum: "Nu pot sa creez tabelul %`s.%`s (Eroare: %M)"

# ER_CANT_CREATE_DB
source: "Can't create database '%-.192s' (errno: %M)"
rum: "Nu pot sa creez baza de date '%-.192s' (Eroare: %M)"

# ER_DB_CREATE_EXISTS
source: "Can't create database '%-.192s'; database exists"
rum: "Nu pot sa creez baza de date '%-.192s'; baza de date exista deja"

# ER_DB_DROP_EXISTS
source: "Can't drop database '%-.192s'; database doesn't exist"
rum: "Nu pot sa sterg baza de date '%-.192s'; baza da date este inexistenta"

# ER_DB_DROP_DELETE
source: "Error dropping database (can't delete '%-.192s', errno: %M)"
rum: "Eroare dropuind baza de date (nu pot sa sterg '%-.192s', Eroare: %M)"

# ER_DB_DROP_RMDIR
source: "Error dropping database (can't rmdir '%-.192s', errno: %M)"
rum: "Eroare dropuind baza de date (nu pot sa rmdir '%-.192s', Eroare: %M)"

# ER_CANT_DELETE_FILE
source: "Error on delete of '%-.192s' (errno: %M)"
rum: "Eroare incercind sa delete '%-.192s' (Eroare: %M)"

# ER_CANT_FIND_SYSTEM_REC
source: "Can't read record in system table"
rum: "Nu pot sa citesc cimpurile in tabla de sistem (system table)"

# ER_CANT_GET_STAT
source: "Can't get status of '%-.200s' (errno: %M)"
rum: "Nu pot sa obtin statusul lui '%-.200s' (Eroare: %M)"

# ER_CANT_GET_WD
source: "Can't get working directory (errno: %M)"
rum: "Nu pot sa obtin directorul current (working directory) (Eroare: %M)"

# ER_CANT_LOCK
source: "Can't lock file (errno: %M)"
rum: "Nu pot sa lock fisierul (Eroare: %M)"

# ER_CANT_OPEN_FILE
source: "Can't open file: '%-.200s' (errno: %M)"
rum: "Nu pot sa deschid fisierul: '%-.200s' (Eroare: %M)"

# ER_FILE_NOT_FOUND
source: "Can't find file: '%-.200s' (errno: %M)"
rum: "Nu pot sa gasesc fisierul: '%-.200s' (Eroare: %M)"

# ER_CANT_READ_DIR
source: "Can't read dir of '%-.192s' (errno: %M)"
rum: "Nu pot sa citesc directorul '%-.192s' (Eroare: %M)"

# ER_CANT_SET_WD
source: "Can't change dir to '%-.192s' (errno: %M)"
rum: "Nu pot sa schimb directorul '%-.192s' (Eroare: %M)"

# ER_CHECKREAD
source: "Record has changed since last read in table '%-.192s'"
rum: "Cimpul a fost schimbat de la ultima citire a tabelei '%-.192s'"

# ER_DISK_FULL
source: "Disk full (%s); waiting for someone to free some space... (errno: %M)"
rum: "Hard-disk-ul este plin (%s). Astept sa se elibereze ceva spatiu... (Eroare: %M)"

# ER_DUP_KEY 23000
source: "Can't write; duplicate key in table '%-.192s'"
rum: "Nu pot sa scriu (can't write), cheie duplicata in tabela '%-.192s'"

# ER_ERROR_ON_CLOSE
source: "Error on close of '%-.192s' (errno: %M)"
rum: "Eroare inchizind '%-.192s' (errno: %M)"

# ER_ERROR_ON_READ
source: "Error reading file '%-.200s' (errno: %M)"
rum: "Eroare citind fisierul '%-.200s' (errno: %M)"

# ER_ERROR_ON_RENAME
source: "Error on rename of '%-.210s' to '%-.210s' (errno: %M)"
rum: "Eroare incercind sa renumesc '%-.210s' in '%-.210s' (errno: %M)"

# ER_ERROR_ON_WRITE
source: "Error writing file '%-.200s' (errno: %M)"
rum: "Eroare scriind fisierul '%-.200s' (errno: %M)"

# ER_FILE_USED
source: "'%-.192s' is locked against change"
rum: "'%-.192s' este blocat pentry schimbari (loccked against change)"

# ER_FILSORT_ABORT
source: "Sort aborted"
rum: "Sortare intrerupta"

# ER_FORM_NOT_FOUND
source: "View '%-.192s' doesn't exist for '%-.192s'"
rum: "View '%-.192s' nu exista pentru '%-.192s'"

# ER_GET_ERRNO
source: "Got error %M from storage engine %s"
rum: "Eroarea %M obtinuta din handlerul tabelei %s"

# ER_KEY_NOT_FOUND
source: "Can't find record in '%-.192s'"
rum: "Nu pot sa gasesc recordul in '%-.192s'"

# ER_NOT_FORM_FILE
source: "Incorrect information in file: '%-.200s'"
rum: "Informatie incorecta in fisierul: '%-.200s'"

# ER_NOT_KEYFILE
source: "Index for table '%-.200s' is corrupt; try to repair it"
rum: "Cheia fisierului incorecta pentru tabela: '%-.200s'; incearca s-o repari"

# ER_OLD_KEYFILE
source: "Old key file for table '%-.192s'; repair it!"
rum: "Cheia fisierului e veche pentru tabela '%-.192s'; repar-o!"

# ER_OPEN_AS_READONLY
source: "Table '%-.192s' is read only"
rum: "Tabela '%-.192s' e read-only"

# ER_OUTOFMEMORY HY001 S1001
source: "Out of memory; restart server and try again (needed %d bytes)"
rum: "Out of memory. Porneste daemon-ul din nou si incearca inca o data (e nevoie de %d bytes)"

# ER_OUT_OF_SORTMEMORY HY001 S1001
source: "Out of sort memory, consider increasing server sort buffer size"
rum: "Out of memory pentru sortare. Largeste marimea buffer-ului pentru sortare in daemon (sort buffer size)"

# ER_UNEXPECTED_EOF
source: "Unexpected EOF found when reading file '%-.192s' (errno: %M)"
rum: "Sfirsit de fisier neasteptat in citirea fisierului '%-.192s' (errno: %M)"

# ER_CON_COUNT_ERROR 08004
source: "Too many connections"
rum: "Prea multe conectiuni"

# ER_OUT_OF_RESOURCES
source: "Out of memory."
rum: "Lipsa memorie."

# ER_BAD_HOST_ERROR 08S01
source: "Can't get hostname for your address"
rum: "Nu pot sa obtin hostname-ul adresei tale"

# ER_HANDSHAKE_ERROR 08S01
source: "Bad handshake"
rum: "Prost inceput de conectie (bad handshake)"

# ER_DBACCESS_DENIED_ERROR 42000
source: "Access denied for user '%s'@'%s' to database '%-.192s'"
rum: "Acces interzis pentru utilizatorul: '%s'@'%s' la baza de date '%-.192s'"

# ER_ACCESS_DENIED_ERROR 28000
source: "Access denied for user '%s'@'%s' (using password: %s)"
rum: "Acces interzis pentru utilizatorul: '%s'@'%s' (Folosind parola: %s)"

# ER_NO_DB_ERROR 3D000
source: "No database selected"
rum: "Nici o baza de data nu a fost selectata inca"

# ER_UNKNOWN_COM_ERROR 08S01
source: "Unknown command"
rum: "Comanda invalida"

# ER_BAD_NULL_ERROR 23000
source: "Column '%-.192s' cannot be null"
rum: "Coloana '%-.192s' nu poate sa fie null"

# ER_BAD_DB_ERROR 42000
source: "Unknown database '%-.192s'"
rum: "Baza de data invalida '%-.192s'"

# ER_TABLE_EXISTS_ERROR 42S01
source: "Table '%-.192s' already exists"
rum: "Tabela '%-.192s' exista deja"

# ER_BAD_TABLE_ERROR 42S02
source: "Unknown table '%-.100T'"
rum: "Tabela '%-.100T' este invalida"

# ER_NON_UNIQ_ERROR 23000
source: "Column '%-.192s' in %-.192s is ambiguous"
rum: "Coloana: '%-.192s' in %-.192s este ambigua"

# ER_SERVER_SHUTDOWN 08S01
source: "Server shutdown in progress"
rum: "Terminarea serverului este in desfasurare"

# ER_BAD_FIELD_ERROR 42S22 S0022
source: "Unknown column '%-.192s' in '%-.192s'"
rum: "Coloana invalida '%-.192s' in '%-.192s'"

# ER_WRONG_FIELD_WITH_GROUP 42000 S1009
source: "'%-.192s' isn't in GROUP BY"
rum: "'%-.192s' nu exista in clauza GROUP BY"

# ER_WRONG_GROUP_FIELD 42000 S1009
source: "Can't group on '%-.192s'"
rum: "Nu pot sa grupez pe (group on) '%-.192s'"

# ER_WRONG_SUM_SELECT 42000 S1009
source: "Statement has sum functions and columns in same statement"
rum: "Comanda are functii suma si coloane in aceeasi comanda"

# ER_WRONG_VALUE_COUNT 21S01
source: "Column count doesn't match value count"
rum: "Numarul de coloane nu este acelasi cu numarul valoarei"

# ER_TOO_LONG_IDENT 42000 S1009
source: "Identifier name '%-.100T' is too long"
rum: "Numele indentificatorului '%-.100T' este prea lung"

# ER_DUP_FIELDNAME 42S21 S1009
source: "Duplicate column name '%-.192s'"
rum: "Numele coloanei '%-.192s' e duplicat"

# ER_DUP_KEYNAME 42000 S1009
source: "Duplicate key name '%-.192s'"
rum: "Numele cheiei '%-.192s' e duplicat"

# ER_DUP_ENTRY 23000 S1009
source: "Duplicate entry '%-.192T' for key %d"
rum: "Cimpul '%-.192T' e duplicat pentru cheia %d"

# ER_WRONG_FIELD_SPEC 42000 S1009
source: "Incorrect column specifier for column '%-.192s'"
rum: "Specificandul coloanei '%-.192s' este incorect"

# ER_PARSE_ERROR 42000 s1009
source: "%s near '%-.80T' at line %d"
rum: "%s linga '%-.80T' pe linia %d"

# ER_EMPTY_QUERY 42000
source: "Query was empty"
rum: "Query-ul a fost gol"

# ER_NONUNIQ_TABLE 42000 S1009
source: "Not unique table/alias: '%-.192s'"
rum: "Tabela/alias: '%-.192s' nu este unic"

# ER_INVALID_DEFAULT 42000 S1009
source: "Invalid default value for '%-.192s'"
rum: "Valoarea de default este invalida pentru '%-.192s'"

# ER_MULTIPLE_PRI_KEY 42000 S1009
source: "Multiple primary key defined"
rum: "Chei primare definite de mai multe ori"

# ER_TOO_MANY_KEYS 42000 S1009
source: "Too many keys specified; max %d keys allowed"
rum: "Prea multe chei. Numarul de chei maxim este %d"

# ER_TOO_MANY_KEY_PARTS 42000 S1009
source: "Too many key parts specified; max %d parts allowed"
rum: "Prea multe chei. Numarul de chei maxim este %d"

# ER_TOO_LONG_KEY 42000 S1009
source: "Specified key was too long; max key length is %d bytes"
rum: "Cheia specificata este prea lunga. Marimea maxima a unei chei este de %d"

# ER_KEY_COLUMN_DOES_NOT_EXIST 42000 S1009
source: "Key column '%-.192s' doesn't exist in table"
rum: "Coloana cheie '%-.192s' nu exista in tabela"

# ER_TOO_BIG_FIELDLENGTH 42000 S1009
source: "Column length too big for column '%-.192s' (max = %lu); use BLOB or TEXT instead"
rum: "Lungimea coloanei '%-.192s' este prea lunga (maximum = %lu). Foloseste BLOB mai bine"

# ER_WRONG_AUTO_KEY 42000 S1009
source: "Incorrect table definition; there can be only one auto column and it must be defined as a key"
rum: "Definitia tabelei este incorecta; Nu pot fi mai mult de o singura coloana de tip auto si aceasta trebuie definita ca cheie"

# ER_NORMAL_SHUTDOWN
source: "%s (initiated by: %s): Normal shutdown"
rum: "%s (%s): Terminare normala"

# ER_GOT_SIGNAL
source: "%s: Got signal %d. Aborting!\n"
rum: "%s: Semnal %d obtinut. Aborting!\n"

# ER_SHUTDOWN_COMPLETE
source: "%s: Shutdown complete\n"
rum: "%s: Terminare completa\n"

# ER_FORCING_CLOSE 08S01
source: "%s: Forcing close of thread %ld user: '%-.48s'\n"
rum: "%s: Terminare fortata a thread-ului %ld utilizatorului: '%-.48s'\n"

# ER_IPSOCK_ERROR 08S01
source: "Can't create IP socket"
rum: "Nu pot crea IP socket"

# ER_NO_SUCH_INDEX 42S12 S1009
source: "Table '%-.192s' has no index like the one used in CREATE INDEX; recreate the table"
rum: "Tabela '%-.192s' nu are un index ca acela folosit in CREATE INDEX. Re-creeaza tabela"

# ER_WRONG_FIELD_TERMINATORS 42000 S1009
source: "Field separator argument is not what is expected; check the manual"
rum: "Argumentul pentru separatorul de cimpuri este diferit de ce ma asteptam. Verifica manualul"

# ER_BLOBS_AND_NO_TERMINATED 42000 S1009
source: "You can't use fixed rowlength with BLOBs; please use 'fields terminated by'"
rum: "Nu poti folosi lungime de cimp fix pentru BLOB-uri. Foloseste 'fields terminated by'"

# ER_TEXTFILE_NOT_READABLE
source: "The file '%-.128s' must be in the database directory or be readable by all"
rum: "Fisierul '%-.128s' trebuie sa fie in directorul bazei de data sau trebuie sa poata sa fie citit de catre toata lumea (verifica permisiile)"

# ER_FILE_EXISTS_ERROR
source: "File '%-.200s' already exists"
rum: "Fisierul '%-.200s' exista deja"

# ER_LOAD_INFO
source: "Records: %ld Deleted: %ld Skipped: %ld Warnings: %ld"
rum: "Recorduri: %ld Sterse: %ld Sarite (skipped): %ld Atentionari (warnings): %ld"

# ER_ALTER_INFO
source: "Records: %ld Duplicates: %ld"
rum: "Recorduri: %ld Duplicate: %ld"

# ER_WRONG_SUB_KEY
source: "Incorrect prefix key; the used key part isn't a string, the used length is longer than the key part, or the storage engine doesn't support unique prefix keys"
rum: "Componentul cheii este incorrect. Componentul folosit al cheii nu este un sir sau lungimea folosita este mai lunga decit lungimea cheii"

# ER_CANT_REMOVE_ALL_FIELDS 42000
source: "You can't delete all columns with ALTER TABLE; use DROP TABLE instead"
rum: "Nu poti sterge toate coloanele cu ALTER TABLE. Foloseste DROP TABLE in schimb"

# ER_CANT_DROP_FIELD_OR_KEY 42000
source: "Can't DROP %s %`-.192s; check that it exists"
rum: "Nu pot sa DROP %s %`-.192s. Verifica daca coloana/cheia exista"

# ER_INSERT_INFO
source: "Records: %ld Duplicates: %ld Warnings: %ld"
rum: "Recorduri: %ld Duplicate: %ld Atentionari (warnings): %ld"

# ER_NO_SUCH_THREAD
source: "Unknown thread id: %lu"
rum: "Id-ul: %lu thread-ului este necunoscut"

# ER_KILL_DENIED_ERROR
source: "You are not owner of thread %lld"
rum: "Nu sinteti proprietarul threadului %lld"

# ER_NO_TABLES_USED
source: "No tables used"
rum: "Nici o tabela folosita"

# ER_TOO_BIG_SET
source: "Too many strings for column %-.192s and SET"
rum: "Prea multe siruri pentru coloana %-.192s si SET"

# ER_NO_UNIQUE_LOGFILE
source: "Can't generate a unique log-filename %-.200s.(1-999)\n"
rum: "Nu pot sa generez un nume de log unic %-.200s.(1-999)\n"

# ER_TABLE_NOT_LOCKED_FOR_WRITE
source: "Table '%-.192s' was locked with a READ lock and can't be updated"
rum: "Tabela '%-.192s' a fost locked cu un READ lock si nu poate fi actualizata"

# ER_TABLE_NOT_LOCKED
source: "Table '%-.192s' was not locked with LOCK TABLES"
rum: "Tabela '%-.192s' nu a fost locked cu LOCK TABLES"

# ER_WRONG_DB_NAME 42000
source: "Incorrect database name '%-.100T'"
rum: "Numele bazei de date este incorect '%-.100T'"

# ER_WRONG_TABLE_NAME 42000
source: "Incorrect table name '%-.100s'"
rum: "Numele tabelei este incorect '%-.100s'"

# ER_TOO_BIG_SELECT 42000
source: "The SELECT would examine more than MAX_JOIN_SIZE rows; check your WHERE and use SET SQL_BIG_SELECTS=1 or SET MAX_JOIN_SIZE=# if the SELECT is okay"
rum: "SELECT-ul ar examina prea multe cimpuri si probabil ar lua prea mult timp; verifica clauza WHERE si foloseste SET SQL_BIG_SELECTS=1 daca SELECT-ul e okay"

# ER_UNKNOWN_ERROR
source: "Unknown error"
rum: "Eroare unknown"

# ER_UNKNOWN_PROCEDURE 42000
source: "Unknown procedure '%-.192s'"
rum: "Procedura unknown '%-.192s'"

# ER_WRONG_PARAMCOUNT_TO_PROCEDURE 42000
source: "Incorrect parameter count to procedure '%-.192s'"
rum: "Procedura '%-.192s' are un numar incorect de parametri"

# ER_WRONG_PARAMETERS_TO_PROCEDURE
source: "Incorrect parameters to procedure '%-.192s'"
rum: "Procedura '%-.192s' are parametrii incorecti"

# ER_UNKNOWN_TABLE 42S02
source: "Unknown table '%-.192s' in %-.32s"
rum: "Tabla '%-.192s' invalida in %-.32s"

# ER_FIELD_SPECIFIED_TWICE 42000
source: "Column '%-.192s' specified twice"
rum: "Coloana '%-.192s' specificata de doua ori"

# ER_INVALID_GROUP_FUNC_USE
source: "Invalid use of group function"
rum: "Folosire incorecta a functiei group"

# ER_UNSUPPORTED_EXTENSION 42000
source: "Table '%-.192s' uses an extension that doesn't exist in this MariaDB version"
rum: "Tabela '%-.192s' foloseste o extensire inexistenta in versiunea curenta de MariaDB"

# ER_TABLE_MUST_HAVE_COLUMNS 42000
source: "A table must have at least 1 column"
rum: "O tabela trebuie sa aiba cel putin o coloana"

# ER_RECORD_FILE_FULL
source: "The table '%-.192s' is full"
rum: "Tabela '%-.192s' e plina"

# ER_UNKNOWN_CHARACTER_SET 42000
source: "Unknown character set: '%-.64s'"
rum: "Set de caractere invalid: '%-.64s'"

# ER_TOO_MANY_TABLES
source: "Too many tables; MariaDB can only use %d tables in a join"
rum: "Prea multe tabele. MariaDB nu poate folosi mai mult de %d tabele intr-un join"

# ER_TOO_MANY_FIELDS
source: "Too many columns"
rum: "Prea multe coloane"

# ER_TOO_BIG_ROWSIZE 42000
source: "Row size too large. The maximum row size for the used table type, not counting BLOBs, is %ld. This includes storage overhead, check the manual. You have to change some columns to TEXT or BLOBs"
rum: "Marimea liniei (row) prea mare. Marimea maxima a liniei, excluzind BLOB-urile este de %ld. Trebuie sa schimbati unele cimpuri in BLOB-uri"

# ER_STACK_OVERRUN
source: "Thread stack overrun: Used: %ld of a %ld stack. Use 'mariadbd --thread_stack=#' to specify a bigger stack if needed"
rum: "Stack-ul thread-ului a fost depasit (prea mic): Folositi: %ld intr-un stack de %ld. Folositi 'mariadbd --thread_stack=#' ca sa specifici un stack mai mare"

# ER_WRONG_OUTER_JOIN 42000
source: "Cross dependency found in OUTER JOIN; examine your ON conditions"
rum: "Dependinta incrucisata (cross dependency) gasita in OUTER JOIN. Examinati conditiile ON"

# ER_CANT_FIND_UDF
source: "Can't load function '%-.192s'"
rum: "Nu pot incarca functia '%-.192s'"

# ER_CANT_INITIALIZE_UDF
source: "Can't initialize function '%-.192s'; %-.80s"
rum: "Nu pot initializa functia '%-.192s'; %-.80s"

# ER_UDF_NO_PATHS
source: "No paths allowed for shared library"
rum: "Nici un paths nu e permis pentru o librarie shared"

# ER_UDF_EXISTS
source: "Function '%-.192s' already exists"
rum: "Functia '%-.192s' exista deja"

# ER_CANT_OPEN_LIBRARY
source: "Can't open shared library '%-.192s' (errno: %d, %-.128s)"
rum: "Nu pot deschide libraria shared '%-.192s' (Eroare: %d, %-.128s)"

# ER_CANT_FIND_DL_ENTRY
source: "Can't find symbol '%-.128s' in library"
rum: "Nu pot gasi functia '%-.128s' in libraria"

# ER_FUNCTION_NOT_DEFINED
source: "Function '%-.192s' is not defined"
rum: "Functia '%-.192s' nu e definita"

# ER_HOST_IS_BLOCKED
source: "Host '%-.64s' is blocked because of many connection errors; unblock with 'mariadb-admin flush-hosts'"
rum: "Host-ul '%-.64s' e blocat din cauza multelor erori de conectie. Poti deploca folosind 'mariadb-admin flush-hosts'"

# ER_HOST_NOT_PRIVILEGED
source: "Host '%-.64s' is not allowed to connect to this MariaDB server"
rum: "Host-ul '%-.64s' nu este permis a se conecta la aceste server MariaDB"

# ER_PASSWORD_ANONYMOUS_USER 42000
source: "You are using MariaDB as an anonymous user and anonymous users are not allowed to modify user settings"
rum: "Dumneavoastra folositi MariaDB ca un utilizator anonim si utilizatorii anonimi nu au voie sa schimbe setarile utilizatorilor"

# ER_PASSWORD_NOT_ALLOWED 42000
source: "You must have privileges to update tables in the mysql database to be able to change passwords for others"
rum: "Trebuie sa aveti privilegii sa actualizati tabelele in bazele de date mysql ca sa puteti sa schimati parolele altora"

# ER_PASSWORD_NO_MATCH 28000
source: "Can't find any matching row in the user table"
rum: "Nu pot gasi nici o linie corespunzatoare in tabela utilizatorului"

# ER_UPDATE_INFO
source: "Rows matched: %ld Changed: %ld Warnings: %ld"
rum: "Linii identificate (matched): %ld Schimbate: %ld Atentionari (warnings): %ld"

# ER_CANT_CREATE_THREAD
source: "Can't create a new thread (errno %M); if you are not out of available memory, you can consult the manual for a possible OS-dependent bug"
rum: "Nu pot crea un thread nou (Eroare %M). Daca mai aveti memorie disponibila in sistem, puteti consulta manualul - ar putea exista un potential bug in legatura cu sistemul de operare"

# ER_WRONG_VALUE_COUNT_ON_ROW 21S01
source: "Column count doesn't match value count at row %lu"
rum: "Numarul de coloane nu corespunde cu numarul de valori la linia %lu"

# ER_CANT_REOPEN_TABLE
source: "Can't reopen table: '%-.192s'"
rum: "Nu pot redeschide tabela: '%-.192s'"

# ER_INVALID_USE_OF_NULL 22004
source: "Invalid use of NULL value"
rum: "Folosirea unei value NULL e invalida"

# ER_REGEXP_ERROR 42000
source: "Regex error '%s'"
rum: "Eroarea '%s' obtinuta din expresia regulara (regexp)"

# ER_MIX_OF_GROUP_FUNC_AND_FIELDS 42000
source: "Mixing of GROUP columns (MIN(),MAX(),COUNT(),...) with no GROUP columns is illegal if there is no GROUP BY clause"
rum: "Amestecarea de coloane GROUP (MIN(),MAX(),COUNT()...) fara coloane GROUP este ilegala daca nu exista o clauza GROUP BY"

# ER_NONEXISTING_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s'"
rum: "Nu exista un astfel de grant definit pentru utilzatorul '%-.48s' de pe host-ul '%-.64s'"

# ER_TABLEACCESS_DENIED_ERROR 42000
source: "%-.100T command denied to user '%s'@'%s' for table '%-.192s'"
rum: "Comanda %-.100T interzisa utilizatorului: '%s'@'%s' pentru tabela '%-.192s'"

# ER_COLUMNACCESS_DENIED_ERROR 42000
source: "%-.32s command denied to user '%s'@'%s' for column '%-.192s' in table '%-.192s'"
rum: "Comanda %-.32s interzisa utilizatorului: '%s'@'%s' pentru coloana '%-.192s' in tabela '%-.192s'"

# ER_ILLEGAL_GRANT_FOR_TABLE 42000
source: "Illegal GRANT/REVOKE command; please consult the manual to see which privileges can be used"
rum: "Comanda GRANT/REVOKE ilegala. Consultati manualul in privinta privilegiilor ce pot fi folosite"

# ER_GRANT_WRONG_HOST_OR_USER 42000
source: "The host or user argument to GRANT is too long"
rum: "Argumentul host-ului sau utilizatorului pentru GRANT e prea lung"

# ER_NO_SUCH_TABLE 42S02
source: "Table '%-.192s.%-.192s' doesn't exist"
rum: "Tabela '%-.192s.%-.192s' nu exista"

# ER_NONEXISTING_TABLE_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s' on table '%-.192s'"
rum: "Nu exista un astfel de privilegiu (grant) definit pentru utilizatorul '%-.48s' de pe host-ul '%-.64s' pentru tabela '%-.192s'"

# ER_NOT_ALLOWED_COMMAND 42000
source: "The used command is not allowed with this MariaDB version"
rum: "Comanda folosita nu este permisa pentru aceasta versiune de MariaDB"

# ER_SYNTAX_ERROR 42000
source: "You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use"
rum: "Aveti o eroare in sintaxa RSQL"

# ER_DELAYED_CANT_CHANGE_LOCK
source: "Delayed insert thread couldn't get requested lock for table %-.192s"
rum: "Thread-ul pentru inserarea aminata nu a putut obtine lacatul (lock) pentru tabela %-.192s"

# ER_TOO_MANY_DELAYED_THREADS
source: "Too many delayed threads in use"
rum: "Prea multe threaduri aminate care sint in uz"

# ER_ABORTING_CONNECTION 08S01
source: "Aborted connection %ld to db: '%-.192s' user: '%-.48s' (%-.64s)"
rum: "Conectie terminata %ld la baza de date: '%-.192s' utilizator: '%-.48s' (%-.64s)"

# ER_NET_PACKET_TOO_LARGE 08S01
source: "Got a packet bigger than 'max_allowed_packet' bytes"
rum: "Un packet mai mare decit 'max_allowed_packet' a fost primit"

# ER_NET_READ_ERROR_FROM_PIPE 08S01
source: "Got a read error from the connection pipe"
rum: "Eroare la citire din cauza lui 'connection pipe'"

# ER_NET_FCNTL_ERROR 08S01
source: "Got an error from fcntl()"
rum: "Eroare obtinuta de la fcntl()"

# ER_NET_PACKETS_OUT_OF_ORDER 08S01
source: "Got packets out of order"
rum: "Packets care nu sint ordonati au fost gasiti"

# ER_NET_UNCOMPRESS_ERROR 08S01
source: "Couldn't uncompress communication packet"
rum: "Nu s-a putut decompresa pachetul de comunicatie (communication packet)"

# ER_NET_READ_ERROR 08S01
source: "Got an error reading communication packets"
rum: "Eroare obtinuta citind pachetele de comunicatie (communication packets)"

# ER_NET_READ_INTERRUPTED 08S01
source: "Got timeout reading communication packets"
rum: "Timeout obtinut citind pachetele de comunicatie (communication packets)"

# ER_NET_ERROR_ON_WRITE 08S01
source: "Got an error writing communication packets"
rum: "Eroare in scrierea pachetelor de comunicatie (communication packets)"

# ER_NET_WRITE_INTERRUPTED 08S01
source: "Got timeout writing communication packets"
rum: "Timeout obtinut scriind pachetele de comunicatie (communication packets)"

# ER_TOO_LONG_STRING 42000
source: "Result string is longer than 'max_allowed_packet' bytes"
rum: "Sirul rezultat este mai lung decit 'max_allowed_packet'"

# ER_TABLE_CANT_HANDLE_BLOB 42000
source: "Storage engine %s doesn't support BLOB/TEXT columns"
rum: "Tipul de tabela folosit (%s) nu suporta coloane de tip BLOB/TEXT"

# ER_TABLE_CANT_HANDLE_AUTO_INCREMENT 42000
source: "Storage engine %s doesn't support AUTO_INCREMENT columns"
rum: "Tipul de tabela folosit (%s) nu suporta coloane de tip AUTO_INCREMENT"

# ER_DELAYED_INSERT_TABLE_LOCKED
source: "INSERT DELAYED can't be used with table '%-.192s' because it is locked with LOCK TABLES"
rum: "INSERT DELAYED nu poate fi folosit cu tabela '%-.192s', deoarece este locked folosing LOCK TABLES"
