Repository: vladbogo/test-translation
Catalog: rum.xlf
Languages: rum

# ER_WRONG_COLUMN_NAME 42000
source: "Incorrect column name '%-.100s'"
rum: "Nume increct de coloana '%-.100s'"

# ER_WRONG_MRG_TABLE
source: "Unable to open underlying table which is differently defined or of non-MyISAM type or doesn't exist"
rum: "Toate tabelele din tabela MERGE nu sint definite identic"

# ER_DUP_UNIQUE 23000
source: "Can't write, because of unique constraint, to table '%-.192s'"
rum: "Nu pot scrie pe hard-drive, din cauza constraintului unic (unique constraint) pentru tabela '%-.192s'"

# ER_BLOB_KEY_WITHOUT_LENGTH 42000
source: "BLOB/TEXT column '%-.192s' used in key specification without a key length"
rum: "Coloana BLOB '%-.192s' este folosita in specificarea unei chei fara ca o lungime de cheie sa fie folosita"

# ER_PRIMARY_CANT_HAVE_NULL 42000
source: "All parts of a PRIMARY KEY must be NOT NULL; if you need NULL in a key, use UNIQUE instead"
rum: "Toate partile unei chei primare (PRIMARY KEY) trebuie sa fie NOT NULL; Daca aveti nevoie de NULL in vreo cheie, folositi UNIQUE in schimb"

# ER_TOO_MANY_ROWS 42000
source: "Result consisted of more than one row"
rum: "Resultatul constista din mai multe linii"

# ER_REQUIRES_PRIMARY_KEY 42000
source: "This table type requires a primary key"
rum: "Aceast tip de tabela are nevoie de o cheie primara"

# ER_NO_RAID_COMPILED
source: "This version of MariaDB is not compiled with RAID support"
rum: "Aceasta versiune de MariaDB, nu a fost compilata cu suport pentru RAID"

# ER_CHECK_NOT_IMPLEMENTED 42000
source: "The storage engine for the table doesn't support %s"
rum: "The handler for the table doesn't support %s"

# ER_DUP_ENTRY_WITH_KEY_NAME 23000 S1009
source: "Duplicate entry '%-.64T' for key '%-.192s'"
rum: "Cimpul '%-.64T' e duplicat pentru cheia '%-.192s'"

# ER_ACCESS_DENIED_NO_PASSWORD_ERROR 28000
source: "Access denied for user '%s'@'%s'"
rum: "Acces interzis pentru utilizatorul: '%s'@'%s'"

# ER_MUST_CHANGE_PASSWORD
source: "You must SET PASSWORD before executing this statement"
rum: "Trebuie sa iti schimbi parola folosind SET PASSWORD inainte de a executa aceasta comanda"

# ER_DUP_UNKNOWN_IN_INDEX 23000
source: "Duplicate entry for key '%-.192s'"
rum: "Cimpul e duplicat pentru cheia '%-.192s'"

# ER_MUST_CHANGE_PASSWORD_LOGIN
source: "Your password has expired. To log in you must change it using a client that supports expired passwords"
rum: "Parola ta a expirat. Pentru a te loga, trebuie sa o schimbi folosind un client ce suporta parole expirate"

# ER_INVALID_ROLE OP000
source: "Invalid role specification %`s"
rum: "Rolul %`s este invalid"

# ER_INVALID_CURRENT_USER 0L000
source: "The current user is invalid"
rum: "Utilizatorul curent este invalid"

# ER_CANNOT_GRANT_ROLE
source: "Cannot grant role '%s' to: %s"
rum: "Rolul '%s' nu poate fi acordat catre: %s"

# ER_CANNOT_REVOKE_ROLE
source: "Cannot revoke role '%s' from: %s"
rum: "Rolul '%s' nu poate fi revocat de la: %s"

# ER_ACCOUNT_HAS_BEEN_LOCKED
source: "Access denied, this account is locked"
rum: "Acces refuzat, acest cont este blocat"

# ER_LOAD_INFILE_CAPABILITY_DISABLED
source: "The used command is not allowed because the MariaDB server or client has disabled the local infile capability"
rum: "Comanda folosită nu este permisă deoarece clientul sau serverul MariaDB a dezactivat această capabilitate"
