Repository: vladbogo/test-translation
Catalog: rus.xlf
Languages: rus

# ER_NO
source: "NO"
rus: "НЕТ"

# ER_YES
source: "YES"
rus: "ДА"

# ER_CANT_CREATE_FILE
source: "Can't create file '%-.200s' (errno: %M)"
rus: "Невозможно создать файл '%-.200s' (ошибка: %M)"

# ER_CANT_CREATE_TABLE
source: "Can't create table %`s.%`s (errno: %M)"
rus: "Невозможно создать таблицу %`s.%`s (ошибка: %M)"

# ER_CANT_CREATE_DB
source: "Can't create database '%-.192s' (errno: %M)"
rus: "Невозможно создать базу данных '%-.192s' (ошибка: %M)"

# ER_DB_CREATE_EXISTS
source: "Can't create database '%-.192s'; database exists"
rus: "Невозможно создать базу данных '%-.192s'. База данных уже существует"

# ER_DB_DROP_EXISTS
source: "Can't drop database '%-.192s'; database doesn't exist"
rus: "Невозможно удалить базу данных '%-.192s'. Такой базы данных нет"

# ER_DB_DROP_DELETE
source: "Error dropping database (can't delete '%-.192s', errno: %M)"
rus: "Ошибка при удалении базы данных (невозможно удалить '%-.192s', ошибка: %M)"

# ER_DB_DROP_RMDIR
source: "Error dropping database (can't rmdir '%-.192s', errno: %M)"
rus: "Невозможно удалить базу данных (невозможно удалить каталог '%-.192s', ошибка: %M)"

# ER_CANT_DELETE_FILE
source: "Error on delete of '%-.192s' (errno: %M)"
rus: "Ошибка при удалении '%-.192s' (ошибка: %M)"

# ER_CANT_FIND_SYSTEM_REC
source: "Can't read record in system table"
rus: "Невозможно прочитать запись в системной таблице"

# ER_CANT_GET_STAT
source: "Can't get status of '%-.200s' (errno: %M)"
rus: "Невозможно получить статусную информацию о '%-.200s' (ошибка: %M)"

# ER_CANT_GET_WD
source: "Can't get working directory (errno: %M)"
rus: "Невозможно определить рабочий каталог (ошибка: %M)"

# ER_CANT_LOCK
source: "Can't lock file (errno: %M)"
rus: "Невозможно поставить блокировку на файле (ошибка: %M)"

# ER_CANT_OPEN_FILE
source: "Can't open file: '%-.200s' (errno: %M)"
rus: "Невозможно открыть файл: '%-.200s' (ошибка: %M)"

# ER_FILE_NOT_FOUND
source: "Can't find file: '%-.200s' (errno: %M)"
rus: "Невозможно найти файл: '%-.200s' (ошибка: %M)"

# ER_CANT_READ_DIR
source: "Can't read dir of '%-.192s' (errno: %M)"
rus: "Невозможно прочитать каталог '%-.192s' (ошибка: %M)"

# ER_CANT_SET_WD
source: "Can't change dir to '%-.192s' (errno: %M)"
rus: "Невозможно перейти в каталог '%-.192s' (ошибка: %M)"

# ER_CHECKREAD
source: "Record has changed since last read in table '%-.192s'"
rus: "Запись изменилась с момента последней выборки в таблице '%-.192s'"

# ER_DISK_FULL
source: "Disk full (%s); waiting for someone to free some space... (errno: %M)"
rus: "Диск заполнен. (%s). Ожидаем, пока кто-то не уберет после себя мусор... (ошибка: %M)"

# ER_DUP_KEY 23000
source: "Can't write; duplicate key in table '%-.192s'"
rus: "Невозможно произвести запись, дублирующийся ключ в таблице '%-.192s'"

# ER_ERROR_ON_CLOSE
source: "Error on close of '%-.192s' (errno: %M)"
rus: "Ошибка при закрытии '%-.192s' (ошибка: %M)"

# ER_ERROR_ON_READ
source: "Error reading file '%-.200s' (errno: %M)"
rus: "Ошибка чтения файла '%-.200s' (ошибка: %M)"

# ER_ERROR_ON_RENAME
source: "Error on rename of '%-.210s' to '%-.210s' (errno: %M)"
rus: "Ошибка при переименовании '%-.210s' в '%-.210s' (ошибка: %M)"

# ER_ERROR_ON_WRITE
source: "Error writing file '%-.200s' (errno: %M)"
rus: "Ошибка записи в файл '%-.200s' (ошибка: %M)"

# ER_FILE_USED
source: "'%-.192s' is locked against change"
rus: "'%-.192s' заблокирован для изменений"

# ER_FILSORT_ABORT
source: "Sort aborted"
rus: "Сортировка прервана"

# ER_FORM_NOT_FOUND
source: "View '%-.192s' doesn't exist for '%-.192s'"
rus: "Представление '%-.192s' не существует для '%-.192s'"

# ER_GET_ERRNO
source: "Got error %M from storage engine %s"
rus: "Получена ошибка %M от обработчика таблиц %s"

# ER_ILLEGAL_HA
source: "Storage engine %s of the table %`s.%`s doesn't have this option"
rus: "Обработчик %s таблицы %`s.%`s не поддерживает эту возможность"

# ER_KEY_NOT_FOUND
source: "Can't find record in '%-.192s'"
rus: "Невозможно найти запись в '%-.192s'"

# ER_NOT_FORM_FILE
source: "Incorrect information in file: '%-.200s'"
rus: "Некорректная информация в файле '%-.200s'"

# ER_NOT_KEYFILE
source: "Index for table '%-.200s' is corrupt; try to repair it"
rus: "Некорректный индексный файл для таблицы: '%-.200s'. Попробуйте восстановить его"

# ER_OLD_KEYFILE
source: "Old key file for table '%-.192s'; repair it!"
rus: "Старый индексный файл для таблицы '%-.192s'; отремонтируйте его!"

# ER_OPEN_AS_READONLY
source: "Table '%-.192s' is read only"
rus: "Таблица '%-.192s' предназначена только для чтения"

# ER_OUTOFMEMORY HY001 S1001
source: "Out of memory; restart server and try again (needed %d bytes)"
rus: "Недостаточно памяти. Перезапустите сервер и попробуйте еще раз (нужно %d байт)"

# ER_OUT_OF_SORTMEMORY HY001 S1001
source: "Out of sort memory, consider increasing server sort buffer size"
rus: "Недостаточно памяти для сортировки. Увеличьте размер буфера сортировки на сервере"

# ER_UNEXPECTED_EOF
source: "Unexpected EOF found when reading file '%-.192s' (errno: %M)"
rus: "Неожиданный конец файла '%-.192s' (ошибка: %M)"

# ER_CON_COUNT_ERROR 08004
source: "Too many connections"
rus: "Слишком много соединений"

# ER_OUT_OF_RESOURCES
source: "Out of memory."
rus: "Недостаточно памяти."

# ER_BAD_HOST_ERROR 08S01
source: "Can't get hostname for your address"
rus: "Невозможно получить имя хоста для вашего адреса"

# ER_HANDSHAKE_ERROR 08S01
source: "Bad handshake"
rus: "Некорректное приветствие"

# ER_DBACCESS_DENIED_ERROR 42000
source: "Access denied for user '%s'@'%s' to database '%-.192s'"
rus: "Для пользователя '%s'@'%s' доступ к базе данных '%-.192s' закрыт"

# ER_ACCESS_DENIED_ERROR 28000
source: "Access denied for user '%s'@'%s' (using password: %s)"
rus: "Доступ закрыт для пользователя '%s'@'%s' (был использован пароль: %s)"

# ER_NO_DB_ERROR 3D000
source: "No database selected"
rus: "База данных не выбрана"

# ER_UNKNOWN_COM_ERROR 08S01
source: "Unknown command"
rus: "Неизвестная команда коммуникационного протокола"

# ER_BAD_NULL_ERROR 23000
source: "Column '%-.192s' cannot be null"
rus: "Столбец '%-.192s' не может принимать величину NULL"

# ER_BAD_DB_ERROR 42000
source: "Unknown database '%-.192s'"
rus: "Неизвестная база данных '%-.192s'"

# ER_TABLE_EXISTS_ERROR 42S01
source: "Table '%-.192s' already exists"
rus: "Таблица '%-.192s' уже существует"

# ER_BAD_TABLE_ERROR 42S02
source: "Unknown table '%-.100T'"
rus: "Неизвестная таблица '%-.100T'"

# ER_NON_UNIQ_ERROR 23000
source: "Column '%-.192s' in %-.192s is ambiguous"
rus: "Столбец '%-.192s' в %-.192s задан неоднозначно"

# ER_SERVER_SHUTDOWN 08S01
source: "Server shutdown in progress"
rus: "Сервер находится в процессе остановки"

# ER_BAD_FIELD_ERROR 42S22 S0022
source: "Unknown column '%-.192s' in '%-.192s'"
rus: "Неизвестный столбец '%-.192s' в '%-.192s'"

# ER_WRONG_FIELD_WITH_GROUP 42000 S1009
source: "'%-.192s' isn't in GROUP BY"
rus: "'%-.192s' не присутствует в GROUP BY"

# ER_WRONG_GROUP_FIELD 42000 S1009
source: "Can't group on '%-.192s'"
rus: "Невозможно произвести группировку по '%-.192s'"

# ER_WRONG_SUM_SELECT 42000 S1009
source: "Statement has sum functions and columns in same statement"
rus: "Выражение содержит групповые функции и столбцы, но не включает GROUP BY. А как вы умудрились получить это сообщение об ошибке?"

# ER_WRONG_VALUE_COUNT 21S01
source: "Column count doesn't match value count"
rus: "Количество столбцов не совпадает с количеством значений"

# ER_TOO_LONG_IDENT 42000 S1009
source: "Identifier name '%-.100T' is too long"
rus: "Слишком длинный идентификатор '%-.100T'"

# ER_DUP_FIELDNAME 42S21 S1009
source: "Duplicate column name '%-.192s'"
rus: "Дублирующееся имя столбца '%-.192s'"

# ER_DUP_KEYNAME 42000 S1009
source: "Duplicate key name '%-.192s'"
rus: "Дублирующееся имя ключа '%-.192s'"

# ER_DUP_ENTRY 23000 S1009
source: "Duplicate entry '%-.192T' for key %d"
rus: "Дублирующаяся запись '%-.192T' по ключу %d"

# ER_WRONG_FIELD_SPEC 42000 S1009
source: "Incorrect column specifier for column '%-.192s'"
rus: "Некорректный определитель столбца для столбца '%-.192s'"

# ER_PARSE_ERROR 42000 s1009
source: "%s near '%-.80T' at line %d"
rus: "%s около '%-.80T' на строке %d"

# ER_EMPTY_QUERY 42000
source: "Query was empty"
rus: "Запрос оказался пустым"

# ER_NONUNIQ_TABLE 42000 S1009
source: "Not unique table/alias: '%-.192s'"
rus: "Повторяющаяся таблица/псевдоним '%-.192s'"

# ER_INVALID_DEFAULT 42000 S1009
source: "Invalid default value for '%-.192s'"
rus: "Некорректное значение по умолчанию для '%-.192s'"

# ER_MULTIPLE_PRI_KEY 42000 S1009
source: "Multiple primary key defined"
rus: "Указано несколько первичных ключей"

# ER_TOO_MANY_KEYS 42000 S1009
source: "Too many keys specified; max %d keys allowed"
rus: "Указано слишком много ключей. Разрешается указывать не более %d ключей"

# ER_TOO_MANY_KEY_PARTS 42000 S1009
source: "Too many key parts specified; max %d parts allowed"
rus: "Указано слишком много частей составного ключа. Разрешается указывать не более %d частей"

# ER_TOO_LONG_KEY 42000 S1009
source: "Specified key was too long; max key length is %d bytes"
rus: "Указан слишком длинный ключ. Максимальная длина ключа составляет %d байт"

# ER_KEY_COLUMN_DOES_NOT_EXIST 42000 S1009
source: "Key column '%-.192s' doesn't exist in table"
rus: "Ключевой столбец '%-.192s' в таблице не существует"

# ER_BLOB_USED_AS_KEY 42000 S1009
source: "BLOB column %`s can't be used in key specification in the %s table"
rus: "Столбец типа BLOB %`s не может быть использован как значение ключа в %s таблице"

# ER_TOO_BIG_FIELDLENGTH 42000 S1009
source: "Column length too big for column '%-.192s' (max = %lu); use BLOB or TEXT instead"
rus: "Слишком большая длина столбца '%-.192s' (максимум = %lu). Используйте тип BLOB или TEXT вместо текущего"

# ER_WRONG_AUTO_KEY 42000 S1009
source: "Incorrect table definition; there can be only one auto column and it must be defined as a key"
rus: "Некорректное определение таблицы: может существовать только один автоинкрементный столбец, и он должен быть определен как ключ"

# ER_NORMAL_SHUTDOWN
source: "%s (initiated by: %s): Normal shutdown"
rus: "%s (инициирована пользователем: %s): Корректная остановка"

# ER_GOT_SIGNAL
source: "%s: Got signal %d. Aborting!\n"
rus: "%s: Получен сигнал %d. Прекращаем!\n"

# ER_SHUTDOWN_COMPLETE
source: "%s: Shutdown complete\n"
rus: "%s: Остановка завершена\n"

# ER_FORCING_CLOSE 08S01
source: "%s: Forcing close of thread %ld user: '%-.48s'\n"
rus: "%s: Принудительно закрываем поток %ld пользователя: '%-.48s'\n"

# ER_IPSOCK_ERROR 08S01
source: "Can't create IP socket"
rus: "Невозможно создать IP-сокет"

# ER_NO_SUCH_INDEX 42S12 S1009
source: "Table '%-.192s' has no index like the one used in CREATE INDEX; recreate the table"
rus: "В таблице '%-.192s' нет такого индекса, как в CREATE INDEX. Создайте таблицу заново"

# ER_WRONG_FIELD_TERMINATORS 42000 S1009
source: "Field separator argument is not what is expected; check the manual"
rus: "Аргумент разделителя полей - не тот, который ожидался. Обращайтесь к документации"

# ER_BLOBS_AND_NO_TERMINATED 42000 S1009
source: "You can't use fixed rowlength with BLOBs; please use 'fields terminated by'"
rus: "Фиксированный размер записи с полями типа BLOB использовать нельзя, применяйте 'fields terminated by'"

# ER_TEXTFILE_NOT_READABLE
source: "The file '%-.128s' must be in the database directory or be readable by all"
rus: "Файл '%-.128s' должен находиться в том же каталоге, что и база данных, или быть общедоступным для чтения"

# ER_FILE_EXISTS_ERROR
source: "File '%-.200s' already exists"
rus: "Файл '%-.200s' уже существует"

# ER_LOAD_INFO
source: "Records: %ld Deleted: %ld Skipped: %ld Warnings: %ld"
rus: "Записей: %ld Удалено: %ld Пропущено: %ld Предупреждений: %ld"

# ER_ALTER_INFO
source: "Records: %ld Duplicates: %ld"
rus: "Записей: %ld Дубликатов: %ld"

# ER_WRONG_SUB_KEY
source: "Incorrect prefix key; the used key part isn't a string, the used length is longer than the key part, or the storage engine doesn't support unique prefix keys"
rus: "Некорректная часть ключа. Используемая часть ключа не является строкой, указанная длина больше, чем длина части ключа, или обработчик таблицы не поддерживает уникальные части ключа"

# ER_CANT_REMOVE_ALL_FIELDS 42000
source: "You can't delete all columns with ALTER TABLE; use DROP TABLE instead"
rus: "Нельзя удалить все столбцы с помощью ALTER TABLE. Используйте DROP TABLE"

# ER_CANT_DROP_FIELD_OR_KEY 42000
source: "Can't DROP %s %`-.192s; check that it exists"
rus: "Невозможно удалить (DROP %s) %`-.192s. Убедитесь что он действительно существует"

# ER_INSERT_INFO
source: "Records: %ld Duplicates: %ld Warnings: %ld"
rus: "Записей: %ld Дубликатов: %ld Предупреждений: %ld"

# ER_NO_SUCH_THREAD
source: "Unknown thread id: %lu"
rus: "Неизвестный номер потока: %lu"

# ER_KILL_DENIED_ERROR
source: "You are not owner of thread %lld"
rus: "Вы не являетесь владельцем потока %lld"

# ER_NO_TABLES_USED
source: "No tables used"
rus: "Никакие таблицы не использованы"

# ER_TOO_BIG_SET
source: "Too many strings for column %-.192s and SET"
rus: "Слишком много значений для столбца %-.192s в SET"

# ER_NO_UNIQUE_LOGFILE
source: "Can't generate a unique log-filename %-.200s.(1-999)\n"
rus: "Невозможно создать уникальное имя файла журнала %-.200s.(1-999)\n"

# ER_TABLE_NOT_LOCKED_FOR_WRITE
source: "Table '%-.192s' was locked with a READ lock and can't be updated"
rus: "Таблица '%-.192s' заблокирована уровнем READ lock и не может быть изменена"

# ER_TABLE_NOT_LOCKED
source: "Table '%-.192s' was not locked with LOCK TABLES"
rus: "Таблица '%-.192s' не была заблокирована с помощью LOCK TABLES"

# ER_WRONG_DB_NAME 42000
source: "Incorrect database name '%-.100T'"
rus: "Некорректное имя базы данных '%-.100T'"

# ER_WRONG_TABLE_NAME 42000
source: "Incorrect table name '%-.100s'"
rus: "Некорректное имя таблицы '%-.100s'"

# ER_TOO_BIG_SELECT 42000
source: "The SELECT would examine more than MAX_JOIN_SIZE rows; check your WHERE and use SET SQL_BIG_SELECTS=1 or SET MAX_JOIN_SIZE=# if the SELECT is okay"
rus: "Для такой выборки SELECT должен будет просмотреть слишком много записей и, видимо, это займет очень много времени. Проверьте ваше указание WHERE, и, если в нем все в порядке, укажите SET SQL_BIG_SELECTS=1"

# ER_UNKNOWN_ERROR
source: "Unknown error"
rus: "Неизвестная ошибка"

# ER_UNKNOWN_PROCEDURE 42000
source: "Unknown procedure '%-.192s'"
rus: "Неизвестная процедура '%-.192s'"

# ER_WRONG_PARAMCOUNT_TO_PROCEDURE 42000
source: "Incorrect parameter count to procedure '%-.192s'"
rus: "Некорректное количество параметров для процедуры '%-.192s'"

# ER_WRONG_PARAMETERS_TO_PROCEDURE
source: "Incorrect parameters to procedure '%-.192s'"
rus: "Некорректные параметры для процедуры '%-.192s'"

# ER_UNKNOWN_TABLE 42S02
source: "Unknown table '%-.192s' in %-.32s"
rus: "Неизвестная таблица '%-.192s' в %-.32s"

# ER_FIELD_SPECIFIED_TWICE 42000
source: "Column '%-.192s' specified twice"
rus: "Столбец '%-.192s' указан дважды"

# ER_INVALID_GROUP_FUNC_USE
source: "Invalid use of group function"
rus: "Неправильное использование групповых функций"

# ER_UNSUPPORTED_EXTENSION 42000
source: "Table '%-.192s' uses an extension that doesn't exist in this MariaDB version"
rus: "В таблице '%-.192s' используются возможности, не поддерживаемые в этой версии MariaDB"

# ER_TABLE_MUST_HAVE_COLUMNS 42000
source: "A table must have at least 1 column"
rus: "В таблице должен быть как минимум один столбец"

# ER_RECORD_FILE_FULL
source: "The table '%-.192s' is full"
rus: "Таблица '%-.192s' переполнена"

# ER_UNKNOWN_CHARACTER_SET 42000
source: "Unknown character set: '%-.64s'"
rus: "Неизвестная кодировка '%-.64s'"

# ER_TOO_MANY_TABLES
source: "Too many tables; MariaDB can only use %d tables in a join"
rus: "Слишком много таблиц. MariaDB может использовать только %d таблиц в соединении"

# ER_TOO_MANY_FIELDS
source: "Too many columns"
rus: "Слишком много столбцов"

# ER_TOO_BIG_ROWSIZE 42000
source: "Row size too large. The maximum row size for the used table type, not counting BLOBs, is %ld. This includes storage overhead, check the manual. You have to change some columns to TEXT or BLOBs"
rus: "Слишком большой размер записи. Максимальный размер строки, исключая поля BLOB, - %ld. Возможно, вам следует изменить тип некоторых полей на BLOB"

# ER_STACK_OVERRUN
source: "Thread stack overrun: Used: %ld of a %ld stack. Use 'mariadbd --thread_stack=#' to specify a bigger stack if needed"
rus: "Стек потоков переполнен: использовано: %ld из %ld стека. Применяйте 'mariadbd --thread_stack=#' для указания большего размера стека, если необходимо"

# ER_WRONG_OUTER_JOIN 42000
source: "Cross dependency found in OUTER JOIN; examine your ON conditions"
rus: "В OUTER JOIN обнаружена перекрестная зависимость. Внимательно проанализируйте свои условия ON"

# ER_CANT_FIND_UDF
source: "Can't load function '%-.192s'"
rus: "Невозможно загрузить функцию '%-.192s'"

# ER_CANT_INITIALIZE_UDF
source: "Can't initialize function '%-.192s'; %-.80s"
rus: "Невозможно инициализировать функцию '%-.192s'; %-.80s"

# ER_UDF_NO_PATHS
source: "No paths allowed for shared library"
rus: "Недопустимо указывать пути для динамических библиотек"

# ER_UDF_EXISTS
source: "Function '%-.192s' already exists"
rus: "Функция '%-.192s' уже существует"

# ER_CANT_OPEN_LIBRARY
source: "Can't open shared library '%-.192s' (errno: %d, %-.128s)"
rus: "Невозможно открыть динамическую библиотеку '%-.192s' (ошибка: %d, %-.128s)"

# ER_CANT_FIND_DL_ENTRY
source: "Can't find symbol '%-.128s' in library"
rus: "Невозможно отыскать символ '%-.128s' в библиотеке"

# ER_FUNCTION_NOT_DEFINED
source: "Function '%-.192s' is not defined"
rus: "Функция '%-.192s' не определена"

# ER_HOST_IS_BLOCKED
source: "Host '%-.64s' is blocked because of many connection errors; unblock with 'mariadb-admin flush-hosts'"
rus: "Хост '%-.64s' заблокирован из-за слишком большого количества ошибок соединения. Разблокировать его можно с помощью 'mariadb-admin flush-hosts'"

# ER_HOST_NOT_PRIVILEGED
source: "Host '%-.64s' is not allowed to connect to this MariaDB server"
rus: "Хосту '%-.64s' не разрешается подключаться к этому серверу MariaDB"

# ER_PASSWORD_ANONYMOUS_USER 42000
source: "You are using MariaDB as an anonymous user and anonymous users are not allowed to modify user settings"
rus: "Вы используете MariaDB от имени анонимного пользователя, а анонимным пользователям не разрешается менять пароли"

# ER_PASSWORD_NOT_ALLOWED 42000
source: "You must have privileges to update tables in the mysql database to be able to change passwords for others"
rus: "Для того чтобы изменять пароли других пользователей, у вас должны быть привилегии на изменение таблиц в базе данных mysql"

# ER_PASSWORD_NO_MATCH 28000
source: "Can't find any matching row in the user table"
rus: "Невозможно отыскать подходящую запись в таблице пользователей"

# ER_UPDATE_INFO
source: "Rows matched: %ld Changed: %ld Warnings: %ld"
rus: "Совпало записей: %ld Изменено: %ld Предупреждений: %ld"

# ER_CANT_CREATE_THREAD
source: "Can't create a new thread (errno %M); if you are not out of available memory, you can consult the manual for a possible OS-dependent bug"
rus: "Невозможно создать новый поток (ошибка %M). Если это не ситуация, связанная с нехваткой памяти, то вам следует изучить документацию на предмет описания возможной ошибки работы в конкретной ОС"

# ER_WRONG_VALUE_COUNT_ON_ROW 21S01
source: "Column count doesn't match value count at row %lu"
rus: "Количество столбцов не совпадает с количеством значений в записи %lu"

# ER_CANT_REOPEN_TABLE
source: "Can't reopen table: '%-.192s'"
rus: "Невозможно заново открыть таблицу '%-.192s'"

# ER_INVALID_USE_OF_NULL 22004
source: "Invalid use of NULL value"
rus: "Неправильное использование величины NULL"

# ER_REGEXP_ERROR 42000
source: "Regex error '%s'"
rus: "Ошибка регулярного выражения: %s"

# ER_MIX_OF_GROUP_FUNC_AND_FIELDS 42000
source: "Mixing of GROUP columns (MIN(),MAX(),COUNT(),...) with no GROUP columns is illegal if there is no GROUP BY clause"
rus: "Одновременное использование сгруппированных (GROUP) столбцов (MIN(),MAX(),COUNT(),...) с несгруппированными столбцами является некорректным, если в выражении есть GROUP BY"

# ER_NONEXISTING_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s'"
rus: "Такие права не определены для пользователя '%-.48s' на хосте '%-.64s'"

# ER_TABLEACCESS_DENIED_ERROR 42000
source: "%-.100T command denied to user '%s'@'%s' for table '%-.192s'"
rus: "Команда %-.100T запрещена пользователю '%s'@'%s' для таблицы '%-.192s'"

# ER_COLUMNACCESS_DENIED_ERROR 42000
source: "%-.32s command denied to user '%s'@'%s' for column '%-.192s' in table '%-.192s'"
rus: "Команда %-.32s запрещена пользователю '%s'@'%s' для столбца '%-.192s' в таблице '%-.192s'"

# ER_ILLEGAL_GRANT_FOR_TABLE 42000
source: "Illegal GRANT/REVOKE command; please consult the manual to see which privileges can be used"
rus: "Неверная команда GRANT или REVOKE. Обратитесь к документации, чтобы выяснить, какие привилегии можно использовать"

# ER_GRANT_WRONG_HOST_OR_USER 42000
source: "The host or user argument to GRANT is too long"
rus: "Слишком длинное имя пользователя/хоста для GRANT"

# ER_NO_SUCH_TABLE 42S02
source: "Table '%-.192s.%-.192s' doesn't exist"
rus: "Таблица '%-.192s.%-.192s' не существует"

# ER_NONEXISTING_TABLE_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s' on table '%-.192s'"
rus: "Такие права не определены для пользователя '%-.48s' на компьютере '%-.64s' для таблицы '%-.192s'"

# ER_NOT_ALLOWED_COMMAND 42000
source: "The used command is not allowed with this MariaDB version"
rus: "Эта команда не допускается в данной версии MariaDB"

# ER_SYNTAX_ERROR 42000
source: "You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use"
rus: "У вас ошибка в запросе. Изучите документацию по используемой версии MariaDB на предмет корректного синтаксиса"

# ER_DELAYED_CANT_CHANGE_LOCK
source: "Delayed insert thread couldn't get requested lock for table %-.192s"
rus: "Поток, обслуживающий отложенную вставку (delayed insert), не смог получить запрашиваемую блокировку на таблицу %-.192s"

# ER_TOO_MANY_DELAYED_THREADS
source: "Too many delayed threads in use"
rus: "Слишком много потоков, обслуживающих отложенную вставку (delayed insert)"

# ER_ABORTING_CONNECTION 08S01
source: "Aborted connection %ld to db: '%-.192s' user: '%-.48s' (%-.64s)"
rus: "Прервано соединение %ld к базе данных '%-.192s' пользователя '%-.48s' (%-.64s)"

# ER_NET_PACKET_TOO_LARGE 08S01
source: "Got a packet bigger than 'max_allowed_packet' bytes"
rus: "Полученный пакет больше, чем 'max_allowed_packet'"

# ER_NET_READ_ERROR_FROM_PIPE 08S01
source: "Got a read error from the connection pipe"
rus: "Получена ошибка чтения от потока соединения (connection pipe)"

# ER_NET_FCNTL_ERROR 08S01
source: "Got an error from fcntl()"
rus: "Получена ошибка от fcntl()"

# ER_NET_PACKETS_OUT_OF_ORDER 08S01
source: "Got packets out of order"
rus: "Пакеты получены в неверном порядке"

# ER_NET_UNCOMPRESS_ERROR 08S01
source: "Couldn't uncompress communication packet"
rus: "Невозможно распаковать пакет, полученный через коммуникационный протокол"

# ER_NET_READ_ERROR 08S01
source: "Got an error reading communication packets"
rus: "Получена ошибка в процессе получения пакета через коммуникационный протокол "

# ER_NET_READ_INTERRUPTED 08S01
source: "Got timeout reading communication packets"
rus: "Получен таймаут ожидания пакета через коммуникационный протокол "

# ER_NET_ERROR_ON_WRITE 08S01
source: "Got an error writing communication packets"
rus: "Получена ошибка при передаче пакета через коммуникационный протокол "

# ER_NET_WRITE_INTERRUPTED 08S01
source: "Got timeout writing communication packets"
rus: "Получен таймаут в процессе передачи пакета через коммуникационный протокол "
