Repository: vladbogo/test-translation
Catalog: rus.xlf
Languages: rus

# ER_TOO_LONG_STRING 42000
source: "Result string is longer than 'max_allowed_packet' bytes"
rus: "Результирующая строка больше, чем 'max_allowed_packet'"

# ER_TABLE_CANT_HANDLE_BLOB 42000
source: "Storage engine %s doesn't support BLOB/TEXT columns"
rus: "%s таблицы не поддерживают типы BLOB/TEXT"

# ER_TABLE_CANT_HANDLE_AUTO_INCREMENT 42000
source: "Storage engine %s doesn't support AUTO_INCREMENT columns"
rus: "%s таблицы не поддерживают автоинкрементные столбцы"

# ER_DELAYED_INSERT_TABLE_LOCKED
source: "INSERT DELAYED can't be used with table '%-.192s' because it is locked with LOCK TABLES"
rus: "Нельзя использовать INSERT DELAYED для таблицы '%-.192s', потому что она заблокирована с помощью LOCK TABLES"

# ER_WRONG_COLUMN_NAME 42000
source: "Incorrect column name '%-.100s'"
rus: "Неверное имя столбца '%-.100s'"

# ER_WRONG_KEY_COLUMN 42000
source: "The storage engine %s can't index column %`s"
rus: "Обработчик таблиц %s не может проиндексировать столбец %`s"

# ER_WRONG_MRG_TABLE
source: "Unable to open underlying table which is differently defined or of non-MyISAM type or doesn't exist"
rus: "Не все таблицы в MERGE определены одинаково"

# ER_DUP_UNIQUE 23000
source: "Can't write, because of unique constraint, to table '%-.192s'"
rus: "Невозможно записать в таблицу '%-.192s' из-за ограничений уникального ключа"

# ER_BLOB_KEY_WITHOUT_LENGTH 42000
source: "BLOB/TEXT column '%-.192s' used in key specification without a key length"
rus: "Столбец типа BLOB '%-.192s' был указан в определении ключа без указания длины ключа"

# ER_PRIMARY_CANT_HAVE_NULL 42000
source: "All parts of a PRIMARY KEY must be NOT NULL; if you need NULL in a key, use UNIQUE instead"
rus: "Все части первичного ключа (PRIMARY KEY) должны быть определены как NOT NULL; Если вам нужна поддержка величин NULL в ключе, воспользуйтесь индексом UNIQUE"

# ER_TOO_MANY_ROWS 42000
source: "Result consisted of more than one row"
rus: "В результате возвращена более чем одна строка"

# ER_REQUIRES_PRIMARY_KEY 42000
source: "This table type requires a primary key"
rus: "Этот тип таблицы требует определения первичного ключа"

# ER_NO_RAID_COMPILED
source: "This version of MariaDB is not compiled with RAID support"
rus: "Эта версия MariaDB скомпилирована без поддержки RAID"

# ER_UPDATE_WITHOUT_KEY_IN_SAFE_MODE
source: "You are using safe update mode and you tried to update a table without a WHERE that uses a KEY column"
rus: "Вы работаете в режиме безопасных обновлений (safe update mode) и попробовали изменить таблицу без использования ключевого столбца в части WHERE"

# ER_KEY_DOES_NOT_EXISTS 42000 S1009
source: "Key '%-.192s' doesn't exist in table '%-.192s'"
rus: "Ключ '%-.192s' не существует в таблице '%-.192s'"

# ER_CHECK_NO_SUCH_TABLE 42000
source: "Can't open table"
rus: "Невозможно открыть таблицу"

# ER_CHECK_NOT_IMPLEMENTED 42000
source: "The storage engine for the table doesn't support %s"
rus: "Обработчик таблицы не поддерживает этого: %s"

# ER_CANT_DO_THIS_DURING_AN_TRANSACTION 25000
source: "You are not allowed to execute this command in a transaction"
rus: "Вам не разрешено выполнять эту команду в транзакции"

# ER_ERROR_DURING_COMMIT
source: "Got error %M during COMMIT"
rus: "Получена ошибка %M в процессе COMMIT"

# ER_ERROR_DURING_ROLLBACK
source: "Got error %M during ROLLBACK"
rus: "Получена ошибка %M в процессе ROLLBACK"

# ER_ERROR_DURING_FLUSH_LOGS
source: "Got error %M during FLUSH_LOGS"
rus: "Получена ошибка %M в процессе FLUSH_LOGS"

# ER_ERROR_DURING_CHECKPOINT
source: "Got error %M during CHECKPOINT"
rus: "Получена ошибка %M в процессе CHECKPOINT"

# ER_NEW_ABORTING_CONNECTION 08S01
source: "Aborted connection %lld to db: '%-.192s' user: '%-.48s' host: '%-.64s' (%-.64s)"
rus: "Прервано соединение %lld к базе данных '%-.192s' пользователя '%-.48s' с хоста '%-.64s' (%-.64s)"

# ER_FLUSH_MASTER_BINLOG_CLOSED
source: "Binlog closed, cannot RESET MASTER"
rus: "Двоичный журнал обновления закрыт, невозможно выполнить RESET MASTER"

# ER_INDEX_REBUILD
source: "Failed rebuilding the index of dumped table '%-.192s'"
rus: "Ошибка перестройки индекса сохраненной таблицы '%-.192s'"

# ER_MASTER
source: "Error from master: '%-.64s'"
rus: "Ошибка от головного сервера: '%-.64s'"

# ER_MASTER_NET_READ 08S01
source: "Net error reading from master"
rus: "Возникла ошибка чтения в процессе коммуникации с головным сервером"

# ER_MASTER_NET_WRITE 08S01
source: "Net error writing to master"
rus: "Возникла ошибка записи в процессе коммуникации с головным сервером"

# ER_FT_MATCHING_KEY_NOT_FOUND
source: "Can't find FULLTEXT index matching the column list"
rus: "Невозможно отыскать полнотекстовый (FULLTEXT) индекс, соответствующий списку столбцов"

# ER_LOCK_OR_ACTIVE_TRANSACTION
source: "Can't execute the given command because you have active locked tables or an active transaction"
rus: "Невозможно выполнить указанную команду, поскольку у вас присутствуют активно заблокированные таблица или открытая транзакция"

# ER_UNKNOWN_SYSTEM_VARIABLE
source: "Unknown system variable '%-.*s'"
rus: "Неизвестная системная переменная '%-.*s'"

# ER_CRASHED_ON_USAGE
source: "Table '%-.192s' is marked as crashed and should be repaired"
rus: "Таблица '%-.192s' помечена как испорченная и должна пройти проверку и ремонт"

# ER_CRASHED_ON_REPAIR
source: "Table '%-.192s' is marked as crashed and last (automatic?) repair failed"
rus: "Таблица '%-.192s' помечена как испорченная и последний (автоматический?) ремонт не был успешным"

# ER_WARNING_NOT_COMPLETE_ROLLBACK
source: "Some non-transactional changed tables couldn't be rolled back"
rus: "Внимание: по некоторым измененным нетранзакционным таблицам невозможно будет произвести откат транзакции"

# ER_TRANS_CACHE_FULL
source: "Multi-statement transaction required more than 'max_binlog_cache_size' bytes of storage; increase this mariadbd variable and try again"
rus: "Транзакции, включающей большое количество команд, потребовалось более чем 'max_binlog_cache_size' байт. Увеличьте эту переменную сервера mariadbd и попробуйте еще раз"

# ER_SLAVE_MUST_STOP
source: "This operation cannot be performed as you have a running slave '%2$*1$s'; run STOP SLAVE '%2$*1$s' first"
rus: "Эту операцию невозможно выполнить при работающем потоке подчиненного сервера %2$*1$s. Сначала выполните STOP SLAVE '%2$*1$s'"

# ER_SLAVE_NOT_RUNNING
source: "This operation requires a running slave; configure slave and do START SLAVE"
rus: "Для этой операции требуется работающий подчиненный сервер. Сначала выполните START SLAVE"

# ER_BAD_SLAVE
source: "The server is not configured as slave; fix in config file or with CHANGE MASTER TO"
rus: "Этот сервер не настроен как подчиненный. Внесите исправления в конфигурационном файле или с помощью CHANGE MASTER TO"

# ER_SLAVE_THREAD
source: "Could not create slave thread; check system resources"
rus: "Невозможно создать поток подчиненного сервера. Проверьте системные ресурсы"

# ER_TOO_MANY_USER_CONNECTIONS 42000
source: "User %-.64s already has more than 'max_user_connections' active connections"
rus: "У пользователя %-.64s уже больше чем 'max_user_connections' активных соединений"

# ER_SET_CONSTANTS_ONLY
source: "You may only use constant expressions in this statement"
rus: "С этой командой вы можете использовать только константные выражения"

# ER_LOCK_WAIT_TIMEOUT
source: "Lock wait timeout exceeded; try restarting transaction"
rus: "Таймаут ожидания блокировки истек; попробуйте перезапустить транзакцию"

# ER_LOCK_TABLE_FULL
source: "The total number of locks exceeds the lock table size"
rus: "Общее количество блокировок превысило размеры таблицы блокировок"

# ER_READ_ONLY_TRANSACTION 25000
source: "Update locks cannot be acquired during a READ UNCOMMITTED transaction"
rus: "Блокировки обновлений нельзя получить в процессе чтения не принятой (в режиме READ UNCOMMITTED) транзакции"

# ER_DROP_DB_WITH_READ_LOCK
source: "DROP DATABASE not allowed while thread is holding global read lock"
rus: "Не допускается DROP DATABASE, пока поток держит глобальную блокировку чтения"

# ER_CREATE_DB_WITH_READ_LOCK
source: "CREATE DATABASE not allowed while thread is holding global read lock"
rus: "Не допускается CREATE DATABASE, пока поток держит глобальную блокировку чтения"

# ER_WRONG_ARGUMENTS
source: "Incorrect arguments to %s"
rus: "Неверные параметры для %s"

# ER_NO_PERMISSION_TO_CREATE_USER 42000
source: "'%s'@'%s' is not allowed to create new users"
rus: "'%s'@'%s' не разрешается создавать новых пользователей"

# ER_UNION_TABLES_IN_DIFFERENT_DIR
source: "Incorrect table definition; all MERGE tables must be in the same database"
rus: "Неверное определение таблицы; Все таблицы в MERGE должны принадлежать одной и той же базе данных"

# ER_LOCK_DEADLOCK 40001
source: "Deadlock found when trying to get lock; try restarting transaction"
rus: "Возникла тупиковая ситуация в процессе получения блокировки; Попробуйте перезапустить транзакцию"

# ER_TABLE_CANT_HANDLE_FT
source: "The storage engine %s doesn't support FULLTEXT indexes"
rus: "Используемый тип таблиц (%s) не поддерживает полнотекстовых индексов"

# ER_CANNOT_ADD_FOREIGN
source: "Cannot add foreign key constraint for `%s`"
rus: "Невозможно добавить ограничения внешнего ключа для `%s`"

# ER_NO_REFERENCED_ROW 23000
source: "Cannot add or update a child row: a foreign key constraint fails"
rus: "Невозможно добавить или обновить дочернюю строку: проверка ограничений внешнего ключа не выполняется"

# ER_ROW_IS_REFERENCED 23000
source: "Cannot delete or update a parent row: a foreign key constraint fails"
rus: "Невозможно удалить или обновить родительскую строку: проверка ограничений внешнего ключа не выполняется"

# ER_CONNECT_TO_MASTER 08S01
source: "Error connecting to master: %-.128s"
rus: "Ошибка соединения с головным сервером: %-.128s"

# ER_QUERY_ON_MASTER
source: "Error running query on master: %-.128s"
rus: "Ошибка выполнения запроса на головном сервере: %-.128s"

# ER_ERROR_WHEN_EXECUTING_COMMAND
source: "Error when executing command %s: %-.128s"
rus: "Ошибка при выполнении команды %s: %-.128s"

# ER_WRONG_USAGE
source: "Incorrect usage of %s and %s"
rus: "Неверное использование %s и %s"

# ER_WRONG_NUMBER_OF_COLUMNS_IN_SELECT 21000
source: "The used SELECT statements have a different number of columns"
rus: "Использованные операторы выборки (SELECT) дают разное количество столбцов"

# ER_CANT_UPDATE_WITH_READLOCK
source: "Can't execute the query because you have a conflicting read lock"
rus: "Невозможно исполнить запрос, поскольку у вас установлены конфликтующие блокировки чтения"

# ER_MIXING_NOT_ALLOWED
source: "Mixing of transactional and non-transactional tables is disabled"
rus: "Использование транзакционных таблиц наряду с нетранзакционными запрещено"

# ER_DUP_ARGUMENT
source: "Option '%s' used twice in statement"
rus: "Опция '%s' дважды использована в выражении"

# ER_USER_LIMIT_REACHED 42000
source: "User '%-.64s' has exceeded the '%s' resource (current value: %ld)"
rus: "Пользователь '%-.64s' превысил использование ресурса '%s' (текущее значение: %ld)"

# ER_SPECIFIC_ACCESS_DENIED_ERROR 42000
source: "Access denied; you need (at least one of) the %-.128s privilege(s) for this operation"
rus: "В доступе отказано. Вам нужны привилегии %-.128s для этой операции"

# ER_LOCAL_VARIABLE
source: "Variable '%-.64s' is a SESSION variable and can't be used with SET GLOBAL"
rus: "Переменная '%-.64s' является потоковой (SESSION) переменной и не может быть изменена с помощью SET GLOBAL"

# ER_GLOBAL_VARIABLE
source: "Variable '%-.64s' is a GLOBAL variable and should be set with SET GLOBAL"
rus: "Переменная '%-.64s' является глобальной (GLOBAL) переменной, и ее следует изменять с помощью SET GLOBAL"

# ER_NO_DEFAULT 42000
source: "Variable '%-.64s' doesn't have a default value"
rus: "Переменная '%-.64s' не имеет значения по умолчанию"

# ER_WRONG_VALUE_FOR_VAR 42000
source: "Variable '%-.64s' can't be set to the value of '%-.200T'"
rus: "Переменная '%-.64s' не может быть установлена в значение '%-.200T'"

# ER_WRONG_TYPE_FOR_VAR 42000
source: "Incorrect argument type to variable '%-.64s'"
rus: "Неверный тип аргумента для переменной '%-.64s'"

# ER_VAR_CANT_BE_READ
source: "Variable '%-.64s' can only be set, not read"
rus: "Переменная '%-.64s' может быть только установлена, но не считана"

# ER_CANT_USE_OPTION_HERE 42000
source: "Incorrect usage/placement of '%s'"
rus: "Неверное использование или в неверном месте указан '%s'"

# ER_NOT_SUPPORTED_YET 42000
source: "This version of MariaDB doesn't yet support '%s'"
rus: "Эта версия MariaDB пока еще не поддерживает '%s'"

# ER_MASTER_FATAL_ERROR_READING_BINLOG
source: "Got fatal error %d from master when reading data from binary log: '%-.320s'"
rus: "Получена неисправимая ошибка %d: '%-.320s' от головного сервера в процессе выборки данных из двоичного журнала"

# ER_OPERAND_COLUMNS 21000
source: "Operand should contain %d column(s)"
rus: "Операнд должен содержать %d колонок"

# ER_SUBQUERY_NO_1_ROW 21000
source: "Subquery returns more than 1 row"
rus: "Подзапрос возвращает более одной записи"

# ER_CYCLIC_REFERENCE
source: "Cyclic reference on subqueries"
rus: "Циклическая ссылка на подзапрос"

# ER_AUTO_CONVERT
source: "Converting column '%s' from %s to %s"
rus: "Преобразование поля '%s' из %s в %s"

# ER_ILLEGAL_REFERENCE 42S22
source: "Reference '%-.64s' not supported (%s)"
rus: "Ссылка '%-.64s' не поддерживается (%s)"

# ER_SELECT_REDUCED 01000
source: "Select %u was reduced during optimization"
rus: "Select %u был упразднен в процессе оптимизации"

# ER_SERVER_IS_IN_SECURE_AUTH_MODE
source: "Server is running in --secure-auth mode, but '%s'@'%s' has a password in the old format; please change the password to the new format"
rus: "Сервер запущен в режиме --secure-auth (безопасной авторизации), но для пользователя '%s'@'%s' пароль сохранён в старом формате; необходимо обновить формат пароля"

# ER_WARN_FIELD_RESOLVED
source: "Field or reference '%-.192s%s%-.192s%s%-.192s' of SELECT #%d was resolved in SELECT #%d"
rus: "Поле или ссылка '%-.192s%s%-.192s%s%-.192s' из SELECTа #%d была найдена в SELECTе #%d"

# ER_WARN_QC_RESIZE
source: "Query cache failed to set size %llu; new query cache size is %lu"
rus: "Кеш запросов не может установить размер %llu, новый размер кеша зпросов - %lu"

# ER_NON_UPDATABLE_TABLE
source: "The target table %-.100s of the %s is not updatable"
rus: "Таблица %-.100s в %s не может изменятся"

# ER_FPARSER_TOO_BIG_FILE
source: "Configuration file '%-.192s' is too big"
rus: "Слишком большой конфигурационный файл '%-.192s'"

# ER_FPARSER_BAD_HEADER
source: "Malformed file type header in file '%-.192s'"
rus: "Неверный заголовок типа файла '%-.192s'"

# ER_FPARSER_EOF_IN_COMMENT
source: "Unexpected end of file while parsing comment '%-.200s'"
rus: "Неожиданный конец файла в коментарии '%-.200s'"

# ER_FPARSER_ERROR_IN_PARAMETER
source: "Error while parsing parameter '%-.192s' (line: '%-.192s')"
rus: "Ошибка при распознавании параметра '%-.192s' (строка: '%-.192s')"

# ER_FPARSER_EOF_IN_UNKNOWN_PARAMETER
source: "Unexpected end of file while skipping unknown parameter '%-.192s'"
rus: "Неожиданный конец файла при пропуске неизвестного параметра '%-.192s'"

# ER_VIEW_NO_EXPLAIN
source: "ANALYZE/EXPLAIN/SHOW can not be issued; lacking privileges for underlying table"
rus: "ANALYZE/EXPLAIN/SHOW не может быть выполнено; недостаточно прав на таблицы запроса"

# ER_FRM_UNKNOWN_TYPE
source: "File '%-.192s' has unknown type '%-.64s' in its header"
rus: "Файл '%-.192s' содержит неизвестный тип '%-.64s' в заголовке"

# ER_WRONG_OBJECT
source: "'%-.192s.%-.192s' is not of type '%s'"
rus: "'%-.192s.%-.192s' - не %s"

# ER_NONUPDATEABLE_COLUMN
source: "Column '%-.192s' is not updatable"
rus: "Столбец '%-.192s' не обновляемый"

# ER_VIEW_SELECT_DERIVED
source: "View's SELECT contains a subquery in the FROM clause"
rus: "View SELECT содержит подзапрос в конструкции FROM"

# ER_VIEW_SELECT_CLAUSE
source: "View's SELECT contains a '%s' clause"
rus: "View SELECT содержит конструкцию '%s'"

# ER_VIEW_SELECT_VARIABLE
source: "View's SELECT contains a variable or parameter"
rus: "View SELECT содержит переменную или параметр"

# ER_VIEW_SELECT_TMPTABLE
source: "View's SELECT refers to a temporary table '%-.192s'"
rus: "View SELECT содержит ссылку на временную таблицу '%-.192s'"

# ER_VIEW_WRONG_LIST
source: "View's SELECT and view's field list have different column counts"
rus: "View SELECT и список полей view имеют разное количество столбцов"

# ER_WARN_VIEW_MERGE
source: "View merge algorithm can't be used here for now (assumed undefined algorithm)"
rus: "Алгоритм слияния view не может быть использован сейчас (алгоритм будет неопеределенным)"

# ER_WARN_VIEW_WITHOUT_KEY
source: "View being updated does not have complete key of underlying table in it"
rus: "Обновляемый view не содержит ключа использованных(ой) в нем таблиц(ы)"

# ER_VIEW_NONUPD_CHECK
source: "CHECK OPTION on non-updatable view %`-.192s.%`-.192s"
rus: "CHECK OPTION для необновляемого VIEW %`-.192s.%`-.192s"

# ER_VIEW_CHECK_FAILED 44000
source: "CHECK OPTION failed %`-.192s.%`-.192s"
rus: "Проверка CHECK OPTION для VIEW %`-.192s.%`-.192s провалилась"

# ER_VIEW_CHECKSUM
source: "View text checksum failed"
rus: "Проверка контрольной суммы текста VIEW провалилась"

# ER_VIEW_MULTIUPDATE
source: "Can not modify more than one base table through a join view '%-.192s.%-.192s'"
rus: "Нельзя изменить больше чем одну базовую таблицу используя многотабличный VIEW '%-.192s.%-.192s'"

# ER_VIEW_NO_INSERT_FIELD_LIST
source: "Can not insert into join view '%-.192s.%-.192s' without fields list"
rus: "Нельзя вставлять записи в многотабличный VIEW '%-.192s.%-.192s' без списка полей"

# ER_VIEW_DELETE_MERGE_VIEW
source: "Can not delete from join view '%-.192s.%-.192s'"
rus: "Нельзя удалять из многотабличного VIEW '%-.192s.%-.192s'"

# ER_XAER_RMFAIL XAE07
source: "XAER_RMFAIL: The command cannot be executed when global transaction is in the %.64s state"
rus: "XAER_RMFAIL: эту команду нельзя выполнять когда глобальная транзакция находится в состоянии '%.64s'"

# ER_DUP_ENTRY_WITH_KEY_NAME 23000 S1009
source: "Duplicate entry '%-.64T' for key '%-.192s'"
rus: "Дублирующаяся запись '%-.64T' по ключу '%-.192s'"

# ER_ACCESS_DENIED_NO_PASSWORD_ERROR 28000
source: "Access denied for user '%s'@'%s'"
rus: "Доступ закрыт для пользователя '%s'@'%s'"

# ER_UNKNOWN_EXPLAIN_FORMAT
source: "Unknown %s format name: '%s'"
rus: "Неизвестное имя формата команды %s: '%s'"

# ER_INVALID_YEAR_COLUMN_LENGTH
source: "YEAR(%lu) column type is deprecated. Creating YEAR(4) column instead"
rus: "Тип YEAR(%lu) более не поддерживается, вместо него будет создана колонка с типом YEAR(4)"

# ER_DUP_UNKNOWN_IN_INDEX 23000
source: "Duplicate entry for key '%-.192s'"
rus: "Дублирующаяся запись по ключу '%-.192s'"

# ER_NO_SUCH_QUERY
source: "Unknown query id: %lld"
rus: "Неизвестный номер запроса: %lld"

# ER_PLUGIN_INSTALLED
source: "Plugin '%-.192s' already installed"
rus: "Плагин '%-.192s' уже установлен"

# ER_KILL_QUERY_DENIED_ERROR
source: "You are not owner of query %lu"
rus: "Вы не являетесь владельцем запроса %lu"

# ER_CONSTRAINT_FAILED 23000
source: "CONSTRAINT %`s failed for %`-.192s.%`-.192s"
rus: "проверка CONSTRAINT %`s для %`-.192s.%`-.192s провалилась"

# ER_WRONG_PARAMCOUNT_TO_CURSOR 42000
source: "Incorrect parameter count to cursor '%-.192s'"
rus: "Некорректное количество параметров для курсора '%-.192s'"
