Repository: vladbogo/test-translation
Catalog: serbian.xlf
Languages: serbian

# ER_DELAYED_INSERT_TABLE_LOCKED
source: "INSERT DELAYED can't be used with table '%-.192s' because it is locked with LOCK TABLES"
serbian: "Komanda 'INSERT DELAYED' ne može biti iskorištena u tabeli '%-.192s', zbog toga što je zaključana komandom 'LOCK TABLES'"

# ER_WRONG_COLUMN_NAME 42000
source: "Incorrect column name '%-.100s'"
serbian: "Pogrešno ime kolone '%-.100s'"

# ER_WRONG_MRG_TABLE
source: "Unable to open underlying table which is differently defined or of non-MyISAM type or doesn't exist"
serbian: "Tabele iskorištene u 'MERGE' tabeli nisu definisane na isti način"

# ER_DUP_UNIQUE 23000
source: "Can't write, because of unique constraint, to table '%-.192s'"
serbian: "Zbog provere jedinstvenosti ne mogu da upišem podatke u tabelu '%-.192s'"

# ER_BLOB_KEY_WITHOUT_LENGTH 42000
source: "BLOB/TEXT column '%-.192s' used in key specification without a key length"
serbian: "BLOB kolona '%-.192s' je upotrebljena u specifikaciji ključa bez navođenja dužine ključa"

# ER_PRIMARY_CANT_HAVE_NULL 42000
source: "All parts of a PRIMARY KEY must be NOT NULL; if you need NULL in a key, use UNIQUE instead"
serbian: "Svi delovi primarnog ključa moraju biti različiti od NULL; Ako Vam ipak treba NULL vrednost u ključu, upotrebite 'UNIQUE'"

# ER_TOO_MANY_ROWS 42000
source: "Result consisted of more than one row"
serbian: "Rezultat je sačinjen od više slogova"

# ER_REQUIRES_PRIMARY_KEY 42000
source: "This table type requires a primary key"
serbian: "Ovaj tip tabele zahteva da imate definisan primarni ključ"

# ER_NO_RAID_COMPILED
source: "This version of MariaDB is not compiled with RAID support"
serbian: "Ova verzija MariaDB servera nije kompajlirana sa podrškom za RAID uređaje"

# ER_UPDATE_WITHOUT_KEY_IN_SAFE_MODE
source: "You are using safe update mode and you tried to update a table without a WHERE that uses a KEY column"
serbian: "Vi koristite safe update mod servera, a probali ste da promenite podatke bez 'WHERE' komande koja koristi kolonu ključa"

# ER_KEY_DOES_NOT_EXISTS 42000 S1009
source: "Key '%-.192s' doesn't exist in table '%-.192s'"
serbian: "Ključ '%-.192s' ne postoji u tabeli '%-.192s'"

# ER_CHECK_NO_SUCH_TABLE 42000
source: "Can't open table"
serbian: "Ne mogu da otvorim tabelu"

# ER_CHECK_NOT_IMPLEMENTED 42000
source: "The storage engine for the table doesn't support %s"
serbian: "Handler za ovu tabelu ne dozvoljava %s komande"

# ER_CANT_DO_THIS_DURING_AN_TRANSACTION 25000
source: "You are not allowed to execute this command in a transaction"
serbian: "Nije Vam dozvoljeno da izvršite ovu komandu u transakciji"

# ER_ERROR_DURING_COMMIT
source: "Got error %M during COMMIT"
serbian: "Greška %M za vreme izvršavanja komande 'COMMIT'"

# ER_ERROR_DURING_ROLLBACK
source: "Got error %M during ROLLBACK"
serbian: "Greška %M za vreme izvršavanja komande 'ROLLBACK'"

# ER_ERROR_DURING_FLUSH_LOGS
source: "Got error %M during FLUSH_LOGS"
serbian: "Greška %M za vreme izvršavanja komande 'FLUSH_LOGS'"

# ER_ERROR_DURING_CHECKPOINT
source: "Got error %M during CHECKPOINT"
serbian: "Greška %M za vreme izvršavanja komande 'CHECKPOINT'"

# ER_NEW_ABORTING_CONNECTION 08S01
source: "Aborted connection %lld to db: '%-.192s' user: '%-.48s' host: '%-.64s' (%-.64s)"
serbian: "Prekinuta konekcija broj %lld ka bazi: '%-.192s' korisnik je bio: '%-.48s' a host: '%-.64s' (%-.64s)"

# ER_FLUSH_MASTER_BINLOG_CLOSED
source: "Binlog closed, cannot RESET MASTER"
serbian: "Binarni log file zatvoren, ne mogu da izvršim komandu 'RESET MASTER'"

# ER_INDEX_REBUILD
source: "Failed rebuilding the index of dumped table '%-.192s'"
serbian: "Izgradnja indeksa dump-ovane tabele '%-.192s' nije uspela"

# ER_MASTER
source: "Error from master: '%-.64s'"
serbian: "Greška iz glavnog servera '%-.64s' u klasteru"

# ER_MASTER_NET_READ 08S01
source: "Net error reading from master"
serbian: "Greška u primanju mrežnih paketa sa glavnog servera u klasteru"

# ER_MASTER_NET_WRITE 08S01
source: "Net error writing to master"
serbian: "Greška u slanju mrežnih paketa na glavni server u klasteru"

# ER_FT_MATCHING_KEY_NOT_FOUND
source: "Can't find FULLTEXT index matching the column list"
serbian: "Ne mogu da pronađem 'FULLTEXT' indeks koli odgovara listi kolona"

# ER_LOCK_OR_ACTIVE_TRANSACTION
source: "Can't execute the given command because you have active locked tables or an active transaction"
serbian: "Ne mogu da izvršim datu komandu zbog toga što su tabele zaključane ili je transakcija u toku"

# ER_UNKNOWN_SYSTEM_VARIABLE
source: "Unknown system variable '%-.*s'"
serbian: "Nepoznata sistemska promenljiva '%-.*s'"

# ER_CRASHED_ON_USAGE
source: "Table '%-.192s' is marked as crashed and should be repaired"
serbian: "Tabela '%-.192s' je markirana kao oštećena i trebala bi biti popravljena"

# ER_CRASHED_ON_REPAIR
source: "Table '%-.192s' is marked as crashed and last (automatic?) repair failed"
serbian: "Tabela '%-.192s' je markirana kao oštećena, a zadnja (automatska?) popravka je bila neuspela"

# ER_WARNING_NOT_COMPLETE_ROLLBACK
source: "Some non-transactional changed tables couldn't be rolled back"
serbian: "Upozorenje: Neke izmenjene tabele ne podržavaju komandu 'ROLLBACK'"

# ER_SLAVE_MUST_STOP
source: "This operation cannot be performed as you have a running slave '%2$*1$s'; run STOP SLAVE '%2$*1$s' first"
serbian: "Ova operacija ne može biti izvršena dok je aktivan podređeni '%2$*1$s' server. Zadajte prvo komandu 'STOP SLAVE '%2$*1$s'' da zaustavite podređeni server"

# ER_SLAVE_NOT_RUNNING
source: "This operation requires a running slave; configure slave and do START SLAVE"
serbian: "Ova operacija zahteva da je aktivan podređeni server. Konfigurišite prvo podređeni server i onda izvršite komandu 'START SLAVE'"

# ER_BAD_SLAVE
source: "The server is not configured as slave; fix in config file or with CHANGE MASTER TO"
serbian: "Server nije konfigurisan kao podređeni server, ispravite konfiguracioni file ili na njemu izvršite komandu 'CHANGE MASTER TO'"

# ER_MASTER_INFO
source: "Could not initialize master info structure for '%.*s'; more error messages can be found in the MariaDB error log"
serbian: "Nisam mogao da inicijalizujem informacionu strukturu glavnog servera, proverite da li imam privilegije potrebne za pristup file-u 'master.info' '%.*s'"

# ER_SLAVE_THREAD
source: "Could not create slave thread; check system resources"
serbian: "Nisam mogao da startujem thread za podređeni server, proverite sistemske resurse"

# ER_TOO_MANY_USER_CONNECTIONS 42000
source: "User %-.64s already has more than 'max_user_connections' active connections"
serbian: "Korisnik %-.64s već ima više aktivnih konekcija nego što je to određeno 'max_user_connections' promenljivom"

# ER_SET_CONSTANTS_ONLY
source: "You may only use constant expressions in this statement"
serbian: "Možete upotrebiti samo konstantan iskaz sa komandom 'SET'"

# ER_LOCK_WAIT_TIMEOUT
source: "Lock wait timeout exceeded; try restarting transaction"
serbian: "Vremenski limit za zaključavanje tabele je istekao; Probajte da ponovo startujete transakciju"

# ER_LOCK_TABLE_FULL
source: "The total number of locks exceeds the lock table size"
serbian: "Broj totalnih zaključavanja tabele premašuje veličinu tabele zaključavanja"

# ER_READ_ONLY_TRANSACTION 25000
source: "Update locks cannot be acquired during a READ UNCOMMITTED transaction"
serbian: "Zaključavanja izmena ne mogu biti realizovana sve dok traje 'READ UNCOMMITTED' transakcija"

# ER_DROP_DB_WITH_READ_LOCK
source: "DROP DATABASE not allowed while thread is holding global read lock"
serbian: "Komanda 'DROP DATABASE' nije dozvoljena dok thread globalno zaključava čitanje podataka"

# ER_CREATE_DB_WITH_READ_LOCK
source: "CREATE DATABASE not allowed while thread is holding global read lock"
serbian: "Komanda 'CREATE DATABASE' nije dozvoljena dok thread globalno zaključava čitanje podataka"

# ER_WRONG_ARGUMENTS
source: "Incorrect arguments to %s"
serbian: "Pogrešni argumenti prosleđeni na %s"

# ER_NO_PERMISSION_TO_CREATE_USER 42000
source: "'%s'@'%s' is not allowed to create new users"
serbian: "Korisniku '%s'@'%s' nije dozvoljeno da kreira nove korisnike"

# ER_UNION_TABLES_IN_DIFFERENT_DIR
source: "Incorrect table definition; all MERGE tables must be in the same database"
serbian: "Pogrešna definicija tabele; sve 'MERGE' tabele moraju biti u istoj bazi podataka"

# ER_LOCK_DEADLOCK 40001
source: "Deadlock found when trying to get lock; try restarting transaction"
serbian: "Unakrsno zaključavanje pronađeno kada sam pokušao da dobijem pravo na zaključavanje; Probajte da restartujete transakciju"

# ER_TABLE_CANT_HANDLE_FT
source: "The storage engine %s doesn't support FULLTEXT indexes"
serbian: "Upotrebljeni tip tabele (%s) ne podržava 'FULLTEXT' indekse"

# ER_CANNOT_ADD_FOREIGN
source: "Cannot add foreign key constraint for `%s`"
serbian: "Ne mogu da dodam proveru spoljnog ključa na `%s`"

# ER_ROW_IS_REFERENCED 23000
source: "Cannot delete or update a parent row: a foreign key constraint fails"
serbian: "Ne mogu da izbrišem roditeljski slog: provera spoljnog ključa je neuspela"

# ER_ERROR_WHEN_EXECUTING_COMMAND
source: "Error when executing command %s: %-.128s"
serbian: "Greška pri izvršavanju komande %s: %-.128s"

# ER_WRONG_USAGE
source: "Incorrect usage of %s and %s"
serbian: "Pogrešna upotreba %s i %s"

# ER_WRONG_NUMBER_OF_COLUMNS_IN_SELECT 21000
source: "The used SELECT statements have a different number of columns"
serbian: "Upotrebljene 'SELECT' komande adresiraju različit broj kolona"

# ER_CANT_UPDATE_WITH_READLOCK
source: "Can't execute the query because you have a conflicting read lock"
serbian: "Ne mogu da izvršim upit zbog toga što imate zaključavanja čitanja podataka u konfliktu"

# ER_MIXING_NOT_ALLOWED
source: "Mixing of transactional and non-transactional tables is disabled"
serbian: "Mešanje tabela koje podržavaju transakcije i onih koje ne podržavaju transakcije je isključeno"

# ER_INCORRECT_GLOBAL_LOCAL_VAR
source: "Variable '%-.192s' is a %s variable"
serbian: "Promenljiva '%-.192s' je %s promenljiva"

# ER_DUP_ENTRY_WITH_KEY_NAME 23000 S1009
source: "Duplicate entry '%-.64T' for key '%-.192s'"
serbian: "Dupliran unos '%-.64T' za ključ '%-.192s'"

# ER_ACCESS_DENIED_NO_PASSWORD_ERROR 28000
source: "Access denied for user '%s'@'%s'"
serbian: "Pristup je zabranjen korisniku '%s'@'%s'"

# ER_DUP_UNKNOWN_IN_INDEX 23000
source: "Duplicate entry for key '%-.192s'"
serbian: "Dupliran unos za ključ '%-.192s'"
