Repository: vladbogo/test-translation
Catalog: serbian.xlf
Languages: serbian

# ER_NO
source: "NO"
serbian: "NE"

# ER_YES
source: "YES"
serbian: "DA"

# ER_CANT_CREATE_FILE
source: "Can't create file '%-.200s' (errno: %M)"
serbian: "Ne mogu da kreiram file '%-.200s' (errno: %M)"

# ER_CANT_CREATE_TABLE
source: "Can't create table %`s.%`s (errno: %M)"
serbian: "Ne mogu da kreiram tabelu %`s.%`s (errno: %M)"

# ER_CANT_CREATE_DB
source: "Can't create database '%-.192s' (errno: %M)"
serbian: "Ne mogu da kreiram bazu '%-.192s' (errno: %M)"

# ER_DB_CREATE_EXISTS
source: "Can't create database '%-.192s'; database exists"
serbian: "Ne mogu da kreiram bazu '%-.192s'; baza već postoji"

# ER_DB_DROP_EXISTS
source: "Can't drop database '%-.192s'; database doesn't exist"
serbian: "Ne mogu da izbrišem bazu '%-.192s'; baza ne postoji"

# ER_DB_DROP_DELETE
source: "Error dropping database (can't delete '%-.192s', errno: %M)"
serbian: "Ne mogu da izbrišem bazu (ne mogu da izbrišem '%-.192s', errno: %M)"

# ER_DB_DROP_RMDIR
source: "Error dropping database (can't rmdir '%-.192s', errno: %M)"
serbian: "Ne mogu da izbrišem bazu (ne mogu da izbrišem direktorijum '%-.192s', errno: %M)"

# ER_CANT_DELETE_FILE
source: "Error on delete of '%-.192s' (errno: %M)"
serbian: "Greška pri brisanju '%-.192s' (errno: %M)"

# ER_CANT_FIND_SYSTEM_REC
source: "Can't read record in system table"
serbian: "Ne mogu da pročitam slog iz sistemske tabele"

# ER_CANT_GET_STAT
source: "Can't get status of '%-.200s' (errno: %M)"
serbian: "Ne mogu da dobijem stanje file-a '%-.200s' (errno: %M)"

# ER_CANT_GET_WD
source: "Can't get working directory (errno: %M)"
serbian: "Ne mogu da dobijem trenutni direktorijum (errno: %M)"

# ER_CANT_LOCK
source: "Can't lock file (errno: %M)"
serbian: "Ne mogu da zaključam file (errno: %M)"

# ER_CANT_OPEN_FILE
source: "Can't open file: '%-.200s' (errno: %M)"
serbian: "Ne mogu da otvorim file: '%-.200s' (errno: %M)"

# ER_FILE_NOT_FOUND
source: "Can't find file: '%-.200s' (errno: %M)"
serbian: "Ne mogu da pronađem file: '%-.200s' (errno: %M)"

# ER_CANT_READ_DIR
source: "Can't read dir of '%-.192s' (errno: %M)"
serbian: "Ne mogu da pročitam direktorijum '%-.192s' (errno: %M)"

# ER_CANT_SET_WD
source: "Can't change dir to '%-.192s' (errno: %M)"
serbian: "Ne mogu da promenim direktorijum na '%-.192s' (errno: %M)"

# ER_CHECKREAD
source: "Record has changed since last read in table '%-.192s'"
serbian: "Slog je promenjen od zadnjeg čitanja tabele '%-.192s'"

# ER_DISK_FULL
source: "Disk full (%s); waiting for someone to free some space... (errno: %M)"
serbian: "Disk je pun (%s). Čekam nekoga da dođe i oslobodi nešto mesta... (errno: %M)"

# ER_DUP_KEY 23000
source: "Can't write; duplicate key in table '%-.192s'"
serbian: "Ne mogu da pišem pošto postoji duplirani ključ u tabeli '%-.192s'"

# ER_ERROR_ON_CLOSE
source: "Error on close of '%-.192s' (errno: %M)"
serbian: "Greška pri zatvaranju '%-.192s' (errno: %M)"

# ER_ERROR_ON_READ
source: "Error reading file '%-.200s' (errno: %M)"
serbian: "Greška pri čitanju file-a '%-.200s' (errno: %M)"

# ER_ERROR_ON_RENAME
source: "Error on rename of '%-.210s' to '%-.210s' (errno: %M)"
serbian: "Greška pri promeni imena '%-.210s' na '%-.210s' (errno: %M)"

# ER_ERROR_ON_WRITE
source: "Error writing file '%-.200s' (errno: %M)"
serbian: "Greška pri upisu '%-.200s' (errno: %M)"

# ER_FILE_USED
source: "'%-.192s' is locked against change"
serbian: "'%-.192s' je zaključan za upis"

# ER_FILSORT_ABORT
source: "Sort aborted"
serbian: "Sortiranje je prekinuto"

# ER_FORM_NOT_FOUND
source: "View '%-.192s' doesn't exist for '%-.192s'"
serbian: "View '%-.192s' ne postoji za '%-.192s'"

# ER_KEY_NOT_FOUND
source: "Can't find record in '%-.192s'"
serbian: "Ne mogu da pronađem slog u '%-.192s'"

# ER_NOT_FORM_FILE
source: "Incorrect information in file: '%-.200s'"
serbian: "Pogrešna informacija u file-u: '%-.200s'"

# ER_NOT_KEYFILE
source: "Index for table '%-.200s' is corrupt; try to repair it"
serbian: "Pogrešan key file za tabelu: '%-.200s'; probajte da ga ispravite"

# ER_OLD_KEYFILE
source: "Old key file for table '%-.192s'; repair it!"
serbian: "Zastareo key file za tabelu '%-.192s'; ispravite ga"

# ER_OPEN_AS_READONLY
source: "Table '%-.192s' is read only"
serbian: "Tabelu '%-.192s' je dozvoljeno samo čitati"

# ER_OUTOFMEMORY HY001 S1001
source: "Out of memory; restart server and try again (needed %d bytes)"
serbian: "Nema memorije. Restartujte MariaDB server i probajte ponovo (potrebno je %d byte-ova)"

# ER_OUT_OF_SORTMEMORY HY001 S1001
source: "Out of sort memory, consider increasing server sort buffer size"
serbian: "Nema memorije za sortiranje. Povećajte veličinu sort buffer-a MariaDB server-u"

# ER_UNEXPECTED_EOF
source: "Unexpected EOF found when reading file '%-.192s' (errno: %M)"
serbian: "Neočekivani kraj pri čitanju file-a '%-.192s' (errno: %M)"

# ER_CON_COUNT_ERROR 08004
source: "Too many connections"
serbian: "Previše konekcija"

# ER_OUT_OF_RESOURCES
source: "Out of memory."
serbian: "Nema memorije."

# ER_BAD_HOST_ERROR 08S01
source: "Can't get hostname for your address"
serbian: "Ne mogu da dobijem ime host-a za vašu IP adresu"

# ER_HANDSHAKE_ERROR 08S01
source: "Bad handshake"
serbian: "Loš početak komunikacije (handshake)"

# ER_DBACCESS_DENIED_ERROR 42000
source: "Access denied for user '%s'@'%s' to database '%-.192s'"
serbian: "Pristup je zabranjen korisniku '%s'@'%s' za bazu '%-.192s'"

# ER_ACCESS_DENIED_ERROR 28000
source: "Access denied for user '%s'@'%s' (using password: %s)"
serbian: "Pristup je zabranjen korisniku '%s'@'%s' (koristi lozinku: '%s')"

# ER_NO_DB_ERROR 3D000
source: "No database selected"
serbian: "Ni jedna baza nije selektovana"

# ER_UNKNOWN_COM_ERROR 08S01
source: "Unknown command"
serbian: "Nepoznata komanda"

# ER_BAD_NULL_ERROR 23000
source: "Column '%-.192s' cannot be null"
serbian: "Kolona '%-.192s' ne može biti NULL"

# ER_BAD_DB_ERROR 42000
source: "Unknown database '%-.192s'"
serbian: "Nepoznata baza '%-.192s'"

# ER_TABLE_EXISTS_ERROR 42S01
source: "Table '%-.192s' already exists"
serbian: "Tabela '%-.192s' već postoji"

# ER_BAD_TABLE_ERROR 42S02
source: "Unknown table '%-.100T'"
serbian: "Nepoznata tabela '%-.100T'"

# ER_NON_UNIQ_ERROR 23000
source: "Column '%-.192s' in %-.192s is ambiguous"
serbian: "Kolona '%-.192s' u %-.192s nije jedinstvena u kontekstu"

# ER_SERVER_SHUTDOWN 08S01
source: "Server shutdown in progress"
serbian: "Gašenje servera je u toku"

# ER_BAD_FIELD_ERROR 42S22 S0022
source: "Unknown column '%-.192s' in '%-.192s'"
serbian: "Nepoznata kolona '%-.192s' u '%-.192s'"

# ER_WRONG_FIELD_WITH_GROUP 42000 S1009
source: "'%-.192s' isn't in GROUP BY"
serbian: "Entitet '%-.192s' nije naveden u komandi 'GROUP BY'"

# ER_WRONG_GROUP_FIELD 42000 S1009
source: "Can't group on '%-.192s'"
serbian: "Ne mogu da grupišem po '%-.192s'"

# ER_WRONG_SUM_SELECT 42000 S1009
source: "Statement has sum functions and columns in same statement"
serbian: "Izraz ima 'SUM' agregatnu funkciju i kolone u isto vreme"

# ER_WRONG_VALUE_COUNT 21S01
source: "Column count doesn't match value count"
serbian: "Broj kolona ne odgovara broju vrednosti"

# ER_TOO_LONG_IDENT 42000 S1009
source: "Identifier name '%-.100T' is too long"
serbian: "Ime '%-.100T' je predugačko"

# ER_DUP_FIELDNAME 42S21 S1009
source: "Duplicate column name '%-.192s'"
serbian: "Duplirano ime kolone '%-.192s'"

# ER_DUP_KEYNAME 42000 S1009
source: "Duplicate key name '%-.192s'"
serbian: "Duplirano ime ključa '%-.192s'"

# ER_DUP_ENTRY 23000 S1009
source: "Duplicate entry '%-.192T' for key %d"
serbian: "Dupliran unos '%-.192T' za ključ '%d'"

# ER_WRONG_FIELD_SPEC 42000 S1009
source: "Incorrect column specifier for column '%-.192s'"
serbian: "Pogrešan naziv kolone za kolonu '%-.192s'"

# ER_PARSE_ERROR 42000 s1009
source: "%s near '%-.80T' at line %d"
serbian: "'%s' u iskazu '%-.80T' na liniji %d"

# ER_EMPTY_QUERY 42000
source: "Query was empty"
serbian: "Upit je bio prazan"

# ER_NONUNIQ_TABLE 42000 S1009
source: "Not unique table/alias: '%-.192s'"
serbian: "Tabela ili alias nisu bili jedinstveni: '%-.192s'"

# ER_INVALID_DEFAULT 42000 S1009
source: "Invalid default value for '%-.192s'"
serbian: "Loša default vrednost za '%-.192s'"

# ER_MULTIPLE_PRI_KEY 42000 S1009
source: "Multiple primary key defined"
serbian: "Definisani višestruki primarni ključevi"

# ER_TOO_MANY_KEYS 42000 S1009
source: "Too many keys specified; max %d keys allowed"
serbian: "Navedeno je previše ključeva. Maksimum %d ključeva je dozvoljeno"

# ER_TOO_MANY_KEY_PARTS 42000 S1009
source: "Too many key parts specified; max %d parts allowed"
serbian: "Navedeno je previše delova ključa. Maksimum %d delova je dozvoljeno"

# ER_TOO_LONG_KEY 42000 S1009
source: "Specified key was too long; max key length is %d bytes"
serbian: "Navedeni ključ je predug. Maksimalna dužina ključa je %d"

# ER_KEY_COLUMN_DOES_NOT_EXIST 42000 S1009
source: "Key column '%-.192s' doesn't exist in table"
serbian: "Ključna kolona '%-.192s' ne postoji u tabeli"

# ER_TOO_BIG_FIELDLENGTH 42000 S1009
source: "Column length too big for column '%-.192s' (max = %lu); use BLOB or TEXT instead"
serbian: "Previše podataka za kolonu '%-.192s' (maksimum je %lu). Upotrebite BLOB polje"

# ER_WRONG_AUTO_KEY 42000 S1009
source: "Incorrect table definition; there can be only one auto column and it must be defined as a key"
serbian: "Pogrešna definicija tabele; U tabeli može postojati samo jedna 'AUTO' kolona i ona mora biti istovremeno definisana kao kolona ključa"

# ER_NORMAL_SHUTDOWN
source: "%s (initiated by: %s): Normal shutdown"
serbian: "%s (%s): Normalno gašenje"

# ER_GOT_SIGNAL
source: "%s: Got signal %d. Aborting!\n"
serbian: "%s: Dobio signal %d. Prekidam!\n"

# ER_SHUTDOWN_COMPLETE
source: "%s: Shutdown complete\n"
serbian: "%s: Gašenje završeno\n"

# ER_FORCING_CLOSE 08S01
source: "%s: Forcing close of thread %ld user: '%-.48s'\n"
serbian: "%s: Usiljeno gašenje thread-a %ld koji pripada korisniku: '%-.48s'\n"

# ER_IPSOCK_ERROR 08S01
source: "Can't create IP socket"
serbian: "Ne mogu da kreiram IP socket"

# ER_NO_SUCH_INDEX 42S12 S1009
source: "Table '%-.192s' has no index like the one used in CREATE INDEX; recreate the table"
serbian: "Tabela '%-.192s' nema isti indeks kao onaj upotrebljen pri komandi 'CREATE INDEX'. Napravite tabelu ponovo"

# ER_WRONG_FIELD_TERMINATORS 42000 S1009
source: "Field separator argument is not what is expected; check the manual"
serbian: "Argument separatora polja nije ono što se očekivalo. Proverite uputstvo MariaDB server-a"

# ER_BLOBS_AND_NO_TERMINATED 42000 S1009
source: "You can't use fixed rowlength with BLOBs; please use 'fields terminated by'"
serbian: "Ne možete koristiti fiksnu veličinu sloga kada imate BLOB polja. Molim koristite 'fields terminated by' opciju"

# ER_TEXTFILE_NOT_READABLE
source: "The file '%-.128s' must be in the database directory or be readable by all"
serbian: "File '%-.128s' mora biti u direktorijumu gde su file-ovi baze i mora imati odgovarajuća prava pristupa"

# ER_FILE_EXISTS_ERROR
source: "File '%-.200s' already exists"
serbian: "File '%-.200s' već postoji"

# ER_LOAD_INFO
source: "Records: %ld Deleted: %ld Skipped: %ld Warnings: %ld"
serbian: "Slogova: %ld Izbrisano: %ld Preskočeno: %ld Upozorenja: %ld"

# ER_ALTER_INFO
source: "Records: %ld Duplicates: %ld"
serbian: "Slogova: %ld Duplikata: %ld"

# ER_WRONG_SUB_KEY
source: "Incorrect prefix key; the used key part isn't a string, the used length is longer than the key part, or the storage engine doesn't support unique prefix keys"
serbian: "Pogrešan pod-ključ dela ključa. Upotrebljeni deo ključa nije string, upotrebljena dužina je veća od dela ključa ili handler tabela ne podržava jedinstvene pod-ključeve"

# ER_CANT_REMOVE_ALL_FIELDS 42000
source: "You can't delete all columns with ALTER TABLE; use DROP TABLE instead"
serbian: "Ne možete da izbrišete sve kolone pomoću komande 'ALTER TABLE'. Upotrebite komandu 'DROP TABLE' ako želite to da uradite"

# ER_CANT_DROP_FIELD_OR_KEY 42000
source: "Can't DROP %s %`-.192s; check that it exists"
serbian: "Ne mogu da izvršim komandu drop 'DROP %s' na %`-.192s. Proverite da li ta kolona (odnosno ključ) postoji"

# ER_INSERT_INFO
source: "Records: %ld Duplicates: %ld Warnings: %ld"
serbian: "Slogova: %ld Duplikata: %ld Upozorenja: %ld"

# ER_NO_SUCH_THREAD
source: "Unknown thread id: %lu"
serbian: "Nepoznat thread identifikator: %lu"

# ER_KILL_DENIED_ERROR
source: "You are not owner of thread %lld"
serbian: "Vi niste vlasnik thread-a %lld"

# ER_NO_TABLES_USED
source: "No tables used"
serbian: "Nema upotrebljenih tabela"

# ER_TOO_BIG_SET
source: "Too many strings for column %-.192s and SET"
serbian: "Previše string-ova za kolonu '%-.192s' i komandu 'SET'"

# ER_NO_UNIQUE_LOGFILE
source: "Can't generate a unique log-filename %-.200s.(1-999)\n"
serbian: "Ne mogu da generišem jedinstveno ime log-file-a: '%-.200s.(1-999)'\n"

# ER_TABLE_NOT_LOCKED_FOR_WRITE
source: "Table '%-.192s' was locked with a READ lock and can't be updated"
serbian: "Tabela '%-.192s' je zaključana READ lock-om; iz nje se može samo čitati ali u nju se ne može pisati"

# ER_TABLE_NOT_LOCKED
source: "Table '%-.192s' was not locked with LOCK TABLES"
serbian: "Tabela '%-.192s' nije bila zaključana komandom 'LOCK TABLES'"

# ER_WRONG_DB_NAME 42000
source: "Incorrect database name '%-.100T'"
serbian: "Pogrešno ime baze '%-.100T'"

# ER_WRONG_TABLE_NAME 42000
source: "Incorrect table name '%-.100s'"
serbian: "Pogrešno ime tabele '%-.100s'"

# ER_TOO_BIG_SELECT 42000
source: "The SELECT would examine more than MAX_JOIN_SIZE rows; check your WHERE and use SET SQL_BIG_SELECTS=1 or SET MAX_JOIN_SIZE=# if the SELECT is okay"
serbian: "Komanda 'SELECT' će ispitati previše slogova i potrošiti previše vremena. Proverite vaš 'WHERE' filter i upotrebite 'SET OPTION SQL_BIG_SELECTS=1' ako želite baš ovakvu komandu"

# ER_UNKNOWN_ERROR
source: "Unknown error"
serbian: "Nepoznata greška"

# ER_UNKNOWN_PROCEDURE 42000
source: "Unknown procedure '%-.192s'"
serbian: "Nepoznata procedura '%-.192s'"

# ER_WRONG_PARAMCOUNT_TO_PROCEDURE 42000
source: "Incorrect parameter count to procedure '%-.192s'"
serbian: "Pogrešan broj parametara za proceduru '%-.192s'"

# ER_WRONG_PARAMETERS_TO_PROCEDURE
source: "Incorrect parameters to procedure '%-.192s'"
serbian: "Pogrešni parametri prosleđeni proceduri '%-.192s'"

# ER_UNKNOWN_TABLE 42S02
source: "Unknown table '%-.192s' in %-.32s"
serbian: "Nepoznata tabela '%-.192s' u '%-.32s'"

# ER_FIELD_SPECIFIED_TWICE 42000
source: "Column '%-.192s' specified twice"
serbian: "Kolona '%-.192s' je navedena dva puta"

# ER_INVALID_GROUP_FUNC_USE
source: "Invalid use of group function"
serbian: "Pogrešna upotreba 'GROUP' funkcije"

# ER_UNSUPPORTED_EXTENSION 42000
source: "Table '%-.192s' uses an extension that doesn't exist in this MariaDB version"
serbian: "Tabela '%-.192s' koristi ekstenziju koje ne postoji u ovoj verziji MariaDB-a"

# ER_TABLE_MUST_HAVE_COLUMNS 42000
source: "A table must have at least 1 column"
serbian: "Tabela mora imati najmanje jednu kolonu"

# ER_RECORD_FILE_FULL
source: "The table '%-.192s' is full"
serbian: "Tabela '%-.192s' je popunjena do kraja"

# ER_UNKNOWN_CHARACTER_SET 42000
source: "Unknown character set: '%-.64s'"
serbian: "Nepoznati karakter-set: '%-.64s'"

# ER_TOO_MANY_TABLES
source: "Too many tables; MariaDB can only use %d tables in a join"
serbian: "Previše tabela. MariaDB može upotrebiti maksimum %d tabela pri 'JOIN' operaciji"

# ER_TOO_MANY_FIELDS
source: "Too many columns"
serbian: "Previše kolona"

# ER_TOO_BIG_ROWSIZE 42000
source: "Row size too large. The maximum row size for the used table type, not counting BLOBs, is %ld. This includes storage overhead, check the manual. You have to change some columns to TEXT or BLOBs"
serbian: "Prevelik slog. Maksimalna veličina sloga, ne računajući BLOB polja, je %ld. Trebali bi da promenite tip nekih polja u BLOB"

# ER_STACK_OVERRUN
source: "Thread stack overrun: Used: %ld of a %ld stack. Use 'mariadbd --thread_stack=#' to specify a bigger stack if needed"
serbian: "Prepisivanje thread stack-a: Upotrebljeno: %ld od %ld stack memorije. Upotrebite 'mariadbd --thread_stack=#' da navedete veći stack ako je potrebno"

# ER_WRONG_OUTER_JOIN 42000
source: "Cross dependency found in OUTER JOIN; examine your ON conditions"
serbian: "Unakrsna zavisnost pronađena u komandi 'OUTER JOIN'. Istražite vaše 'ON' uslove"

# ER_CANT_FIND_UDF
source: "Can't load function '%-.192s'"
serbian: "Ne mogu da učitam funkciju '%-.192s'"

# ER_CANT_INITIALIZE_UDF
source: "Can't initialize function '%-.192s'; %-.80s"
serbian: "Ne mogu da inicijalizujem funkciju '%-.192s'; %-.80s"

# ER_UDF_NO_PATHS
source: "No paths allowed for shared library"
serbian: "Ne postoje dozvoljene putanje do share-ovane biblioteke"

# ER_UDF_EXISTS
source: "Function '%-.192s' already exists"
serbian: "Funkcija '%-.192s' već postoji"

# ER_CANT_OPEN_LIBRARY
source: "Can't open shared library '%-.192s' (errno: %d, %-.128s)"
serbian: "Ne mogu da otvorim share-ovanu biblioteku '%-.192s' (errno: %d, %-.128s)"

# ER_CANT_FIND_DL_ENTRY
source: "Can't find symbol '%-.128s' in library"
serbian: "Ne mogu da pronadjem funkciju '%-.128s' u biblioteci"

# ER_FUNCTION_NOT_DEFINED
source: "Function '%-.192s' is not defined"
serbian: "Funkcija '%-.192s' nije definisana"

# ER_HOST_IS_BLOCKED
source: "Host '%-.64s' is blocked because of many connection errors; unblock with 'mariadb-admin flush-hosts'"
serbian: "Host '%-.64s' je blokiran zbog previše grešaka u konekciji. Možete ga odblokirati pomoću komande 'mariadb-admin flush-hosts'"

# ER_HOST_NOT_PRIVILEGED
source: "Host '%-.64s' is not allowed to connect to this MariaDB server"
serbian: "Host-u '%-.64s' nije dozvoljeno da se konektuje na ovaj MariaDB server"

# ER_PASSWORD_ANONYMOUS_USER 42000
source: "You are using MariaDB as an anonymous user and anonymous users are not allowed to modify user settings"
serbian: "Vi koristite MariaDB kao anonimni korisnik a anonimnim korisnicima nije dozvoljeno da menjaju lozinke"

# ER_PASSWORD_NOT_ALLOWED 42000
source: "You must have privileges to update tables in the mysql database to be able to change passwords for others"
serbian: "Morate imati privilegije da možete da update-ujete određene tabele ako želite da menjate lozinke za druge korisnike"

# ER_PASSWORD_NO_MATCH 28000
source: "Can't find any matching row in the user table"
serbian: "Ne mogu da pronađem odgovarajući slog u 'user' tabeli"

# ER_UPDATE_INFO
source: "Rows matched: %ld Changed: %ld Warnings: %ld"
serbian: "Odgovarajućih slogova: %ld Promenjeno: %ld Upozorenja: %ld"

# ER_CANT_CREATE_THREAD
source: "Can't create a new thread (errno %M); if you are not out of available memory, you can consult the manual for a possible OS-dependent bug"
serbian: "Ne mogu da kreiram novi thread (errno %M). Ako imate još slobodne memorije, trebali biste da pogledate u priručniku da li je ovo specifična greška vašeg operativnog sistema"

# ER_WRONG_VALUE_COUNT_ON_ROW 21S01
source: "Column count doesn't match value count at row %lu"
serbian: "Broj kolona ne odgovara broju vrednosti u slogu %lu"

# ER_CANT_REOPEN_TABLE
source: "Can't reopen table: '%-.192s'"
serbian: "Ne mogu da ponovo otvorim tabelu '%-.192s'"

# ER_INVALID_USE_OF_NULL 22004
source: "Invalid use of NULL value"
serbian: "Pogrešna upotreba vrednosti NULL"

# ER_REGEXP_ERROR 42000
source: "Regex error '%s'"
serbian: "Funkcija regexp je vratila grešku: %s"

# ER_MIX_OF_GROUP_FUNC_AND_FIELDS 42000
source: "Mixing of GROUP columns (MIN(),MAX(),COUNT(),...) with no GROUP columns is illegal if there is no GROUP BY clause"
serbian: "Upotreba agregatnih funkcija (MIN(),MAX(),COUNT()...) bez 'GROUP' kolona je pogrešna ako ne postoji 'GROUP BY' iskaz"

# ER_NONEXISTING_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s'"
serbian: "Ne postoji odobrenje za pristup korisniku '%-.48s' na host-u '%-.64s'"

# ER_TABLEACCESS_DENIED_ERROR 42000
source: "%-.100T command denied to user '%s'@'%s' for table '%-.192s'"
serbian: "%-.100T komanda zabranjena za korisnika '%s'@'%s' za tabelu '%-.192s'"

# ER_COLUMNACCESS_DENIED_ERROR 42000
source: "%-.32s command denied to user '%s'@'%s' for column '%-.192s' in table '%-.192s'"
serbian: "%-.32s komanda zabranjena za korisnika '%s'@'%s' za kolonu '%-.192s' iz tabele '%-.192s'"

# ER_ILLEGAL_GRANT_FOR_TABLE 42000
source: "Illegal GRANT/REVOKE command; please consult the manual to see which privileges can be used"
serbian: "Pogrešna 'GRANT' odnosno 'REVOKE' komanda. Molim Vas pogledajte u priručniku koje vrednosti mogu biti upotrebljene"

# ER_GRANT_WRONG_HOST_OR_USER 42000
source: "The host or user argument to GRANT is too long"
serbian: "Argument 'host' ili 'korisnik' prosleđen komandi 'GRANT' je predugačak"

# ER_NO_SUCH_TABLE 42S02
source: "Table '%-.192s.%-.192s' doesn't exist"
serbian: "Tabela '%-.192s.%-.192s' ne postoji"

# ER_NONEXISTING_TABLE_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s' on table '%-.192s'"
serbian: "Ne postoji odobrenje za pristup korisniku '%-.48s' na host-u '%-.64s' tabeli '%-.192s'"

# ER_NOT_ALLOWED_COMMAND 42000
source: "The used command is not allowed with this MariaDB version"
serbian: "Upotrebljena komanda nije dozvoljena sa ovom verzijom MariaDB servera"

# ER_SYNTAX_ERROR 42000
source: "You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use"
serbian: "Imate grešku u vašoj SQL sintaksi"

# ER_DELAYED_CANT_CHANGE_LOCK
source: "Delayed insert thread couldn't get requested lock for table %-.192s"
serbian: "Prolongirani 'INSERT' thread nije mogao da dobije traženo zaključavanje tabele '%-.192s'"

# ER_TOO_MANY_DELAYED_THREADS
source: "Too many delayed threads in use"
serbian: "Previše prolongiranih thread-ova je u upotrebi"

# ER_ABORTING_CONNECTION 08S01
source: "Aborted connection %ld to db: '%-.192s' user: '%-.48s' (%-.64s)"
serbian: "Prekinuta konekcija broj %ld ka bazi: '%-.192s' korisnik je bio: '%-.48s' (%-.64s)"

# ER_NET_PACKET_TOO_LARGE 08S01
source: "Got a packet bigger than 'max_allowed_packet' bytes"
serbian: "Primio sam mrežni paket veći od definisane vrednosti 'max_allowed_packet'"

# ER_NET_READ_ERROR_FROM_PIPE 08S01
source: "Got a read error from the connection pipe"
serbian: "Greška pri čitanju podataka sa pipe-a"

# ER_NET_FCNTL_ERROR 08S01
source: "Got an error from fcntl()"
serbian: "Greška pri izvršavanju funkcije fcntl()"

# ER_NET_PACKETS_OUT_OF_ORDER 08S01
source: "Got packets out of order"
serbian: "Primio sam mrežne pakete van reda"

# ER_NET_UNCOMPRESS_ERROR 08S01
source: "Couldn't uncompress communication packet"
serbian: "Ne mogu da dekompresujem mrežne pakete"

# ER_NET_READ_ERROR 08S01
source: "Got an error reading communication packets"
serbian: "Greška pri primanju mrežnih paketa"

# ER_NET_READ_INTERRUPTED 08S01
source: "Got timeout reading communication packets"
serbian: "Vremenski limit za čitanje mrežnih paketa je istekao"

# ER_NET_ERROR_ON_WRITE 08S01
source: "Got an error writing communication packets"
serbian: "Greška pri slanju mrežnih paketa"

# ER_NET_WRITE_INTERRUPTED 08S01
source: "Got timeout writing communication packets"
serbian: "Vremenski limit za slanje mrežnih paketa je istekao"

# ER_TOO_LONG_STRING 42000
source: "Result string is longer than 'max_allowed_packet' bytes"
serbian: "Rezultujuči string je duži nego što to dozvoljava parametar servera 'max_allowed_packet'"

# ER_TABLE_CANT_HANDLE_BLOB 42000
source: "Storage engine %s doesn't support BLOB/TEXT columns"
serbian: "Iskorišteni tip tabele (%s) ne podržava kolone tipa 'BLOB' odnosno 'TEXT'"

# ER_TABLE_CANT_HANDLE_AUTO_INCREMENT 42000
source: "Storage engine %s doesn't support AUTO_INCREMENT columns"
serbian: "Iskorišteni tip tabele (%s) ne podržava kolone tipa 'AUTO_INCREMENT'"
