Repository: vladbogo/test-translation
Catalog: slo.xlf
Languages: slo

# ER_NO
source: "NO"
slo: "NIE"

# ER_YES
source: "YES"
slo: "Áno"

# ER_CANT_CREATE_FILE
source: "Can't create file '%-.200s' (errno: %M)"
slo: "Nemôžem vytvoriť súbor '%-.200s' (chybový kód: %M)"

# ER_CANT_CREATE_TABLE
source: "Can't create table %`s.%`s (errno: %M)"
slo: "Nemôžem vytvoriť tabuľku %`s.%`s (chybový kód: %M)"

# ER_CANT_CREATE_DB
source: "Can't create database '%-.192s' (errno: %M)"
slo: "Nemôžem vytvoriť databázu '%-.192s' (chybový kód: %M)"

# ER_DB_CREATE_EXISTS
source: "Can't create database '%-.192s'; database exists"
slo: "Nemôžem vytvoriť databázu '%-.192s'; databáza existuje"

# ER_DB_DROP_EXISTS
source: "Can't drop database '%-.192s'; database doesn't exist"
slo: "Nemôžem zmazať databázu '%-.192s'; databáza neexistuje"

# ER_DB_DROP_DELETE
source: "Error dropping database (can't delete '%-.192s', errno: %M)"
slo: "Chyba pri mazaní databázy (nemôžem zmazať '%-.192s', chybový kód: %M)"

# ER_DB_DROP_RMDIR
source: "Error dropping database (can't rmdir '%-.192s', errno: %M)"
slo: "Chyba pri mazaní databázy (nemôžem vymazať adresár '%-.192s', chybový kód: %M)"

# ER_CANT_DELETE_FILE
source: "Error on delete of '%-.192s' (errno: %M)"
slo: "Chyba pri mazaní '%-.192s' (chybový kód: %M)"

# ER_CANT_FIND_SYSTEM_REC
source: "Can't read record in system table"
slo: "Nemôžem čítať záznam v systémovej tabuľke"

# ER_CANT_GET_STAT
source: "Can't get status of '%-.200s' (errno: %M)"
slo: "Nemôžem zistiť stav '%-.200s' (chybový kód: %M)"

# ER_CANT_GET_WD
source: "Can't get working directory (errno: %M)"
slo: "Nemôžem zistiť pracovný adresár (chybový kód: %M)"

# ER_CANT_LOCK
source: "Can't lock file (errno: %M)"
slo: "Nemôžem zamknúť súbor (chybový kód: %M)"

# ER_CANT_OPEN_FILE
source: "Can't open file: '%-.200s' (errno: %M)"
slo: "Nemôžem otvoriť súbor: '%-.200s' (chybový kód: %M)"

# ER_FILE_NOT_FOUND
source: "Can't find file: '%-.200s' (errno: %M)"
slo: "Nemôžem nájsť súbor: '%-.200s' (chybový kód: %M)"

# ER_CANT_READ_DIR
source: "Can't read dir of '%-.192s' (errno: %M)"
slo: "Nemôžem čítať adresár '%-.192s' (chybový kód: %M)"

# ER_CANT_SET_WD
source: "Can't change dir to '%-.192s' (errno: %M)"
slo: "Nemôžem vojsť do adresára '%-.192s' (chybový kód: %M)"

# ER_CHECKREAD
source: "Record has changed since last read in table '%-.192s'"
slo: "Záznam bol zmenený od posledného čítania v tabuľke '%-.192s'"

# ER_DISK_FULL
source: "Disk full (%s); waiting for someone to free some space... (errno: %M)"
slo: "Disk je plný (%s), čakám na uvoľnenie miesta... (chybový kód: %M)"

# ER_DUP_KEY 23000
source: "Can't write; duplicate key in table '%-.192s'"
slo: "Nemôžem zapísať, duplikát kľúča v tabuľke '%-.192s'"

# ER_ERROR_ON_CLOSE
source: "Error on close of '%-.192s' (errno: %M)"
slo: "Chyba pri zatváraní '%-.192s' (chybový kód: %M)"

# ER_ERROR_ON_READ
source: "Error reading file '%-.200s' (errno: %M)"
slo: "Chyba pri čítaní súboru '%-.200s' (chybový kód: %M)"

# ER_ERROR_ON_RENAME
source: "Error on rename of '%-.210s' to '%-.210s' (errno: %M)"
slo: "Chyba pri premenovávaní '%-.210s' na '%-.210s' (chybový kód: %M)"

# ER_ERROR_ON_WRITE
source: "Error writing file '%-.200s' (errno: %M)"
slo: "Chyba pri zápise do súboru '%-.200s' (chybový kód: %M)"

# ER_FILE_USED
source: "'%-.192s' is locked against change"
slo: "'%-.192s' je zamknutý proti zmenám"

# ER_FILSORT_ABORT
source: "Sort aborted"
slo: "Triedenie prerušené"

# ER_FORM_NOT_FOUND
source: "View '%-.192s' doesn't exist for '%-.192s'"
slo: "Pohľad '%-.192s' neexistuje pre '%-.192s'"

# ER_KEY_NOT_FOUND
source: "Can't find record in '%-.192s'"
slo: "Nemôžem nájsť záznam v '%-.192s'"

# ER_NOT_FORM_FILE
source: "Incorrect information in file: '%-.200s'"
slo: "Nesprávna informácia v súbore: '%-.200s'"

# ER_NOT_KEYFILE
source: "Index for table '%-.200s' is corrupt; try to repair it"
slo: "Nesprávny kľúč pre tabuľku '%-.200s'; pokúste sa ho opraviť"

# ER_OLD_KEYFILE
source: "Old key file for table '%-.192s'; repair it!"
slo: "Starý kľúčový súbor pre '%-.192s'; opravte ho!"

# ER_OPEN_AS_READONLY
source: "Table '%-.192s' is read only"
slo: "'%-.192s' is čítať only"

# ER_OUTOFMEMORY HY001 S1001
source: "Out of memory; restart server and try again (needed %d bytes)"
slo: "Málo pamäti. Reštartujte daemona a skúste znova (je potrebných %d bytov)"

# ER_OUT_OF_SORTMEMORY HY001 S1001
source: "Out of sort memory, consider increasing server sort buffer size"
slo: "Málo pamäti pre triedenie, zvýšte veľkosť triediaceho bufferu"

# ER_UNEXPECTED_EOF
source: "Unexpected EOF found when reading file '%-.192s' (errno: %M)"
slo: "Neočakávaný koniec súboru pri čítaní '%-.192s' (chybový kód: %M)"

# ER_CON_COUNT_ERROR 08004
source: "Too many connections"
slo: "Príliš mnoho spojení"

# ER_OUT_OF_RESOURCES
source: "Out of memory."
slo: "Málo miesta-pamäti pre vlákno"

# ER_BAD_HOST_ERROR 08S01
source: "Can't get hostname for your address"
slo: "Nemôžem zistiť meno hostiteľa pre vašu adresu"

# ER_HANDSHAKE_ERROR 08S01
source: "Bad handshake"
slo: "Chyba pri nadväzovaní spojenia"

# ER_DBACCESS_DENIED_ERROR 42000
source: "Access denied for user '%s'@'%s' to database '%-.192s'"
slo: "Zakázaný prístup pre užívateľa: '%s'@'%s' k databázi '%-.192s'"

# ER_ACCESS_DENIED_ERROR 28000
source: "Access denied for user '%s'@'%s' (using password: %s)"
slo: "Zakázaný prístup pre užívateľa: '%s'@'%s' (použitie hesla: %s)"

# ER_NO_DB_ERROR 3D000
source: "No database selected"
slo: "Nebola vybraná databáza"

# ER_UNKNOWN_COM_ERROR 08S01
source: "Unknown command"
slo: "Neznámy príkaz"

# ER_BAD_NULL_ERROR 23000
source: "Column '%-.192s' cannot be null"
slo: "Pole '%-.192s' nemôže byť null"

# ER_BAD_DB_ERROR 42000
source: "Unknown database '%-.192s'"
slo: "Neznáma databáza '%-.192s'"

# ER_TABLE_EXISTS_ERROR 42S01
source: "Table '%-.192s' already exists"
slo: "Tabuľka '%-.192s' už existuje"

# ER_BAD_TABLE_ERROR 42S02
source: "Unknown table '%-.100T'"
slo: "Neznáma tabuľka '%-.100T'"

# ER_NON_UNIQ_ERROR 23000
source: "Column '%-.192s' in %-.192s is ambiguous"
slo: "Pole: '%-.192s' v %-.192s je nejasné"

# ER_SERVER_SHUTDOWN 08S01
source: "Server shutdown in progress"
slo: "Prebieha ukončovanie práce servera"

# ER_BAD_FIELD_ERROR 42S22 S0022
source: "Unknown column '%-.192s' in '%-.192s'"
slo: "Neznáme pole '%-.192s' v '%-.192s'"

# ER_WRONG_FIELD_WITH_GROUP 42000 S1009
source: "'%-.192s' isn't in GROUP BY"
slo: "Použité '%-.192s' nebolo v 'group by'"

# ER_WRONG_GROUP_FIELD 42000 S1009
source: "Can't group on '%-.192s'"
slo: "Nemôžem použiť 'group' na '%-.192s'"

# ER_WRONG_SUM_SELECT 42000 S1009
source: "Statement has sum functions and columns in same statement"
slo: "Príkaz obsahuje zároveň funkciu 'sum' a poľa"

# ER_WRONG_VALUE_COUNT 21S01
source: "Column count doesn't match value count"
slo: "Počet polí nezodpovedá zadanej hodnote"

# ER_TOO_LONG_IDENT 42000 S1009
source: "Identifier name '%-.100T' is too long"
slo: "Meno identifikátora '%-.100T' je príliš dlhé"

# ER_DUP_FIELDNAME 42S21 S1009
source: "Duplicate column name '%-.192s'"
slo: "Opakované meno poľa '%-.192s'"

# ER_DUP_KEYNAME 42000 S1009
source: "Duplicate key name '%-.192s'"
slo: "Opakované meno kľúča '%-.192s'"

# ER_DUP_ENTRY 23000 S1009
source: "Duplicate entry '%-.192T' for key %d"
slo: "Opakovaný kľúč '%-.192T' (číslo kľúča %d)"

# ER_WRONG_FIELD_SPEC 42000 S1009
source: "Incorrect column specifier for column '%-.192s'"
slo: "Chyba v špecifikácii poľa '%-.192s'"

# ER_PARSE_ERROR 42000 s1009
source: "%s near '%-.80T' at line %d"
slo: "%s blízko '%-.80T' na riadku %d"

# ER_EMPTY_QUERY 42000
source: "Query was empty"
slo: "Výsledok požiadavky bol prázdny"

# ER_NONUNIQ_TABLE 42000 S1009
source: "Not unique table/alias: '%-.192s'"
slo: "Nie jednoznačná tabuľka/alias: '%-.192s'"

# ER_INVALID_DEFAULT 42000 S1009
source: "Invalid default value for '%-.192s'"
slo: "Chybná implicitná hodnota pre '%-.192s'"

# ER_MULTIPLE_PRI_KEY 42000 S1009
source: "Multiple primary key defined"
slo: "Zadefinovaných viac primárnych kľúčov"

# ER_TOO_MANY_KEYS 42000 S1009
source: "Too many keys specified; max %d keys allowed"
slo: "Zadaných ríliš veľa kľúčov. Najviac %d kľúčov je povolených"

# ER_TOO_MANY_KEY_PARTS 42000 S1009
source: "Too many key parts specified; max %d parts allowed"
slo: "Zadaných ríliš veľa častí kľúčov. Je povolených najviac %d častí"

# ER_TOO_LONG_KEY 42000 S1009
source: "Specified key was too long; max key length is %d bytes"
slo: "Zadaný kľúč je príliš dlhý, najväčšia dĺžka kľúča je %d"

# ER_KEY_COLUMN_DOES_NOT_EXIST 42000 S1009
source: "Key column '%-.192s' doesn't exist in table"
slo: "Kľúčový stĺpec '%-.192s' v tabuľke neexistuje"

# ER_TOO_BIG_FIELDLENGTH 42000 S1009
source: "Column length too big for column '%-.192s' (max = %lu); use BLOB or TEXT instead"
slo: "Príliš veľká dĺžka pre pole '%-.192s' (maximum = %lu). Použite BLOB"

# ER_WRONG_AUTO_KEY 42000 S1009
source: "Incorrect table definition; there can be only one auto column and it must be defined as a key"
slo: "Môžete mať iba jedno AUTO pole a to musí byť definované ako kľúč"

# ER_NORMAL_SHUTDOWN
source: "%s (initiated by: %s): Normal shutdown"
slo: "%s (%s): normálne ukončenie"

# ER_GOT_SIGNAL
source: "%s: Got signal %d. Aborting!\n"
slo: "%s: prijatý signál %d, ukončenie (Abort)!\n"

# ER_SHUTDOWN_COMPLETE
source: "%s: Shutdown complete\n"
slo: "%s: práca ukončená\n"

# ER_FORCING_CLOSE 08S01
source: "%s: Forcing close of thread %ld user: '%-.48s'\n"
slo: "%s: násilné ukončenie vlákna %ld užívateľa '%-.48s'\n"

# ER_IPSOCK_ERROR 08S01
source: "Can't create IP socket"
slo: "Nemôžem vytvoriť IP socket"

# ER_NO_SUCH_INDEX 42S12 S1009
source: "Table '%-.192s' has no index like the one used in CREATE INDEX; recreate the table"
slo: "Tabuľka '%-.192s' nemá index zodpovedajúci CREATE INDEX. Vytvorte tabulku znova"

# ER_WRONG_FIELD_TERMINATORS 42000 S1009
source: "Field separator argument is not what is expected; check the manual"
slo: "Argument oddeľovač polí nezodpovedá požiadavkám. Skontrolujte v manuáli"

# ER_BLOBS_AND_NO_TERMINATED 42000 S1009
source: "You can't use fixed rowlength with BLOBs; please use 'fields terminated by'"
slo: "Nie je možné použiť fixnú dĺžku s BLOBom. Použite 'fields terminated by'"

# ER_TEXTFILE_NOT_READABLE
source: "The file '%-.128s' must be in the database directory or be readable by all"
slo: "Súbor '%-.128s' musí byť v adresári databázy, alebo čitateľný pre všetkých"

# ER_FILE_EXISTS_ERROR
source: "File '%-.200s' already exists"
slo: "Súbor '%-.200s' už existuje"

# ER_LOAD_INFO
source: "Records: %ld Deleted: %ld Skipped: %ld Warnings: %ld"
slo: "Záznamov: %ld Zmazaných: %ld Preskočených: %ld Varovania: %ld"

# ER_ALTER_INFO
source: "Records: %ld Duplicates: %ld"
slo: "Záznamov: %ld Opakovaných: %ld"

# ER_WRONG_SUB_KEY
source: "Incorrect prefix key; the used key part isn't a string, the used length is longer than the key part, or the storage engine doesn't support unique prefix keys"
slo: "Incorrect prefix key; the used key part isn't a string or the used length is longer than the key part"

# ER_CANT_REMOVE_ALL_FIELDS 42000
source: "You can't delete all columns with ALTER TABLE; use DROP TABLE instead"
slo: "One nemôžem zmazať all fields with ALTER TABLE; use DROP TABLE instead"

# ER_CANT_DROP_FIELD_OR_KEY 42000
source: "Can't DROP %s %`-.192s; check that it exists"
slo: "Nemôžem zrušiť (DROP %s) %`-.192s. Skontrolujte, či neexistujú záznamy/kľúče"

# ER_INSERT_INFO
source: "Records: %ld Duplicates: %ld Warnings: %ld"
slo: "Záznamov: %ld Opakovaných: %ld Varovania: %ld"

# ER_NO_SUCH_THREAD
source: "Unknown thread id: %lu"
slo: "Neznáma identifikácia vlákna: %lu"

# ER_KILL_DENIED_ERROR
source: "You are not owner of thread %lld"
slo: "Nie ste vlastníkom vlákna %lld"

# ER_NO_TABLES_USED
source: "No tables used"
slo: "Nie je použitá žiadna tabuľka"

# ER_TOO_BIG_SET
source: "Too many strings for column %-.192s and SET"
slo: "Príliš mnoho reťazcov pre pole %-.192s a SET"

# ER_NO_UNIQUE_LOGFILE
source: "Can't generate a unique log-filename %-.200s.(1-999)\n"
slo: "Nemôžem vytvoriť unikátne meno log-súboru %-.200s.(1-999)\n"

# ER_TABLE_NOT_LOCKED_FOR_WRITE
source: "Table '%-.192s' was locked with a READ lock and can't be updated"
slo: "Tabuľka '%-.192s' bola zamknutá s READ a nemôže byť zmenená"

# ER_TABLE_NOT_LOCKED
source: "Table '%-.192s' was not locked with LOCK TABLES"
slo: "Tabuľka '%-.192s' nebola zamknutá s LOCK TABLES"

# ER_WRONG_DB_NAME 42000
source: "Incorrect database name '%-.100T'"
slo: "Neprípustné meno databázy '%-.100T'"

# ER_WRONG_TABLE_NAME 42000
source: "Incorrect table name '%-.100s'"
slo: "Neprípustné meno tabuľky '%-.100s'"

# ER_TOO_BIG_SELECT 42000
source: "The SELECT would examine more than MAX_JOIN_SIZE rows; check your WHERE and use SET SQL_BIG_SELECTS=1 or SET MAX_JOIN_SIZE=# if the SELECT is okay"
slo: "Zadaná požiadavka SELECT by prechádzala príliš mnoho záznamov a trvala by príliš dlho. Skontrolujte tvar WHERE a ak je v poriadku, použite SET SQL_BIG_SELECTS=1"

# ER_UNKNOWN_ERROR
source: "Unknown error"
slo: "Neznámá chyba"

# ER_UNKNOWN_PROCEDURE 42000
source: "Unknown procedure '%-.192s'"
slo: "Neznámá procedúra '%-.192s'"

# ER_WRONG_PARAMCOUNT_TO_PROCEDURE 42000
source: "Incorrect parameter count to procedure '%-.192s'"
slo: "Chybný počet parametrov procedúry '%-.192s'"

# ER_WRONG_PARAMETERS_TO_PROCEDURE
source: "Incorrect parameters to procedure '%-.192s'"
slo: "Chybné parametre procedúry '%-.192s'"

# ER_UNKNOWN_TABLE 42S02
source: "Unknown table '%-.192s' in %-.32s"
slo: "Neznáma tabuľka '%-.192s' v %-.32s"

# ER_FIELD_SPECIFIED_TWICE 42000
source: "Column '%-.192s' specified twice"
slo: "Pole '%-.192s' je zadané dvakrát"

# ER_INVALID_GROUP_FUNC_USE
source: "Invalid use of group function"
slo: "Nesprávne použitie funkcie GROUP"

# ER_UNSUPPORTED_EXTENSION 42000
source: "Table '%-.192s' uses an extension that doesn't exist in this MariaDB version"
slo: "Tabuľka '%-.192s' používa rozšírenie, ktoré v tejto verzii MariaDB nie je"

# ER_TABLE_MUST_HAVE_COLUMNS 42000
source: "A table must have at least 1 column"
slo: "Tabuľka musí mať aspoň 1 pole"

# ER_RECORD_FILE_FULL
source: "The table '%-.192s' is full"
slo: "Tabuľka '%-.192s' je plná"

# ER_UNKNOWN_CHARACTER_SET 42000
source: "Unknown character set: '%-.64s'"
slo: "Neznáma znaková sada: '%-.64s'"

# ER_TOO_MANY_TABLES
source: "Too many tables; MariaDB can only use %d tables in a join"
slo: "Príliš mnoho tabuliek. MariaDB môže použiť len %d v JOIN-e"

# ER_TOO_MANY_FIELDS
source: "Too many columns"
slo: "Príliš mnoho polí"

# ER_TOO_BIG_ROWSIZE 42000
source: "Row size too large. The maximum row size for the used table type, not counting BLOBs, is %ld. This includes storage overhead, check the manual. You have to change some columns to TEXT or BLOBs"
slo: "Riadok je príliš veľký. Maximálna veľkosť riadku, okrem 'BLOB', je %ld. Musíte zmeniť niektoré položky na BLOB"

# ER_STACK_OVERRUN
source: "Thread stack overrun: Used: %ld of a %ld stack. Use 'mariadbd --thread_stack=#' to specify a bigger stack if needed"
slo: "Pretečenie zásobníku vlákna: použité: %ld z %ld. Použite 'mariadbd --thread_stack=#' k zadaniu väčšieho zásobníka"

# ER_WRONG_OUTER_JOIN 42000
source: "Cross dependency found in OUTER JOIN; examine your ON conditions"
slo: "V OUTER JOIN bol nájdený krížový odkaz. Skontrolujte podmienky ON"

# ER_CANT_FIND_UDF
source: "Can't load function '%-.192s'"
slo: "Nemôžem načítať funkciu '%-.192s'"

# ER_CANT_INITIALIZE_UDF
source: "Can't initialize function '%-.192s'; %-.80s"
slo: "Nemôžem inicializovať funkciu '%-.192s'; %-.80s"

# ER_UDF_NO_PATHS
source: "No paths allowed for shared library"
slo: "Neprípustné žiadne cesty k zdieľanej knižnici"

# ER_UDF_EXISTS
source: "Function '%-.192s' already exists"
slo: "Funkcia '%-.192s' už existuje"

# ER_CANT_OPEN_LIBRARY
source: "Can't open shared library '%-.192s' (errno: %d, %-.128s)"
slo: "Nemôžem otvoriť zdieľanú knižnicu '%-.192s' (chybový kód: %d, %-.128s)"

# ER_CANT_FIND_DL_ENTRY
source: "Can't find symbol '%-.128s' in library"
slo: "Nemôžem nájsť funkciu '%-.128s' v knižnici"

# ER_FUNCTION_NOT_DEFINED
source: "Function '%-.192s' is not defined"
slo: "Funkcia '%-.192s' nie je definovaná"

# ER_ILLEGAL_GRANT_FOR_TABLE 42000
source: "Illegal GRANT/REVOKE command; please consult the manual to see which privileges can be used"
slo: "Illegal GRANT/REVOKE command; please consult the manual to see which privleges can be used"

# ER_SYNTAX_ERROR 42000
source: "You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use"
slo: "Something is wrong in your syntax"

# ER_WRONG_MRG_TABLE
source: "Unable to open underlying table which is differently defined or of non-MyISAM type or doesn't exist"
slo: "All tables in the MERGE table are not defined identically"

# ER_BLOB_KEY_WITHOUT_LENGTH 42000
source: "BLOB/TEXT column '%-.192s' used in key specification without a key length"
slo: "BLOB column '%-.192s' used in key specification without a key length"

# ER_CHECK_NOT_IMPLEMENTED 42000
source: "The storage engine for the table doesn't support %s"
slo: "The handler for the table doesn't support %s"

# ER_DUP_ENTRY_WITH_KEY_NAME 23000 S1009
source: "Duplicate entry '%-.64T' for key '%-.192s'"
slo: "Opakovaný kľúč '%-.64T' (číslo kľúča '%-.192s')"

# ER_ACCESS_DENIED_NO_PASSWORD_ERROR 28000
source: "Access denied for user '%s'@'%s'"
slo: "Zakázaný prístup pre užívateľa: '%s'@'%s'"

# ER_DUP_UNKNOWN_IN_INDEX 23000
source: "Duplicate entry for key '%-.192s'"
slo: "Opakovaný kľúč (číslo kľúča '%-.192s')"
