Repository: vladbogo/test-translation
Catalog: spa.xlf
Languages: spa

# ER_INCORRECT_GTID_STATE
source: "Could not parse GTID list"
spa: "No pude analizar la lista GTID"

# ER_CANNOT_UPDATE_GTID_STATE
source: "Could not update replication slave gtid state"
spa: "No pude actualizar estado gtid de esclavo de réplica"

# ER_DUPLICATE_GTID_DOMAIN
source: "GTID %u-%u-%llu and %u-%u-%llu conflict (duplicate domain id %u)"
spa: "Conflicto GTID %u-%u-%llu y %u-%u-%llu (duplicado id de dominio %u)"

# ER_GTID_OPEN_TABLE_FAILED
source: "Failed to open %s.%s"
spa: "No pude abrir %s.%s"

# ER_GTID_POSITION_NOT_FOUND_IN_BINLOG
source: "Connecting slave requested to start from GTID %u-%u-%llu, which is not in the master's binlog"
spa: "Se ha requerido que conectar esclavo arranque desde GTID %u-%u-%llu, el cual no está en el binlog del maestro (master)"

# ER_CANNOT_LOAD_SLAVE_GTID_STATE
source: "Failed to load replication slave GTID position from table %s.%s"
spa: "No pude cargar posición GTID de esclavo de réplica desde la tabla %s.%s"

# ER_MASTER_GTID_POS_CONFLICTS_WITH_BINLOG
source: "Specified GTID %u-%u-%llu conflicts with the binary log which contains a more recent GTID %u-%u-%llu. If MASTER_GTID_POS=CURRENT_POS is used, the binlog position will override the new value of @@gtid_slave_pos"
spa: "El especificado GTID %u-%u-%llu está en conflicto con el historial (log) binario el cual contiene un más reciente GTID %u-%u-%llu. Si se usa MASTER_GTID_POS=CURRENT_POS, la posición de binlog sobreescribirá el nuevo valor de @@gtid_slave_pos"

# ER_MASTER_GTID_POS_MISSING_DOMAIN
source: "Specified value for @@gtid_slave_pos contains no value for replication domain %u. This conflicts with the binary log which contains GTID %u-%u-%llu. If MASTER_GTID_POS=CURRENT_POS is used, the binlog position will override the new value of @@gtid_slave_pos"
spa: "El valor especificado para @@gtid_slave_pos no contiene valor para dominio de réplica %u. Esto está en conflicto con el historial (log) binario el cual contiene un GTID %u-%u-%llu. Si se usa MASTER_GTID_POS=CURRENT_POS, la posición binlog sobreescribirá el nuevo valor de @@gtid_slave_pos"

# ER_UNTIL_REQUIRES_USING_GTID
source: "START SLAVE UNTIL master_gtid_pos requires that slave is using GTID"
spa: "START SLAVE UNTIL master_gtid_pos requiere que esclavo esté usando GTID"

# ER_GTID_STRICT_OUT_OF_ORDER
source: "An attempt was made to binlog GTID %u-%u-%llu which would create an out-of-order sequence number with existing GTID %u-%u-%llu, and gtid strict mode is enabled"
spa: "Se ha intentado hacer binlog de GTID %u-%u-%llu lo cual crearía un número de secuencia fuera de orden con el existente GTID %u-%u-%llu y está activado gtid en modo estricto"

# ER_GTID_START_FROM_BINLOG_HOLE
source: "The binlog on the master is missing the GTID %u-%u-%llu requested by the slave (even though a subsequent sequence number does exist), and GTID strict mode is enabled"
spa: "Al binlog del maestro (master) le falta el GTID %u-%u-%llu requerido por el esclavo (incluso aunque existe un número posterior de secuencia) y está activado GTID en modo estricto"

# ER_SLAVE_UNEXPECTED_MASTER_SWITCH
source: "Unexpected GTID received from master after reconnect. This normally indicates that the master server was replaced without restarting the slave threads. %s"
spa: "Se ha recibido un GTID inesperado desde el maestro (master) tras reconectar. Esto indica normalmente que el servidor maestro (master) ha sido reemplazado sin rearrancar los hilos (threads) del esclavo. %s"

# ER_INSIDE_TRANSACTION_PREVENTS_SWITCH_GTID_DOMAIN_ID_SEQ_NO
source: "Cannot modify @@session.gtid_domain_id or @@session.gtid_seq_no inside a transaction"
spa: "No puedo modificar @@session.gtid_domain_id o @@session.gtid_seq_no dentro de una transacción"

# ER_STORED_FUNCTION_PREVENTS_SWITCH_GTID_DOMAIN_ID_SEQ_NO
source: "Cannot modify @@session.gtid_domain_id or @@session.gtid_seq_no inside a stored function or trigger"
spa: "No puedo modificar @@session.gtid_domain_id o @@session.gtid_seq_no dentro de una función almacenada o de un disparador"

# ER_GTID_POSITION_NOT_FOUND_IN_BINLOG2
source: "Connecting slave requested to start from GTID %u-%u-%llu, which is not in the master's binlog. Since the master's binlog contains GTIDs with higher sequence numbers, it probably means that the slave has diverged due to executing extra erroneous transactions"
spa: "Se ha requerido arrancar la conexión a esclavo desde GTID %u-%u-%llu, el cual no está en el binlog del maestro (master). Ya que el binlog del maestro (master) contiene GTIDs con números mayores de secuencia, es probable que indique que el esclavo diverge debido a ejecutar transacciones extra erróneas"

# ER_BINLOG_MUST_BE_EMPTY
source: "This operation is not allowed if any GTID has been logged to the binary log. Run RESET MASTER first to erase the log"
spa: "Esta operación no está permitida si cualquier GTID ha sido puesto en historial (log) binario. Ejecuta primero RESET MASTER para borrar el historial (log)"

# ER_NO_SUCH_QUERY
source: "Unknown query id: %lld"
spa: "Id desconocido de consulta (query): %lld"

# ER_BAD_BASE64_DATA
source: "Bad base64 data as position %u"
spa: "Datos base64 malos en posición %u"

# ER_INVALID_ROLE OP000
source: "Invalid role specification %`s"
spa: "Especificación inválida de rol %`s"

# ER_INVALID_CURRENT_USER 0L000
source: "The current user is invalid"
spa: "El usuario en curso no es válido"

# ER_CANNOT_GRANT_ROLE
source: "Cannot grant role '%s' to: %s"
spa: "No puedo conceder rol '%s' a: %s"

# ER_CANNOT_REVOKE_ROLE
source: "Cannot revoke role '%s' from: %s"
spa: "No puedo revocar rol '%s' desde: %s"

# ER_CHANGE_SLAVE_PARALLEL_THREADS_ACTIVE
source: "Cannot change @@slave_parallel_threads while another change is in progress"
spa: "No puedo cambiar @@slave_parallel_threads mientras otro cambio esté en proceso"

# ER_PRIOR_COMMIT_FAILED
source: "Commit failed due to failure of an earlier commit on which this one depends"
spa: "Ha fallado la acometida (commit) debido a un fallo previo en acometida (commit) de la que depende ésta"

# ER_IT_IS_A_VIEW 42S02
source: "'%-.192s' is a view"
spa: "'%-.192s' es una vista"

# ER_SLAVE_SKIP_NOT_IN_GTID
source: "When using parallel replication and GTID with multiple replication domains, @@sql_slave_skip_counter can not be used. Instead, setting @@gtid_slave_pos explicitly can be used to skip to after a given GTID position"
spa: "Al usar réplica paralela y GTID con múltiples dominios de réplica, no se puede usar @@sql_slave_skip_counter. En su lugar, poner @@gtid_slave_pos de forma explícita se puede usar para saltar tras una posición GTID dada"

# ER_TABLE_DEFINITION_TOO_BIG
source: "The definition for table %`s is too big"
spa: "La definición para la tabla %`s es demasiado larga"

# ER_PLUGIN_INSTALLED
source: "Plugin '%-.192s' already installed"
spa: "Ya instalado el enchufe (plugin) '%-.192s'"

# ER_STATEMENT_TIMEOUT 70100
source: "Query execution was interrupted (max_statement_time exceeded)"
spa: "Se ha interrumpido la ejecución de una consulta (query) (excedido max_statement_time)

# ER_SUBQUERIES_NOT_SUPPORTED 42000
source: "%s does not support subqueries or stored functions"
spa: "%s no soporta subconsultas (subqueries) o funciones almacenadas"

# ER_SET_STATEMENT_NOT_SUPPORTED 42000
source: "The system variable %.200s cannot be set in SET STATEMENT."
spa: "La variable del sistema %.200s no se puede poner en SET STATEMENT."

# ER_UNUSED_9
source: "You should never see it"
spa: "Nunca debería vd de ver esto"

# ER_USER_CREATE_EXISTS
source: "Can't create user '%-.64s'@'%-.64s'; it already exists"
spa: "No puedo crear usuario '%-.64s'@'%-.64s'; ya existe"

# ER_USER_DROP_EXISTS
source: "Can't drop user '%-.64s'@'%-.64s'; it doesn't exist"
spa: "No puedo eliminar usuario '%-.64s'@'%-.64s'; no existe"

# ER_ROLE_CREATE_EXISTS
source: "Can't create role '%-.64s'; it already exists"
spa: "No puedo crear rol '%-.64s'; ya existe"

# ER_ROLE_DROP_EXISTS
source: "Can't drop role '%-.64s'; it doesn't exist"
spa: "No puedo eliminar rol '%-.64s'; no existe"

# ER_CANNOT_CONVERT_CHARACTER
source: "Cannot convert '%s' character 0x%-.64s to '%s'"
spa: "No puedo convertir '%s' carácter 0x%-.64s a '%s'"

# ER_INVALID_DEFAULT_VALUE_FOR_FIELD 22007
source: "Incorrect default value '%-.128T' for column '%.192s'"
spa: "Valor por defecto incorrecto '%-.128T' para columna '%.192s'"

# ER_KILL_QUERY_DENIED_ERROR
source: "You are not owner of query %lu"
spa: "No eres el propietario de la consulta (query) %lu"

# ER_NO_EIS_FOR_FIELD
source: "Engine-independent statistics are not collected for column '%s'"
spa: "No se han recolectado estadísticas independientes del motor para la columna '%s'"

# ER_WARN_AGGFUNC_DEPENDENCE
source: "Aggregate function '%-.192s)' of SELECT #%d belongs to SELECT #%d"
spa: "La función de agregación '%-.192s)' del SELECT #%d pertenece a SELECT #%d"

# WARN_INNODB_PARTITION_OPTION_IGNORED
source: "<%-.64s> option ignored for InnoDB partition"
spa: "<%-.64s> opción ignorada para partición InnoDB"

# ER_FILE_CORRUPT
source: "File %s is corrupted"
spa: "El fichero/archivo %s está corrupto"

# ER_ERROR_ON_MASTER
source: "Query partially completed on the master (error on master: %d) and was aborted. There is a chance that your master is inconsistent at this point. If you are sure that your master is ok, run this query manually on the slave and then restart the slave with SET GLOBAL SQL_SLAVE_SKIP_COUNTER=1; START SLAVE;. Query:'%s'"
spa: "Consulta (query) completada de forma parcial en el maestro (master) (error en maestro (master): %d) y se ha abortado. Existe una posibilidad de que su maestro (master) esté inconsitente en este punto. Si está seguro de que su maestro (master) está ok, ejecute esta consulta (query) de forma manual en el esclavo y luego rearranque el esclavo mediante SET GLOBAL SQL_SLAVE_SKIP_COUNTER=1; START SLAVE;. Consulta (query):'%s'"

# ER_INCONSISTENT_ERROR
source: "Query caused different errors on master and slave. Error on master: message (format)='%s' error code=%d; Error on slave:actual message='%s', error code=%d. Default database:'%s'. Query:'%s'"
spa: "La consulta (query) ha ocasionado diferentes errores en el maestro (master) y en el esclavo. Error en maestro (master): mensaje (formato)='%s' código de error=%d; Error en esclavo: mensaje actual='%s', código de error=%d. Base de datos por defecto:'%s'. Consulta (query):'%s'"

# ER_STORAGE_ENGINE_NOT_LOADED
source: "Storage engine for table '%s'.'%s' is not loaded."
spa: "El motor de almacenaje para la tabla '%s'.'%s' no ha sido cargado."

# ER_GET_STACKED_DA_WITHOUT_ACTIVE_HANDLER 0Z002
source: "GET STACKED DIAGNOSTICS when handler not active"
spa: "GET STACKED DIAGNOSTICS cuando el manejador no está activo"

# ER_WARN_LEGACY_SYNTAX_CONVERTED
source: "%s is no longer supported. The statement was converted to %s."
spa: "%s ya no está soportada. Se ha convertido la sentencia a %s."

# ER_BINLOG_UNSAFE_FULLTEXT_PLUGIN
source: "Statement is unsafe because it uses a fulltext parser plugin which may not return the same value on the slave."
spa: "La sentencia no es segura porque usa un enchufe (plugin) analizador de fulltext que puede que no devuelva el mismo valor en el esclavo."

# ER_CANNOT_DISCARD_TEMPORARY_TABLE
source: "Cannot DISCARD/IMPORT tablespace associated with temporary table"
spa: "No puedo DISCARD/IMPORT espacio de tabla asociado con tabla temporal"

# ER_FK_DEPTH_EXCEEDED
source: "Foreign key cascade delete/update exceeds max depth of %d."
spa: "La cascada borrar/actualizar en clave foránea excede la máxima profundidad de %d."

# ER_COL_COUNT_DOESNT_MATCH_PLEASE_UPDATE_V2
source: "Column count of %s.%s is wrong. Expected %d, found %d. Created with MariaDB %d, now running %d. Please use mariadb-upgrade to fix this error."
spa: "El contador de columna de %s.%s está equivocado. Se esperaba %d, hallado %d, Creado con MariaDB %d, ahora ejecutando %d. Por favor, use mariadb-upgrade para arreglar este error."

# ER_WARN_TRIGGER_DOESNT_HAVE_CREATED
source: "Trigger %s.%s.%s does not have CREATED attribute."
spa: "El disparador %s.%s.%s no tiene el atributo CREATED."

# ER_REFERENCED_TRG_DOES_NOT_EXIST_MYSQL
source: "Referenced trigger '%s' for the given action time and event type does not exist."
spa: "El disparador referenciado '%s' para el momento dado de acción y el tipo de evento no existe."

# ER_EXPLAIN_NOT_SUPPORTED
source: "EXPLAIN FOR CONNECTION command is supported only for SELECT/UPDATE/INSERT/DELETE/REPLACE"
spa: "El comando EXPLAIN FOR CONNECTION sólo se soporta para SELECT/UPDATE/INSERT/DELETE/REPLACE"

# ER_INVALID_FIELD_SIZE
source: "Invalid size for column '%-.192s'."
spa: "Tamaño inválido para columna '%-.192s'."

# ER_MISSING_HA_CREATE_OPTION
source: "Table storage engine '%-.64s' found required create option missing"
spa: "El motor hallado de almacenaje de tabla '%-.64s' requería de la opción de crear que falta"

# ER_ENGINE_OUT_OF_MEMORY
source: "Out of memory in storage engine '%-.64s'."
spa: "Memoria agotada en motor de almacenaje '%-.64s'."

# ER_PASSWORD_EXPIRE_ANONYMOUS_USER
source: "The password for anonymous user cannot be expired."
spa: "La contraseña para usuario anónimo no puede expirar."

# ER_SLAVE_SQL_THREAD_MUST_STOP
source: "This operation cannot be performed with a running slave sql thread; run STOP SLAVE SQL_THREAD first"
spa: "Esta operación no se puede realizar con hilo (thread) sql esclavo en ejecución; ejecuta STOP SLAVE SQL_THREAD primero"

# ER_NO_FT_MATERIALIZED_SUBQUERY
source: "Cannot create FULLTEXT index on materialized subquery"
spa: "No puedo crear índice FULLTEXT en subconsulta (subquery) materializada"

# ER_INNODB_UNDO_LOG_FULL
source: "Undo Log error: %s"
spa: "Error de Historial (log) de Deshacer: %s"

# ER_INVALID_ARGUMENT_FOR_LOGARITHM 2201E
source: "Invalid argument for logarithm"
spa: "Argumento inválido para logaritmo"

# ER_SLAVE_CHANNEL_IO_THREAD_MUST_STOP
source: "This operation cannot be performed with a running slave io thread; run STOP SLAVE IO_THREAD FOR CHANNEL '%s' first."
spa: "Esta operación no se puede realizar con un hilo (thread) de e/s de esclavo en ejecución; ejecuta STOP SLAVE IO_THREAD FOR CHANNEL '%s' primero."

# ER_WARN_OPEN_TEMP_TABLES_MUST_BE_ZERO
source: "This operation may not be safe when the slave has temporary tables. The tables will be kept open until the server restarts or until the tables are deleted by any replicated DROP statement. Suggest to wait until slave_open_temp_tables = 0."
spa: "Esta operación puede no ser segura cuando el esclavo tenga tablas temporales. Las tablas serán mantenidas abiertas hasta que el servidor rearranque o hasta que las tablas sean borradas por cualquier sentencia DROP replicada. Se sugiere esperar hasta slave_open_temp_tables = 0."

# ER_WARN_ONLY_MASTER_LOG_FILE_NO_POS
source: "CHANGE MASTER TO with a MASTER_LOG_FILE clause but no MASTER_LOG_POS clause may not be safe. The old position value may not be valid for the new binary log file."
spa: "CHANGE MASTER TO mediante una cláusula MASTER_LOG_FILE pero sin existir cláusula MASTER_LOG_POS puede no ser seguro. El valor viejo de la posición puede no ser válido para el nuevo fichero/archivo binario de historial (log)."

# ER_QUERY_TIMEOUT
source: "Query execution was interrupted, maximum statement execution time exceeded"
spa: "Se ha interrumpido la ejecución de la consulta (query), se ha excedido el tiempo máximo de ejecución de sentencia"

# ER_NON_RO_SELECT_DISABLE_TIMER
source: "Select is not a read only statement, disabling timer"
spa: "Select no es una sentencia de sólo lectura, desactivando cronómetro"

# ER_DUP_LIST_ENTRY
source: "Duplicate entry '%-.192s'."
spa: "Entrada duplicada '%-.192s'."

# ER_SQL_MODE_NO_EFFECT
source: "'%s' mode no longer has any effect. Use STRICT_ALL_TABLES or STRICT_TRANS_TABLES instead."
spa: "El modo '%s' ya no tiene efecto alguno. Use STRICT_ALL_TABLES o STRICT_TRANS_TABLES en su lugar"

# ER_AGGREGATE_ORDER_FOR_UNION
source: "Expression #%u of ORDER BY contains aggregate function and applies to a UNION"
spa: "La expresión #%u de ORDER BY contiene función de agregación y se aplica a UNION"

# ER_AGGREGATE_ORDER_NON_AGG_QUERY
source: "Expression #%u of ORDER BY contains aggregate function and applies to the result of a non-aggregated query"
spa: "La expresión #%u de ORDER BY contiene función de agregación y se aplica al resultado de una consulta (query) no agregada"

# ER_SLAVE_WORKER_STOPPED_PREVIOUS_THD_ERROR
source: "Slave worker has stopped after at least one previous worker encountered an error when slave-preserve-commit-order was enabled. To preserve commit order, the last transaction executed by this thread has not been committed. When restarting the slave after fixing any failed threads, you should fix this worker as well."
spa: "El trabajador esclavo se ha parado tras al menos encontrar un error en trabajador previo cuando slave-preserve-commit-order fue activado. Para preserver el orden de acometida (commit), la última transacción ejecutada por este hilo (thread) no se ha acometido (commit). Al rearrancar el esclavo tras arreglar cualquier hilo (thread) fallido, vd debería de arreglar este trabajador también"

# ER_DONT_SUPPORT_SLAVE_PRESERVE_COMMIT_ORDER
source: "slave_preserve_commit_order is not supported %s."
spa: "slave_preserve_commit_order no está soportado %s."

# ER_SERVER_OFFLINE_MODE
source: "The server is currently in offline mode"
spa: "El servidor se encuentra actualmente en modo fuera de línea"

# ER_GIS_DIFFERENT_SRIDS
source: "Binary geometry function %s given two geometries of different srids: %u and %u, which should have been identical."
spa: "La función binaria de geomertía %s ha dado dos geometrías de diferente srids: %u y %u, que deberían de haber sido idénticas"

# ER_GIS_UNSUPPORTED_ARGUMENT
source: "Calling geometry function %s with unsupported types of arguments."
spa: "Llamando a función de geometría %s con tipos de argumento no soportados."

# ER_GIS_UNKNOWN_ERROR
source: "Unknown GIS error occurred in function %s."
spa: "Ha ocurrido un error GIS desconocido en función %s."

# ER_GIS_UNKNOWN_EXCEPTION
source: "Unknown exception caught in GIS function %s."
spa: "Excepción desconocida capturada en función GIS %s."

# ER_GIS_INVALID_DATA 22023
source: "Invalid GIS data provided to function %s."
spa: "Suministrados datos GIS inválidos a función %s."

# ER_BOOST_GEOMETRY_EMPTY_INPUT_EXCEPTION
source: "The geometry has no data in function %s."
spa: "La geometría no tiene datos en función %s."

# ER_BOOST_GEOMETRY_CENTROID_EXCEPTION
source: "Unable to calculate centroid because geometry is empty in function %s."
spa: "Imposible calcular centroid porque la geometría está vacía en la función %s."

# ER_BOOST_GEOMETRY_OVERLAY_INVALID_INPUT_EXCEPTION
source: "Geometry overlay calculation error: geometry data is invalid in function %s."
spa: "Error de cálculo de superposición de geometría: el dato de geometría es inválido en la función %s."

# ER_BOOST_GEOMETRY_TURN_INFO_EXCEPTION
source: "Geometry turn info calculation error: geometry data is invalid in function %s."
spa: "Error de cálculo de información devuelto: los datos de geometría son inválidos en la función %s."

# ER_BOOST_GEOMETRY_SELF_INTERSECTION_POINT_EXCEPTION
source: "Analysis procedures of intersection points interrupted unexpectedly in function %s."
spa: "Los procedimientos de análisis de puntos de intersección se interrumpieron inesperadamente en la función %s."

# ER_BOOST_GEOMETRY_UNKNOWN_EXCEPTION
source: "Unknown exception thrown in function %s."
spa: "Excepción desconocida lanzada en la función %s."

# ER_STD_BAD_ALLOC_ERROR
source: "Memory allocation error: %-.256s in function %s."
spa: "Error en adjudicación de memoria: %-.256s en la función %s."

# ER_STD_DOMAIN_ERROR
source: "Domain error: %-.256s in function %s."
spa: "Error en dominio: %-.256s en función %s."

# ER_STD_LENGTH_ERROR
source: "Length error: %-.256s in function %s."
spa: "Error de tamaño: %-.256s en función %s."

# ER_STD_INVALID_ARGUMENT
source: "Invalid argument error: %-.256s in function %s."
spa: "Error de argumento inválido: %-.256s en función %s."

# ER_STD_OUT_OF_RANGE_ERROR
source: "Out of range error: %-.256s in function %s."
spa: "Error de fuera de rango: %-.256s en función %s."

# ER_STD_OVERFLOW_ERROR
source: "Overflow error: %-.256s in function %s."
spa: "Error de desbordamiento: %-.256s en función %s."

# ER_STD_RANGE_ERROR
source: "Range error: %-.256s in function %s."
spa: "Error de rango: %-.256s en función %s."

# ER_STD_UNDERFLOW_ERROR
source: "Underflow error: %-.256s in function %s."
spa: "Error de refreno (underflow): %-.256s en la función %s."

# ER_STD_LOGIC_ERROR
source: "Logic error: %-.256s in function %s."
spa: "Error lógico: %-.256s en la función %s."

# ER_STD_RUNTIME_ERROR
source: "Runtime error: %-.256s in function %s."
spa: "Error en tiempo de ejecución: %-.256s en la función %s."

# ER_STD_UNKNOWN_EXCEPTION
source: "Unknown exception: %-.384s in function %s."
spa: "Excepción desconocida: %-.384s en la función %s."

# ER_GIS_DATA_WRONG_ENDIANESS
source: "Geometry byte string must be little endian."
spa: "La cadena de byte en Geometría debe de ser 'little endian'."

# ER_CHANGE_MASTER_PASSWORD_LENGTH
source: "The password provided for the replication user exceeds the maximum length of 32 characters"
spa: "La contraseña suministrada para el usuario de réplica excede el tamaño máximo de 32 caracteres"

# ER_USER_LOCK_WRONG_NAME 42000
source: "Incorrect user-level lock name '%-.192s'."
spa: "Nombre de bloqueo incorrecto a nivel de usuario '%-.192s'."

# ER_USER_LOCK_DEADLOCK
source: "Deadlock found when trying to get user-level lock; try rolling back transaction/releasing locks and restarting lock acquisition."
spa: "Hallado estancamiento (deadlock) al intentar obtener bloqueo a nivel de usuario; intente retroceder (roll back) bloqueos de transacción/entrega y rearranque la adquisición de bloqueo."

# ER_REPLACE_INACCESSIBLE_ROWS
source: "REPLACE cannot be executed as it requires deleting rows that are not in the view"
spa: "REPLACE no se puede ejecutar ya que requiere borrar filas que no están en la vista"

# ER_ALTER_OPERATION_NOT_SUPPORTED_REASON_GIS
source: "Do not support online operation on table with GIS index"
spa: "No soporta operación en línea en tabla con índice GIS"

# ER_UNUSED_26 0A000
source: "This error never happens"
spa: "Este error nunca ocurre"

# ER_UNUSED_27
source: "This error never happens"
spa: "Este error nunca ocurre"

# ER_WITH_COL_WRONG_LIST
source: "WITH column list and SELECT field list have different column counts"
spa: "La lista de columnas de WITH y lista de campos de SELECT tienen diferentes contadores de columna"

# ER_TOO_MANY_DEFINITIONS_IN_WITH_CLAUSE
source: "Too many WITH elements in WITH clause"
spa: "Demasiados elementos WITH en cláusua WITH"

# ER_DUP_QUERY_NAME
source: "Duplicate query name %`-.64s in WITH clause"
spa: "Nombre de consulta (query) %`-.64s duplicada en cláusula WITH"

# ER_RECURSIVE_WITHOUT_ANCHORS
source: "No anchors for recursive WITH element '%s'"
spa: "No hay anclajes para elemento WITH recursivo '%s'"

# ER_UNACCEPTABLE_MUTUAL_RECURSION
source: "Unacceptable mutual recursion with anchored table '%s'"
spa: "Recursión mutua inaceptable con tabla anclada '%s'"

# ER_REF_TO_RECURSIVE_WITH_TABLE_IN_DERIVED
source: "Reference to recursive WITH table '%s' in materialized derived"
spa: "Referencia recursiva con WITH tabla '%s' en derivada materializada"

# ER_WRONG_WINDOW_SPEC_NAME
source: "Window specification with name '%s' is not defined"
spa: "Especificación de ventana con nombre '%s' no definida"

# ER_DUP_WINDOW_NAME
source: "Multiple window specifications with the same name '%s'"
spa: "Múltiples especificaciones de ventana con el mismo nombre '%s'"
