Repository: vladbogo/test-translation
Catalog: spa.xlf
Languages: spa

# ER_EMPTY_ROW_IN_TVC
source: "Row with no elements is not allowed in table value constructor in this context"
spa: "Fila sin elementos no se permite en constructor de valor de tabla en este contexto"

# ER_VERS_QUERY_IN_PARTITION
source: "SYSTEM_TIME partitions in table %`s does not support historical query"
spa: "Las particiones SYSTEM_TIME en la tabla %`s no soportan consulta (query) histórica"

# ER_KEY_DOESNT_SUPPORT
source: "%s index %`s does not support this operation"
spa: "%s índice %`s no soporta esta operación"

# ER_ALTER_OPERATION_TABLE_OPTIONS_NEED_REBUILD
source: "Changing table options requires the table to be rebuilt"
spa: "Cambiar las opciones de tabla requiere que la tabla sea reconstruida"

# ER_BACKUP_LOCK_IS_ACTIVE
source: "Can't execute the command as you have a BACKUP STAGE active"
spa: "No puedo ejecutar el comando cuando vd tiene activo un BACKUP STAGE"

# ER_BACKUP_NOT_RUNNING
source: "You must start backup with \"BACKUP STAGE START\""
spa: "Vd debe de arracar respaldo mediante \"BACKUP STAGE START\""

# ER_BACKUP_WRONG_STAGE
source: "Backup stage '%s' is same or before current backup stage '%s'"
spa: "La fase de respaldo '%s' es la misma o anterior a la fase de respaldo actual '%s'"

# ER_BACKUP_STAGE_FAILED
source: "Backup stage '%s' failed"
spa: "La fase de respaldo '%s' ha fallado"

# ER_BACKUP_UNKNOWN_STAGE
source: "Unknown backup stage: '%s'. Stage should be one of START, FLUSH, BLOCK_DDL, BLOCK_COMMIT or END"
spa: "Fase de respaldo desconocida: '%s'. La fase debería de ser una de START, FLUSH, BLOCK_DDL, BLOCK_COMMIT o END"

# ER_USER_IS_BLOCKED
source: "User is blocked because of too many credential errors; unblock with 'FLUSH PRIVILEGES'"
spa: "El usuario está bloqueado a causa de demasiados errores de credenciales; desbloquee mediante 'FLUSH PRIVILEGES'"

# ER_ACCOUNT_HAS_BEEN_LOCKED
source: "Access denied, this account is locked"
spa: "Acceso denegado, esta cuenta está bloqueada"

# ER_PERIOD_TEMPORARY_NOT_ALLOWED
source: "Application-time period table cannot be temporary"
spa: "Una tabla de período de momento-de-aplicación no puede ser temporal"

# ER_PERIOD_TYPES_MISMATCH
source: "Fields of PERIOD FOR %`s have different types"
spa: "Los campos de PERIOD FOR %`s tienen tipos diferentes"

# ER_MORE_THAN_ONE_PERIOD
source: "Cannot specify more than one application-time period"
spa: "No se puede especificar más de un período de momento de aplicación"

# ER_PERIOD_FIELD_WRONG_ATTRIBUTES
source: "Period field %`s cannot be %s"
spa: "El campo de período %`s no puede ser %s"

# ER_PERIOD_NOT_FOUND
source: "Period %`s is not found in table"
spa: "El período %`s no se ha hallado en la tabla"

# ER_PERIOD_COLUMNS_UPDATED
source: "Column %`s used in period %`s specified in update SET list"
spa: "La columna %`s usada en período %`s especificado en lista de actualizar SET"

# ER_PERIOD_CONSTRAINT_DROP
source: "Can't DROP CONSTRAINT `%s`. Use DROP PERIOD `%s` for this"
spa: "No puedo DROP CONSTRAINT `%s`. Use DROP PERIOD `%s` para esto"

# ER_TOO_LONG_KEYPART 42000 S1009
source: "Specified key part was too long; max key part length is %u bytes"
spa: "La parte de clave especificada es demasiado larga; el tamaño máximo de la parte de clave es de %u bytes"

# ER_TOO_LONG_DATABASE_COMMENT
source: "Comment for database '%-.64s' is too long (max = %u)"
spa: "El comentario para la base de datos '%-.64s' es demasiado largo (máx = %u)"

# ER_UNKNOWN_DATA_TYPE
source: "Unknown data type: '%-.64s'"
spa: "Tipo de datos desconocido: '%-.64s'"

# ER_UNKNOWN_OPERATOR
source: "Operator does not exists: '%-.128s'"
spa: "El operador no existe: '%-.128s'"

# ER_WARN_HISTORY_ROW_START_TIME
source: "Table `%s.%s` history row start '%s' is later than row end '%s'"
spa: "En la historia de la tabla `%s.%s` el inicio de fila '%s' es posterior al fin de fila '%s'"

# ER_PART_STARTS_BEYOND_INTERVAL
source: "%`s: STARTS is later than query time, first history partition may exceed INTERVAL value"
spa: "%`s: STARTS es posterior al momento de consulta (query), la primera partición de historia puede exceder el valor INTERVAL"

# ER_GALERA_REPLICATION_NOT_SUPPORTED
source: "Galera replication not supported"
spa: "La replicación en Galera no está soportada"

# ER_LOAD_INFILE_CAPABILITY_DISABLED
source: "The used command is not allowed because the MariaDB server or client has disabled the local infile capability"
spa: "El comando usado no está permitido porque el servidor MariaDB o el cliente han desactivado la capacidad 'local infile'"

# ER_NO_SECURE_TRANSPORTS_CONFIGURED
source: "No secure transports are configured, unable to set --require_secure_transport=ON"
spa: "No se han configurado transportes seguros, imposible poner --require_secure_transport=ON"

# ER_SLAVE_IGNORED_SHARED_TABLE
source: "Slave SQL thread ignored the '%s' because table is shared"
spa: "Hilo (thread) SQL esclavo ignoró la '%s' porque la tabla está compartida"

# ER_NO_AUTOINCREMENT_WITH_UNIQUE
source: "AUTO_INCREMENT column %`s cannot be used in the UNIQUE index %`s"
spa: "La columna %'s con AUTO_INCREMENT no se puede usar en índice UNIQUE %`s"

# ER_KEY_CONTAINS_PERIOD_FIELDS
source: "Key %`s cannot explicitly include column %`s"
spa: "La clave %`s no puede incluir de forma explícita la columna %`s"

# ER_KEY_CANT_HAVE_WITHOUT_OVERLAPS
source: "Key %`s cannot have WITHOUT OVERLAPS"
spa: "La clave %`s no puede tener WITHOUT OVERLAPS"

# ER_NOT_ALLOWED_IN_THIS_CONTEXT
source: "'%-.128s' is not allowed in this context"
spa: "'%-.128s' no está permitido en este contexto"

# ER_DATA_WAS_COMMITED_UNDER_ROLLBACK
source: "Engine %s does not support rollback. Changes were committed during rollback call"
spa: "El motor %s no soporta retroceso (rollback). Los cambios se acometieron (commit) durante la llamada a retroceso (rollback)"

# ER_PK_INDEX_CANT_BE_IGNORED
source: "A primary key cannot be marked as IGNORE"
spa: "Una clave primaria no se puede marcar como IGNORE"

# ER_BINLOG_UNSAFE_SKIP_LOCKED
source: "SKIP LOCKED makes this statement unsafe"
spa: "SKIP LOCKED hace que esta sentencia sea no segura"

# ER_JSON_TABLE_ERROR_ON_FIELD
source: "Field '%s' can't be set for JSON_TABLE '%s'."
spa: "El campo '%s' no se puede poner para JSON_TABLE '%s'."

# ER_JSON_TABLE_ALIAS_REQUIRED
source: "Every table function must have an alias."
spa: "Cada función de tabla debe de tener un alias."

# ER_JSON_TABLE_SCALAR_EXPECTED
source: "Can't store an array or an object in the scalar column '%s' of JSON_TABLE '%s'."
spa: "No puedo guardar un arreglo o un objeto en la columna escalar '%s' de JSON_TABLE '%s'."

# ER_JSON_TABLE_MULTIPLE_MATCHES
source: "Can't store multiple matches of the path in the column '%s' of JSON_TABLE '%s'."
spa: "No puedo guardar múltiples coincidencias de la ruta en la columna '%s' de JSON_TABLE '%s'."

# ER_WITH_TIES_NEEDS_ORDER
source: "FETCH ... WITH TIES requires ORDER BY clause to be present"
spa: "FETCH ... WITH TIES requiere que esté presente la cláusula ORDER BY"

# ER_REMOVED_ORPHAN_TRIGGER
source: "Dropped orphan trigger '%-.64s', originally created for table: '%-.192s'"
spa: "Eliminado disparador huérfano '%-.64s', creado originálmente para la tabla: '%-.192s'"

# ER_STORAGE_ENGINE_DISABLED
source: "Storage engine %s is disabled"
spa: "El motor de almacenaje %s está desactivado"
