Repository: vladbogo/test-translation
Catalog: spa.xlf
Languages: spa

# ER_NET_READ_INTERRUPTED 08S01
source: "Got timeout reading communication packets"
spa: "Obtenido tiempo agotado (timeout) leyendo paquetes de comunicación"

# ER_NET_ERROR_ON_WRITE 08S01
source: "Got an error writing communication packets"
spa: "Obtenido un error escribiendo paquetes de comunicación"

# ER_NET_WRITE_INTERRUPTED 08S01
source: "Got timeout writing communication packets"
spa: "Obtenido tiempo agotado (timeout) escribiendo paquetes de comunicación"

# ER_TOO_LONG_STRING 42000
source: "Result string is longer than 'max_allowed_packet' bytes"
spa: "La cadena resultante es mayor de max_allowed_packet bytes"

# ER_TABLE_CANT_HANDLE_BLOB 42000
source: "Storage engine %s doesn't support BLOB/TEXT columns"
spa: "El motor de almacenaje %s no soporta columnas de tipo BLOB/TEXT"

# ER_TABLE_CANT_HANDLE_AUTO_INCREMENT 42000
source: "Storage engine %s doesn't support AUTO_INCREMENT columns"
spa: "El motor de almacenaje %s no soporta columnas AUTO_INCREMENT"

# ER_DELAYED_INSERT_TABLE_LOCKED
source: "INSERT DELAYED can't be used with table '%-.192s' because it is locked with LOCK TABLES"
spa: "INSERT DELAYED no puede ser usado con la tabla '%-.192s' porque esta bloqueada con LOCK TABLES"

# ER_WRONG_COLUMN_NAME 42000
source: "Incorrect column name '%-.100s'"
spa: "Nombre Incorrecto de columna '%-.100s'"

# ER_WRONG_KEY_COLUMN 42000
source: "The storage engine %s can't index column %`s"
spa: "El motor de almacenaje %s no puede indizar la columna %`s"

# ER_WRONG_MRG_TABLE
source: "Unable to open underlying table which is differently defined or of non-MyISAM type or doesn't exist"
spa: "Incapaz de abrir la tabla subyacente por estar definida de forma diferente o por no ser del tipo no-MyISAM o por no existir"

# ER_DUP_UNIQUE 23000
source: "Can't write, because of unique constraint, to table '%-.192s'"
spa: "No puedo grabar, debido a restricción única, en la tabla '%-.192s'"

# ER_BLOB_KEY_WITHOUT_LENGTH 42000
source: "BLOB/TEXT column '%-.192s' used in key specification without a key length"
spa: "Columna BLOB/TEXT '%-.192s', usada en especificación de clave, sin tamaño"

# ER_PRIMARY_CANT_HAVE_NULL 42000
source: "All parts of a PRIMARY KEY must be NOT NULL; if you need NULL in a key, use UNIQUE instead"
spa: "Todas las partes de una PRIMARY KEY deben de ser NOT NULL; si necesita NULL en una clave, use UNIQUE en su lugar"

# ER_TOO_MANY_ROWS 42000
source: "Result consisted of more than one row"
spa: "Resultado compuesto de más de una fila"

# ER_REQUIRES_PRIMARY_KEY 42000
source: "This table type requires a primary key"
spa: "Este tipo de tabla necesita de una clave primaria"

# ER_NO_RAID_COMPILED
source: "This version of MariaDB is not compiled with RAID support"
spa: "Esta versión de MariaDB no ha sido compilada con soporte para RAID"

# ER_UPDATE_WITHOUT_KEY_IN_SAFE_MODE
source: "You are using safe update mode and you tried to update a table without a WHERE that uses a KEY column"
spa: "Está usando modo de actualización segura y ha intentado actualizar una tabla sin un WHERE que use una columna KEY"

# ER_KEY_DOES_NOT_EXISTS 42000 S1009
source: "Key '%-.192s' doesn't exist in table '%-.192s'"
spa: "La clave '%-.192s' no existe en la tabla '%-.192s'"

# ER_CHECK_NO_SUCH_TABLE 42000
source: "Can't open table"
spa: "No puedo abrir tabla"

# ER_CHECK_NOT_IMPLEMENTED 42000
source: "The storage engine for the table doesn't support %s"
spa: "El motor de almacenaje para la tabla no soporta %s"

# ER_CANT_DO_THIS_DURING_AN_TRANSACTION 25000
source: "You are not allowed to execute this command in a transaction"
spa: "No tiene el permiso para ejecutar este comando en una transacción"

# ER_ERROR_DURING_COMMIT
source: "Got error %M during COMMIT"
spa: "Obtenido error %M durante COMMIT"

# ER_ERROR_DURING_ROLLBACK
source: "Got error %M during ROLLBACK"
spa: "Obtenido error %M durante ROLLBACK"

# ER_ERROR_DURING_FLUSH_LOGS
source: "Got error %M during FLUSH_LOGS"
spa: "Obtenido error %M durante FLUSH_LOGS"

# ER_ERROR_DURING_CHECKPOINT
source: "Got error %M during CHECKPOINT"
spa: "Obtenido error %M durante CHECKPOINT"

# ER_NEW_ABORTING_CONNECTION 08S01
source: "Aborted connection %lld to db: '%-.192s' user: '%-.48s' host: '%-.64s' (%-.64s)"
spa: "Abortada conexión %lld a la base de datos: '%-.192s' usuario: '%-.48s' equipo: '%-.64s' (%-.64s)"

# ER_UNUSED_10
source: "You should never see it"
spa: "Nunca lo debería vd de ver"

# ER_FLUSH_MASTER_BINLOG_CLOSED
source: "Binlog closed, cannot RESET MASTER"
spa: "Binlog cerrado, no puedo hacer RESET MASTER"

# ER_INDEX_REBUILD
source: "Failed rebuilding the index of dumped table '%-.192s'"
spa: "Fallo reconstruyendo el índice del volcado de la tabla '%-.192s'"

# ER_MASTER
source: "Error from master: '%-.64s'"
spa: "Error del maestro (master): '%-.64s'"

# ER_MASTER_NET_READ 08S01
source: "Net error reading from master"
spa: "Error de red leyendo del maestro (master)"

# ER_MASTER_NET_WRITE 08S01
source: "Net error writing to master"
spa: "Error de red grabando en maestro (master)"

# ER_FT_MATCHING_KEY_NOT_FOUND
source: "Can't find FULLTEXT index matching the column list"
spa: "No puedo encontrar índice FULLTEXT coincidente con la lista de columnas"

# ER_LOCK_OR_ACTIVE_TRANSACTION
source: "Can't execute the given command because you have active locked tables or an active transaction"
spa: "No puedo ejecutar el comando dado porque tiene tablas activas bloqueadas o una transacción activa"

# ER_UNKNOWN_SYSTEM_VARIABLE
source: "Unknown system variable '%-.*s'"
spa: "Variable de sistema '%-.*s' desconocida"

# ER_CRASHED_ON_USAGE
source: "Table '%-.192s' is marked as crashed and should be repaired"
spa: "La tabla '%-.192s' está marcada como estropeada y debe de ser reparada"

# ER_CRASHED_ON_REPAIR
source: "Table '%-.192s' is marked as crashed and last (automatic?) repair failed"
spa: "La tabla '%-.192s' está marcada como estropeada y la última reparación (¿automática?) falló"

# ER_WARNING_NOT_COMPLETE_ROLLBACK
source: "Some non-transactional changed tables couldn't be rolled back"
spa: "Algunas tablas no transaccionales ya cambiadas no puedieron ser retrocedidas (rolled back)"

# ER_TRANS_CACHE_FULL
source: "Multi-statement transaction required more than 'max_binlog_cache_size' bytes of storage; increase this mariadbd variable and try again"
spa: "Transacción multi-sentencia requirió de más de 'max_binlog_cache_size' bytes de almacenamiento"

# ER_SLAVE_MUST_STOP
source: "This operation cannot be performed as you have a running slave '%2$*1$s'; run STOP SLAVE '%2$*1$s' first"
spa: "Esta operación no puede ser realizada con el esclavo '%2$*1$s' en marcha; primero ejecute STOP SLAVE '%2$*1$s'"

# ER_SLAVE_NOT_RUNNING
source: "This operation requires a running slave; configure slave and do START SLAVE"
spa: "Esta operación requiere de un esclavo funcionando; configure el esclavo y haga el START SLAVE"

# ER_BAD_SLAVE
source: "The server is not configured as slave; fix in config file or with CHANGE MASTER TO"
spa: "El servidor no está configurado como esclavo; arréglelo en el fichero/archivo de configuración o con CHANGE MASTER TO"

# ER_MASTER_INFO
source: "Could not initialize master info structure for '%.*s'; more error messages can be found in the MariaDB error log"
spa: "No pude inicializar estructura info de maestro (master) para '%.*s'; se pueden ver más mensajes de error en el historial (log) de errores de MariaDB"

# ER_SLAVE_THREAD
source: "Could not create slave thread; check system resources"
spa: "No puedo crear el hilo (thread) esclavo; verifique recursos del sistema"

# ER_TOO_MANY_USER_CONNECTIONS 42000
source: "User %-.64s already has more than 'max_user_connections' active connections"
spa: "El usuario %-.64s ya tiene más de 'max_user_connections' conexiones activas"

# ER_SET_CONSTANTS_ONLY
source: "You may only use constant expressions in this statement"
spa: "Sólo puede usar expresiones constantes en esta sentencia"

# ER_LOCK_WAIT_TIMEOUT
source: "Lock wait timeout exceeded; try restarting transaction"
spa: "Tiempo de espera de bloqueo excedido; intente rearrancar la transacción"

# ER_LOCK_TABLE_FULL
source: "The total number of locks exceeds the lock table size"
spa: "El número total de bloqueos excede el tamaño de bloqueo de la tabla"

# ER_READ_ONLY_TRANSACTION 25000
source: "Update locks cannot be acquired during a READ UNCOMMITTED transaction"
spa: "No se pueden adquirir bloqueos de actualización durante una transacción READ UNCOMMITTED"

# ER_DROP_DB_WITH_READ_LOCK
source: "DROP DATABASE not allowed while thread is holding global read lock"
spa: "DROP DATABASE no permitido mientras un hilo (thread) está ejerciendo un bloqueo de lectura global"

# ER_CREATE_DB_WITH_READ_LOCK
source: "CREATE DATABASE not allowed while thread is holding global read lock"
spa: "CREATE DATABASE no permitido mientras un hilo (thread) está manteniendo un bloqueo de lectura global"

# ER_WRONG_ARGUMENTS
source: "Incorrect arguments to %s"
spa: "Argumentos incorrectos para %s"

# ER_NO_PERMISSION_TO_CREATE_USER 42000
source: "'%s'@'%s' is not allowed to create new users"
spa: "'%s'@'%s' no está permitido para crear nuevos usuarios"

# ER_UNION_TABLES_IN_DIFFERENT_DIR
source: "Incorrect table definition; all MERGE tables must be in the same database"
spa: "Definición incorrecta de la tabla; todas las tablas MERGE deben de estar en la misma base de datos"

# ER_LOCK_DEADLOCK 40001
source: "Deadlock found when trying to get lock; try restarting transaction"
spa: "Encontrado estancamiento (deadlock) al intentar obtener el bloqueo; intente volver a comenzar la transacción"

# ER_TABLE_CANT_HANDLE_FT
source: "The storage engine %s doesn't support FULLTEXT indexes"
spa: "El motor de almacenaje %s no soporta índices FULLTEXT"

# ER_CANNOT_ADD_FOREIGN
source: "Cannot add foreign key constraint for `%s`"
spa: "No puedo añadir restricción de clave foránea para `%s`"

# ER_NO_REFERENCED_ROW 23000
source: "Cannot add or update a child row: a foreign key constraint fails"
spa: "No puedo añadir o actualizar una fila hija: ha fallado una restrición de clave foránea"

# ER_ROW_IS_REFERENCED 23000
source: "Cannot delete or update a parent row: a foreign key constraint fails"
spa: "No puedo borrar o actualizar una fila padre: ha fallado una restrición de clave foránea"

# ER_CONNECT_TO_MASTER 08S01
source: "Error connecting to master: %-.128s"
spa: "Error conectando al maestro (master): %-.128s"

# ER_QUERY_ON_MASTER
source: "Error running query on master: %-.128s"
spa: "Error ejecutando consulta (query) en maestro (master): %-.128s"

# ER_ERROR_WHEN_EXECUTING_COMMAND
source: "Error when executing command %s: %-.128s"
spa: "Error al ejecutar comando %s: %-.128s"

# ER_WRONG_USAGE
source: "Incorrect usage of %s and %s"
spa: "Uso incorrecto de %s y %s"

# ER_WRONG_NUMBER_OF_COLUMNS_IN_SELECT 21000
source: "The used SELECT statements have a different number of columns"
spa: "Las sentencias SELECT usadas tienen un número diferente de columnas"

# ER_CANT_UPDATE_WITH_READLOCK
source: "Can't execute the query because you have a conflicting read lock"
spa: "No puedo ejecutar la consulta (query) porque vd tiene un conflicto de bloqueo de lectura"

# ER_MIXING_NOT_ALLOWED
source: "Mixing of transactional and non-transactional tables is disabled"
spa: "Desactivada la mezcla de tablas transaccionales y no transaccionales"

# ER_DUP_ARGUMENT
source: "Option '%s' used twice in statement"
spa: "Opción '%s' usada dos veces en la sentencia"

# ER_USER_LIMIT_REACHED 42000
source: "User '%-.64s' has exceeded the '%s' resource (current value: %ld)"
spa: "El usuario '%-.64s' ha excedido el recurso '%s' (valor actual: %ld)"

# ER_SPECIFIC_ACCESS_DENIED_ERROR 42000
source: "Access denied; you need (at least one of) the %-.128s privilege(s) for this operation"
spa: "Acceso denegado. Usted necesita (al menos un(os)) privilegio(s) %-.128s para esta operación"

# ER_LOCAL_VARIABLE
source: "Variable '%-.64s' is a SESSION variable and can't be used with SET GLOBAL"
spa: "La variable '%-.64s' es una variable de SESSION y no puede ser usada con SET GLOBAL"

# ER_GLOBAL_VARIABLE
source: "Variable '%-.64s' is a GLOBAL variable and should be set with SET GLOBAL"
spa: "La variable '%-.64s' es una variable GLOBAL y debería de ser configurada con SET GLOBAL"

# ER_NO_DEFAULT 42000
source: "Variable '%-.64s' doesn't have a default value"
spa: "La variable '%-.64s' no tiene un valor por defecto"

# ER_WRONG_VALUE_FOR_VAR 42000
source: "Variable '%-.64s' can't be set to the value of '%-.200T'"
spa: "La variable '%-.64s' no puede ser configurada para el valor de '%-.200T'"

# ER_WRONG_TYPE_FOR_VAR 42000
source: "Incorrect argument type to variable '%-.64s'"
spa: "Tipo de argumento incorrecto para variable '%-.64s'"

# ER_VAR_CANT_BE_READ
source: "Variable '%-.64s' can only be set, not read"
spa: "La variable '%-.64s' solamente puede ser configurada, no leída"

# ER_CANT_USE_OPTION_HERE 42000
source: "Incorrect usage/placement of '%s'"
spa: "Incorrecto uso/colocación de '%s'"

# ER_NOT_SUPPORTED_YET 42000
source: "This version of MariaDB doesn't yet support '%s'"
spa: "Esta versión de MariaDB no soporta todavía '%s'"

# ER_MASTER_FATAL_ERROR_READING_BINLOG
source: "Got fatal error %d from master when reading data from binary log: '%-.320s'"
spa: "Obtenido error fatal %d del maestro (master) al leer datos del historial (log) binario: '%-.320s'"

# ER_SLAVE_IGNORED_TABLE
source: "Slave SQL thread ignored the query because of replicate-*-table rules"
spa: "El hilo (thread) SQL esclavo ha ignorado la consulta (query) debido a las reglas de replicar-*-tabla"

# ER_INCORRECT_GLOBAL_LOCAL_VAR
source: "Variable '%-.192s' is a %s variable"
spa: "La variable '%-.192s' es una variable %s"

# ER_WRONG_FK_DEF 42000
source: "Incorrect foreign key definition for '%-.192s': %s"
spa: "Definición de clave foránea incorrecta para '%-.192s': %s"

# ER_KEY_REF_DO_NOT_MATCH_TABLE_REF
source: "Key reference and table reference don't match"
spa: "La referencia de clave y la referencia de tabla no coinciden"

# ER_OPERAND_COLUMNS 21000
source: "Operand should contain %d column(s)"
spa: "El operando debería de contener %d columna(s)"

# ER_SUBQUERY_NO_1_ROW 21000
source: "Subquery returns more than 1 row"
spa: "La subconsulta (subquery) devuelve más de 1 fila"

# ER_UNKNOWN_STMT_HANDLER
source: "Unknown prepared statement handler (%.*s) given to %s"
spa: "Manejador desconocido de sentencia preparada (%.*s) dado para %s"

# ER_CORRUPT_HELP_DB
source: "Help database is corrupt or does not exist"
spa: "O la Base de datos de Ayuda está corrupta o no existe"

# ER_CYCLIC_REFERENCE
source: "Cyclic reference on subqueries"
spa: "Referencia cíclica en subconsultas (subqueries)"

# ER_AUTO_CONVERT
source: "Converting column '%s' from %s to %s"
spa: "Convirtiendo la columna '%s' de %s a %s"

# ER_ILLEGAL_REFERENCE 42S22
source: "Reference '%-.64s' not supported (%s)"
spa: "Referencia '%-.64s' no soportada (%s)"

# ER_DERIVED_MUST_HAVE_ALIAS 42000
source: "Every derived table must have its own alias"
spa: "Cada tabla derivada debe de tener su propio alias"

# ER_SELECT_REDUCED 01000
source: "Select %u was reduced during optimization"
spa: "La selección %u fué reducida durante optimización"

# ER_TABLENAME_NOT_ALLOWED_HERE 42000
source: "Table '%-.192s' from one of the SELECTs cannot be used in %-.32s"
spa: "La tabla '%-.192s' de uno de los SELECT no puede ser usada en %-.32s"

# ER_NOT_SUPPORTED_AUTH_MODE 08004
source: "Client does not support authentication protocol requested by server; consider upgrading MariaDB client"
spa: "El cliente no soporta protocolo de autenticación requerido por el servidor; considere mejorar el cliente MariaDB"

# ER_SPATIAL_CANT_HAVE_NULL 42000
source: "All parts of a SPATIAL index must be NOT NULL"
spa: "Todas las partes de un índice SPATIAL deben de ser NOT NULL"

# ER_COLLATION_CHARSET_MISMATCH 42000
source: "COLLATION '%s' is not valid for CHARACTER SET '%s'"
spa: "El COTEJO (COLLATION) '%s' no es válido para CHARACTER SET '%s'"

# ER_SLAVE_WAS_RUNNING
source: "Slave is already running"
spa: "El esclavo ya está funcionando"

# ER_SLAVE_WAS_NOT_RUNNING
source: "Slave already has been stopped"
spa: "El esclavo ya fué parado"

# ER_TOO_BIG_FOR_UNCOMPRESS
source: "Uncompressed data size too large; the maximum size is %d (probably, length of uncompressed data was corrupted)"
spa: "Tamaño demasiado grande para datos descomprimidos; el máximo tamaño es %d. (probablemente, el tamaño de datos descomprimidos fué corrompido)"

# ER_ZLIB_Z_MEM_ERROR
source: "ZLIB: Not enough memory"
spa: "ZLIB: No hay suficiente memoria"

# ER_ZLIB_Z_BUF_ERROR
source: "ZLIB: Not enough room in the output buffer (probably, length of uncompressed data was corrupted)"
spa: "ZLIB: No hay suficiente espacio en el búfer de salida (probablemente, el tamaño de datos descomprimidos fué corrompido)"

# ER_ZLIB_Z_DATA_ERROR
source: "ZLIB: Input data corrupted"
spa: "ZLIB: Dato de entrada corrupto"

# ER_CUT_VALUE_GROUP_CONCAT
source: "Row %u was cut by %s)"
spa: "La fila %u ha sido cortada por %s)"

# ER_WARN_TOO_FEW_RECORDS 01000
source: "Row %lu doesn't contain data for all columns"
spa: "La fila %lu no contiene datos para todas las columnas"

# ER_WARN_TOO_MANY_RECORDS 01000
source: "Row %lu was truncated; it contained more data than there were input columns"
spa: "La fila %lu fué truncada; contenía más datos que columnas de entrada"

# ER_WARN_NULL_TO_NOTNULL 22004
source: "Column set to default value; NULL supplied to NOT NULL column '%s' at row %lu"
spa: "Columna puesta a valor por defecto; NULL suministrado para columna NOT NULL '%s' en la fila %lu"

# ER_WARN_DATA_OUT_OF_RANGE 22003
source: "Out of range value for column '%s' at row %lu"
spa: "Valor fuera de rango para la columna '%s' en la fila %lu"

# WARN_DATA_TRUNCATED 01000
source: "Data truncated for column '%s' at row %lu"
spa: "Datos truncados para la columna '%s' en la fila %lu"

# ER_WARN_USING_OTHER_HANDLER
source: "Using storage engine %s for table '%s'"
spa: "Usando motor de almacenaje %s para la tabla '%s'"

# ER_CANT_AGGREGATE_2COLLATIONS
source: "Illegal mix of collations (%s,%s) and (%s,%s) for operation '%s'"
spa: "Mezcla ilegal de cotejos (collations) (%s,%s) y (%s,%s) para la operación '%s'"

# ER_DROP_USER
source: "Cannot drop one or more of the requested users"
spa: "No puedo eliminar uno o más de los usuarios solicitados"

# ER_REVOKE_GRANTS
source: "Can't revoke all privileges for one or more of the requested users"
spa: "No puedo revocar todos los privilegios para uno o más de los usuarios solicitados"

# ER_CANT_AGGREGATE_3COLLATIONS
source: "Illegal mix of collations (%s,%s), (%s,%s), (%s,%s) for operation '%s'"
spa: "Mezcla ilegal de cotejos (collations) (%s,%s), (%s,%s), (%s,%s) para la operación '%s'"

# ER_CANT_AGGREGATE_NCOLLATIONS
source: "Illegal mix of collations for operation '%s'"
spa: "Mezcla ilegal de cotejos (collations) para la operación '%s'"

# ER_VARIABLE_IS_NOT_STRUCT
source: "Variable '%-.64s' is not a variable component (can't be used as XXXX.variable_name)"
spa: "La variable '%-.64s' no es un componente variable (No puede ser usada como XXXX.variable_name)"

# ER_UNKNOWN_COLLATION
source: "Unknown collation: '%-.64s'"
spa: "Cotejo (Collation) desconocido: '%-.64s'"

# ER_SLAVE_IGNORED_SSL_PARAMS
source: "SSL parameters in CHANGE MASTER are ignored because this MariaDB slave was compiled without SSL support; they can be used later if MariaDB slave with SSL is started"
spa: "Los parámetros SSL en CHANGE MASTER son ignorados porque este esclavo MariaDB fue compilado sin soporte SSL; pueden ser usados después cuando el esclavo MariaDB con SSL sea arrancado"

# ER_SERVER_IS_IN_SECURE_AUTH_MODE
source: "Server is running in --secure-auth mode, but '%s'@'%s' has a password in the old format; please change the password to the new format"
spa: "El servidor se está ejecutando en modo --secure-auth, pero '%s'@'%s' tiene una contraseña con formato antiguo; por favor cambie la contraseña al nuevo formato"

# ER_WARN_FIELD_RESOLVED
source: "Field or reference '%-.192s%s%-.192s%s%-.192s' of SELECT #%d was resolved in SELECT #%d"
spa: "El campo o la referencia '%-.192s%s%-.192s%s%-.192s' de SELECT #%d se resolvió en SELECT #%d"

# ER_BAD_SLAVE_UNTIL_COND
source: "Incorrect parameter or combination of parameters for START SLAVE UNTIL"
spa: "Parámetro incorrecto o combinación de parámetros para START SLAVE UNTIL"

# ER_MISSING_SKIP_SLAVE
source: "It is recommended to use --skip-slave-start when doing step-by-step replication with START SLAVE UNTIL; otherwise, you will get problems if you get an unexpected slave's mariadbd restart"
spa: "Se recomienda usar --skip-slave-start al hacer réplica paso a paso con START SLAVE UNTIL; en caso contrario, obtendrá problemas si tiene lugar un rearranque inesperado del esclavo mariadb"

# ER_UNTIL_COND_IGNORED
source: "SQL thread is not to be started so UNTIL options are ignored"
spa: "Un hilo (thread) SQL no ha de ser arrancado de esa manera HASTA que las opciones sean ignordas"

# ER_WRONG_NAME_FOR_INDEX 42000
source: "Incorrect index name '%-.100s'"
spa: "Nombre de índice incorrecto '%-.100s'"

# ER_WRONG_NAME_FOR_CATALOG 42000
source: "Incorrect catalog name '%-.100s'"
spa: "Nombre de catálogo incorrecto '%-.100s'"

# ER_WARN_QC_RESIZE
source: "Query cache failed to set size %llu; new query cache size is %lu"
spa: "La caché de consulta (query) ha fallado al poner el tamaño %llu; el nuevo tamaño de caché de consulta (query) es %lu"

# ER_BAD_FT_COLUMN
source: "Column '%-.192s' cannot be part of FULLTEXT index"
spa: "La columna '%-.192s' no puede format parte de índice FULLTEXT"

# ER_UNKNOWN_KEY_CACHE
source: "Unknown key cache '%-.100s'"
spa: "Caché de clave desconocida '%-.100s'"

# ER_WARN_HOSTNAME_WONT_WORK
source: "MariaDB is started in --skip-name-resolve mode; you must restart it without this switch for this grant to work"
spa: "MariaDB ha sido arrancada en modo --skip-name-resolve; vd necesita reinicializarla sin esta opción para que esta concesión funcione"

# ER_UNKNOWN_STORAGE_ENGINE 42000
source: "Unknown storage engine '%s'"
spa: "Motor de almacenaje '%s' desconocido"

# ER_WARN_DEPRECATED_SYNTAX
source: "'%s' is deprecated and will be removed in a future release. Please use %s instead"
spa: "'%s' está obsoleto y será quitado en una entrega futura, use '%s' en su lugar"

# ER_NON_UPDATABLE_TABLE
source: "The target table %-.100s of the %s is not updatable"
spa: "La tabla destino %-.100s del %s no es actualizable"

# ER_FEATURE_DISABLED
source: "The '%s' feature is disabled; you need MariaDB built with '%s' to have it working"
spa: "La característica '%s' fue deshabilitada; usted necesita construir MariaDB con '%s' para tener eso funcionando"

# ER_OPTION_PREVENTS_STATEMENT
source: "The MariaDB server is running with the %s option so it cannot execute this statement"
spa: "El servidor MariaDB se está ejecutando con la opción %s por lo que no se puede ejecutar esta sentencia"

# ER_DUPLICATED_VALUE_IN_TYPE
source: "Column '%-.100s' has duplicated value '%-.64s' in %s"
spa: "La columna '%-.100s' tiene valor duplicado '%-.64s' en %s"

# ER_TRUNCATED_WRONG_VALUE 22007
source: "Truncated incorrect %-.32T value: '%-.128T'"
spa: "Truncado incorrecto %-.32T valor: '%-.128T'"

# ER_TOO_MUCH_AUTO_TIMESTAMP_COLS
source: "Incorrect table definition; there can be only one TIMESTAMP column with CURRENT_TIMESTAMP in DEFAULT or ON UPDATE clause"
spa: "Definición incorrecta de tabla; solamente puede haber una columna TIMESTAMP con CURRENT_TIMESTAMP en DEFAULT o en cláusula ON UPDATE"

# ER_INVALID_ON_UPDATE
source: "Invalid ON UPDATE clause for '%-.192s' column"
spa: "Cláusula ON UPDATE inválida para la columna '%-.192s'"
