Repository: vladbogo/test-translation
Catalog: spa.xlf
Languages: spa

# ER_PARTITION_LIST_IN_REFERENCING_WINDOW_SPEC
source: "Window specification referencing another one '%s' cannot contain partition list"
spa: "La especificación de ventana que referencia a otra '%s' no puede contener una lista de partición"

# ER_ORDER_LIST_IN_REFERENCING_WINDOW_SPEC
source: "Referenced window specification '%s' already contains order list"
spa: "La especificación de ventana referenciada '%s' ya contiene lista de orden"

# ER_WINDOW_FRAME_IN_REFERENCED_WINDOW_SPEC
source: "Referenced window specification '%s' cannot contain window frame"
spa: "La especificación referenciada de ventana '%s' no puede contener marco de ventana"

# ER_BAD_COMBINATION_OF_WINDOW_FRAME_BOUND_SPECS
source: "Unacceptable combination of window frame bound specifications"
spa: "Combinación inaceptable de especificaciones ligadas a marco de ventana"

# ER_WRONG_PLACEMENT_OF_WINDOW_FUNCTION
source: "Window function is allowed only in SELECT list and ORDER BY clause"
spa: "La función de ventana sólo se permite en lista SELECT y en cláusula ORDER BY"

# ER_WINDOW_FUNCTION_IN_WINDOW_SPEC
source: "Window function is not allowed in window specification"
spa: "La función de ventana no está permitida en especificación de ventana"

# ER_NOT_ALLOWED_WINDOW_FRAME
source: "Window frame is not allowed with '%s'"
spa: "El marco de ventana no está permitido con '%s'"

# ER_NO_ORDER_LIST_IN_WINDOW_SPEC
source: "No order list in window specification for '%s'"
spa: "No exite lista de orden en especificación de ventana para '%s'"

# ER_RANGE_FRAME_NEEDS_SIMPLE_ORDERBY
source: "RANGE-type frame requires ORDER BY clause with single sort key"
spa: "El marco tipo-RANGE requiere de la cláusula ORDER BY con clave única de clasificación"

# ER_WRONG_TYPE_FOR_ROWS_FRAME
source: "Integer is required for ROWS-type frame"
spa: "Se requiere de un entero para marco tipo-ROWS"

# ER_WRONG_TYPE_FOR_RANGE_FRAME
source: "Numeric datatype is required for RANGE-type frame"
spa: "Se requiere de tipo de dato numérico para marco tipo-RANGE"

# ER_FRAME_EXCLUSION_NOT_SUPPORTED
source: "Frame exclusion is not supported yet"
spa: "No se seporta aún la exclusión del marco"

# ER_WINDOW_FUNCTION_DONT_HAVE_FRAME
source: "This window function may not have a window frame"
spa: "Esta función de ventana puede no tener un marco de ventana"

# ER_INVALID_NTILE_ARGUMENT
source: "Argument of NTILE must be greater than 0"
spa: "El argumento de NTILE debe de ser mayor de 0"

# ER_CONSTRAINT_FAILED 23000
source: "CONSTRAINT %`s failed for %`-.192s.%`-.192s"
spa: "No se cumple la RESTRICCIÓN %`s para %`-.192s.%`-.192s"

# ER_EXPRESSION_IS_TOO_BIG
source: "Expression in the %s clause is too big"
spa: "La expresión en la cláusula %s es demasiado grande"

# ER_ERROR_EVALUATING_EXPRESSION
source: "Got an error evaluating stored expression %s"
spa: "Obtenido error evaluando expresión almacenada %s"

# ER_CALCULATING_DEFAULT_VALUE
source: "Got an error when calculating default value for %`s"
spa: "Obtenido un error al calcular valor por defecto para %`s"

# ER_EXPRESSION_REFERS_TO_UNINIT_FIELD 01000
source: "Expression for field %`-.64s is referring to uninitialized field %`s"
spa: "La expresión para campo %`-.64s se refiere a un campo sin inicializar %`s"

# ER_PARTITION_DEFAULT_ERROR
source: "Only one DEFAULT partition allowed"
spa: "Sólo se permite una partición DEFAULT"

# ER_REFERENCED_TRG_DOES_NOT_EXIST
source: "Referenced trigger '%s' for the given action time and event type does not exist"
spa: "No existe disparador referenciado '%s' para el momento dado de acción y para el tipo de evento"

# ER_INVALID_DEFAULT_PARAM
source: "Default/ignore value is not supported for such parameter usage"
spa: "El valor por defecto/ignorado no está soportado para tal utilización de parámetro"

# ER_BINLOG_NON_SUPPORTED_BULK
source: "Only row based replication supported for bulk operations"
spa: "Sólo la réplica basada en fila es soportada para operaciones enormes"

# ER_BINLOG_UNCOMPRESS_ERROR
source: "Uncompress the compressed binlog failed"
spa: "Ha fallado la descompresión del binlog comprimido"

# ER_JSON_BAD_CHR
source: "Broken JSON string in argument %d to function '%s' at position %d"
spa: "Cadena JSON rota en argumento %d para función '%s' en posición %d"

# ER_JSON_NOT_JSON_CHR
source: "Character disallowed in JSON in argument %d to function '%s' at position %d"
spa: "Carácter no permitido en JSON en argumento %d para función '%s' en la posición %d"

# ER_JSON_EOS
source: "Unexpected end of JSON text in argument %d to function '%s'"
spa: "Fin inesperado de texto JSON en argumento %d a función '%s'"

# ER_JSON_SYNTAX
source: "Syntax error in JSON text in argument %d to function '%s' at position %d"
spa: "Error de sintaxis en texto JSON en argumento %d a función '%s' en la posición %d"

# ER_JSON_ESCAPING
source: "Incorrect escaping in JSON text in argument %d to function '%s' at position %d"
spa: "Incorrecta escapatoria en texto JSON en argumento %d a función '%s' en la posicón %d"

# ER_JSON_DEPTH
source: "Limit of %d on JSON nested strucures depth is reached in argument %d to function '%s' at position %d"
spa: "El límite de %d en profundidad de estructuras JSON anidadas se ha alcanzado en argumento %d a función '%s' en la posición %d"

# ER_JSON_PATH_EOS
source: "Unexpected end of JSON path in argument %d to function '%s'"
spa: "Fin inesperado de ruta JSON en argumento %d a función '%s'"

# ER_JSON_PATH_SYNTAX
source: "Syntax error in JSON path in argument %d to function '%s' at position %d"
spa: "Error de sintaxis en ruta JSON en argumento %d a función '%s' en la posición %d"

# ER_JSON_PATH_DEPTH
source: "Limit of %d on JSON path depth is reached in argument %d to function '%s' at position %d"
spa: "El límite de %d en profundidad de ruta JSON se ha alcanzado en argumento %d a función '%s' en la posición %d"

# ER_JSON_PATH_NO_WILDCARD
source: "Wildcards or range in JSON path not allowed in argument %d to function '%s'"
spa: "Comodines en ruta JSON no permitidos en argumento %d a función '%s'"

# ER_JSON_PATH_ARRAY
source: "JSON path should end with an array identifier in argument %d to function '%s'"
spa: "La ruta JSON debería de terminar con identificador de arreglo en argumento %d a función '%s'"

# ER_JSON_ONE_OR_ALL
source: "Argument 2 to function '%s' must be "one" or "all"."
spa: "El argumento 2 a función '%s' debe de ser "one" o "all"."

# ER_UNSUPPORTED_COMPRESSED_TABLE
source: "InnoDB refuses to write tables with ROW_FORMAT=COMPRESSED or KEY_BLOCK_SIZE."
spa: "InnoDB rechaza grabar en tablas con ROW_FORMAT=COMPRESSED o KEY_BLOCK_SIZE."

# ER_GEOJSON_INCORRECT
source: "Incorrect GeoJSON format specified for st_geomfromgeojson function."
spa: "Especficado formato GeoJSON incorrecto para función st_geomfromgeojson."

# ER_GEOJSON_TOO_FEW_POINTS
source: "Incorrect GeoJSON format - too few points for linestring specified."
spa: "Formato GeoJSON incorrecto - demasiados pocos puntos especificados para linestring."

# ER_GEOJSON_NOT_CLOSED
source: "Incorrect GeoJSON format - polygon not closed."
spa: "Formato GeoJSON incorrect - polígono no cerrado."

# ER_JSON_PATH_EMPTY
source: "Path expression '$' is not allowed in argument %d to function '%s'."
spa: "La expresión de ruta '$' no está permitida en argumento %d a función '%s'."

# ER_SLAVE_SAME_ID
source: "A slave with the same server_uuid/server_id as this slave has connected to the master"
spa: "Un esclavo con el mismo server_uuid/server_id que este esclavo se ha conectado al maestro (master)"

# ER_FLASHBACK_NOT_SUPPORTED
source: "Flashback does not support %s %s"
spa: "Retrospectiva no soporta %s %s"

# ER_KEYS_OUT_OF_ORDER
source: "Keys are out order during bulk load"
spa: "Claves desordenadas durante carga enorme"

# ER_OVERLAPPING_KEYS
source: "Bulk load rows overlap existing rows"
spa: "La carga enorme de filas se superpone con filas existentes"

# ER_REQUIRE_ROW_BINLOG_FORMAT
source: "Can't execute updates on master with binlog_format != ROW."
spa: "No puedo ejecutar actualizaciones en maestro (master) con binlog_format != ROW."

# ER_ISOLATION_MODE_NOT_SUPPORTED
source: "MyRocks supports only READ COMMITTED and REPEATABLE READ isolation levels. Please change from current isolation level %s"
spa: "MyRocks soporta sólo niveles de aislamiento READ COMMITTED y REPEATABLE READ. Por favor, cambie desde nivel de aislamiento actual %s"

# ER_ON_DUPLICATE_DISABLED
source: "When unique checking is disabled in MyRocks, INSERT,UPDATE,LOAD statements with clauses that update or replace the key (i.e. INSERT ON DUPLICATE KEY UPDATE, REPLACE) are not allowed. Query: %s"
spa: "Al desactivar chequeo de único en MyRocks, las sentencias INSERT, UPDATE, LOAD con cláusulas que actualizan o reemplazan la clave (p.ej. INSERT ON DUPLICATE KEY UPDATE, REPLACE) no se permiten. Consulte (query): %s"

# ER_UPDATES_WITH_CONSISTENT_SNAPSHOT
source: "Can't execute updates when you started a transaction with START TRANSACTION WITH CONSISTENT [ROCKSDB] SNAPSHOT."
spa: "No puedo ejecutar actualizaciones cuando has iniciado una transacción mediante START TRANSACTION WITH CONSISTENT [ROCKSDB] SNAPSHOT."

# ER_ROLLBACK_ONLY
source: "This transaction was rolled back and cannot be committed. Only supported operation is to roll it back, so all pending changes will be discarded. Please restart another transaction."
spa: "Esta transacción se ha retrocedido (rolled back) y no puede ser acometida (commit). La única operación soportada es retroceder (roll back), de tal forma que se descartarán todos los cambios pendientes. Por favor, rearranque otra transacción."

# ER_ROLLBACK_TO_SAVEPOINT
source: "MyRocks currently does not support ROLLBACK TO SAVEPOINT if modifying rows."
spa: "MyRocks en este momento no soporta ROLLBACK TO SAVEPOINT si se están modificando filas."

# ER_ISOLATION_LEVEL_WITH_CONSISTENT_SNAPSHOT
source: "Only REPEATABLE READ isolation level is supported for START TRANSACTION WITH CONSISTENT SNAPSHOT in RocksDB Storage Engine."
spa: "Sólo el nivel de aislamiento REPEATABLE READ se soporta para START TRANSACTION WITH CONSISTENT SNAPSHOT en Motor de Almacenaje RocksDB."

# ER_UNSUPPORTED_COLLATION
source: "Unsupported collation on string indexed column %s.%s Use binary collation (%s)."
spa: "Cotejo (collation) no soportado en columna indizada de cadena %s.%s Use cotejo binario (%s)."

# ER_METADATA_INCONSISTENCY
source: "Table '%s' does not exist, but metadata information exists inside MyRocks. This is a sign of data inconsistency. Please check if '%s.frm' exists, and try to restore it if it does not exist."
spa: "La tabla '%s' no existe, pero existe información de metadatos dentro de MyRocks. Esto es una señal de datos inconsistentes. Por favor, revise si existe '%s.frm' e intente restaurarla si no existe."

# ER_CF_DIFFERENT
source: "Column family ('%s') flag (%d) is different from an existing flag (%d). Assign a new CF flag, or do not change existing CF flag."
spa: "La familia de columna ('%s') bandera (%d) es diferente de una bandera existente (%d). Asigne una nueva bandera CF o no cambie la bandera CF."

# ER_RDB_TTL_DURATION_FORMAT
source: "TTL duration (%s) in MyRocks must be an unsigned non-null 64-bit integer."
spa: "La duración de TTL (%s) en MyRocks debe de ser un entero sin signo no-null de 64-bit."

# ER_RDB_STATUS_GENERAL
source: "Status error %d received from RocksDB: %s"
spa: "Recibido error de estado %d desde RocksDB: %s"

# ER_RDB_STATUS_MSG
source: "%s, Status error %d received from RocksDB: %s"
spa: "%s, Recibido error de estado %d desde RocksDB: %s"

# ER_RDB_TTL_UNSUPPORTED
source: "TTL support is currently disabled when table has a hidden PK."
spa: "El soporte TTL está desactivado en este momento cuando la tabla tiene una PK oculta."

# ER_RDB_TTL_COL_FORMAT
source: "TTL column (%s) in MyRocks must be an unsigned non-null 64-bit integer, exist inside the table, and have an accompanying ttl duration."
spa: "La columna TTL (%s) en MyRocks debe de ser un entero sin signo no-null de 64-bit, debe de existir dentro de la tabla y debe de tener una duración ttl acompañante."

# ER_PER_INDEX_CF_DEPRECATED
source: "The per-index column family option has been deprecated"
spa: "La opcion de familia de columna por-índice está obsoleta"

# ER_KEY_CREATE_DURING_ALTER
source: "MyRocks failed creating new key definitions during alter."
spa: "MyRocks no pudo crear nuevas definiciones de clave durante 'alter'."

# ER_SK_POPULATE_DURING_ALTER
source: "MyRocks failed populating secondary key during alter."
spa: "MyRocks falló al poblar clave secundaria duante el 'alter'."

# ER_SUM_FUNC_WITH_WINDOW_FUNC_AS_ARG
source: "Window functions can not be used as arguments to group functions."
spa: "Las funciones de ventana no se pueden usar como argumentos para agrupar funciones."

# ER_NET_OK_PACKET_TOO_LARGE
source: "OK packet too large"
spa: "Paquete OK demasiado grande"

# ER_GEOJSON_EMPTY_COORDINATES
source: "Incorrect GeoJSON format - empty 'coordinates' array."
spa: "Formato GeoJSON incorrecto - arreglo vacío de coordenadas."

# ER_MYROCKS_CANT_NOPAD_COLLATION
source: "MyRocks doesn't currently support collations with \"No pad\" attribute."
spa: "MyRocks no soporta en la actualidad cotejos con atributo \"No pad\"."

# ER_ILLEGAL_PARAMETER_DATA_TYPES2_FOR_OPERATION
source: "Illegal parameter data types %s and %s for operation '%s'"
spa: "Tipos de datos de parámetro ilegales %s y %s para operación '%s'"

# ER_ILLEGAL_PARAMETER_DATA_TYPE_FOR_OPERATION
source: "Illegal parameter data type %s for operation '%s'"
spa: "Tipo de dato %s de parámetro ilegal para operación '%s'"

# ER_WRONG_PARAMCOUNT_TO_CURSOR 42000
source: "Incorrect parameter count to cursor '%-.192s'"
spa: "Contador incorrecto de parámetro para cursor '%-.192s'"

# ER_UNKNOWN_STRUCTURED_VARIABLE
source: "Unknown structured system variable or ROW routine variable '%-.*s'"
spa: "Variable de sistema con estructura desconocida o variable de rutina ROW '%-.*s'"

# ER_ROW_VARIABLE_DOES_NOT_HAVE_FIELD
source: "Row variable '%-.192s' does not have a field '%-.192s'"
spa: "La variable de fila '%-.192s' no tiene un campo '%-.192s'"

# ER_END_IDENTIFIER_DOES_NOT_MATCH
source: "END identifier '%-.192s' does not match '%-.192s'"
spa: "Identificador END '%-.192s' no coincide con '%-.192s'"

# ER_SEQUENCE_RUN_OUT
source: "Sequence '%-.64s.%-.64s' has run out"
spa: "La secuencia '%-.64s.%-.64s' se ha agotado"

# ER_SEQUENCE_INVALID_DATA
source: "Sequence '%-.64s.%-.64s' has out of range value for options"
spa: "La secuencia '%-.64s.%-.64s' tiene un valor fuera de rango para las opciones"

# ER_SEQUENCE_INVALID_TABLE_STRUCTURE
source: "Sequence '%-.64s.%-.64s' table structure is invalid (%s)"
spa: "La estuctura de tabla de secuencia '%-.64s.%-.64s' es inválida (%s)"

# ER_SEQUENCE_ACCESS_ERROR
source: "Sequence '%-.64s.%-.64s' access error"
spa: "Error en acceso a secuencia '%-.64s.%-.64s'"

# ER_SEQUENCE_BINLOG_FORMAT
source: "Sequences requires binlog_format mixed or row"
spa: "Las secuencias requieren binlog_format mixto o fila"

# ER_NOT_SEQUENCE 42S02
source: "'%-.64s.%-.64s' is not a SEQUENCE"
spa: "'%-.64s.%-.64s' no es una SECUENCIA"

# ER_NOT_SEQUENCE2 42S02
source: "'%-.192s' is not a SEQUENCE"
spa: "'%-.192s' no es una SECUENCIA"

# ER_UNKNOWN_SEQUENCES 42S02
source: "Unknown SEQUENCE: '%-.300s'"
spa: "SECUENCIA desconocida: '%-.300s'"

# ER_UNKNOWN_VIEW 42S02
source: "Unknown VIEW: '%-.300s'"
spa: "VISTA desconocida: '%-.300s'"

# ER_WRONG_INSERT_INTO_SEQUENCE
source: "Wrong INSERT into a SEQUENCE. One can only do single table INSERT into a sequence object (like with mariadb-dump). If you want to change the SEQUENCE, use ALTER SEQUENCE instead."
spa: "INSERT equivocado dentro de SEQUENCE. Uno sólo puede hacer INSERT único en tabla dentro de un objeto de secuencia (como con volcado-mariadb). Si desea cambiar la SECUENCIA, use ALTER SEQUENCE en su lugar."

# ER_SP_STACK_TRACE
source: "At line %u in %s"
spa: "En la línea %u en %s"

# ER_PACKAGE_ROUTINE_IN_SPEC_NOT_DEFINED_IN_BODY
source: "Subroutine '%-.192s' is declared in the package specification but is not defined in the package body"
spa: "La subrutina '%-.192s' está declarada en la especificación del paquete pero no está definida en el cuerpo del paquete"

# ER_PACKAGE_ROUTINE_FORWARD_DECLARATION_NOT_DEFINED
source: "Subroutine '%-.192s' has a forward declaration but is not defined"
spa: "La subrutina '%-.192s' tiene una declaración adelantada pero no está definida"

# ER_COMPRESSED_COLUMN_USED_AS_KEY
source: "Compressed column '%-.192s' can't be used in key specification"
spa: "Una columna comprimida '%-.192s' no se puede usar en especificación de clave"

# ER_UNKNOWN_COMPRESSION_METHOD
source: "Unknown compression method: %s"
spa: "Método de compresión desconocido: %s"

# ER_WRONG_NUMBER_OF_VALUES_IN_TVC
source: "The used table value constructor has a different number of values"
spa: "El constructor del valor de tabla usado tiene un número diferente de valores"

# ER_FIELD_REFERENCE_IN_TVC
source: "Field reference '%-.192s' can't be used in table value constructor"
spa: "La referencia a campo '%-.192s' no se puede usar en constructor de valor de tabla"

# ER_WRONG_TYPE_FOR_PERCENTILE_FUNC
source: "Numeric datatype is required for %s function"
spa: "Se requiere de tipo de dato numérico para función %s"

# ER_ARGUMENT_NOT_CONSTANT
source: "Argument to the %s function is not a constant for a partition"
spa: "El argumento de la función %s no es una constante para una partición"

# ER_ARGUMENT_OUT_OF_RANGE
source: "Argument to the %s function does not belong to the range [0,1]"
spa: "El argumento de la función %s no pertenece al rango [0,1]"

# ER_WRONG_TYPE_OF_ARGUMENT
source: "%s function only accepts arguments that can be converted to numerical types"
spa: "La función %s sólo acepta argumentos que se puedan convertir a tipos numéricos"

# ER_NOT_AGGREGATE_FUNCTION
source: "Aggregate specific instruction (FETCH GROUP NEXT ROW) used in a wrong context"
spa: "Instrucción específica de agregación (FETCH GROUP NEXT ROW) usada en contexto equivocado"

# ER_INVALID_AGGREGATE_FUNCTION
source: "Aggregate specific instruction(FETCH GROUP NEXT ROW) missing from the aggregate function"
spa: "Falta instrucción específica de agregación (FETCH GROUP NEXT ROW) de la función de agregación"

# ER_INVALID_VALUE_TO_LIMIT
source: "Limit only accepts integer values"
spa: "El límite sólo acepta valores enteros"

# ER_INVISIBLE_NOT_NULL_WITHOUT_DEFAULT
source: "Invisible column %`s must have a default value"
spa: "Una columna invisible %`s debe de tener valor por defecto"

# ER_UPDATE_INFO_WITH_SYSTEM_VERSIONING
source: "Rows matched: %ld Changed: %ld Inserted: %ld Warnings: %ld"
spa: "Filas coincidentes: %ld Cambiadas: %ld Insertadas: %ld Avisos: %ld"

# ER_VERS_FIELD_WRONG_TYPE
source: "%`s must be of type %s for system-versioned table %`s"
spa: "%`s debe de ser del tipo %s para tabla versionada del sistema %`s"

# ER_VERS_ENGINE_UNSUPPORTED
source: "Transaction-precise system versioning for %`s is not supported"
spa: "No se soporta versionado de sistema de transacción precisa para %`s"

# ER_UNUSED_23
source: "You should never see it"
spa: "Nunca debería vd de ver esto"

# ER_PARTITION_WRONG_TYPE
source: "Wrong partitioning type, expected type: %`s"
spa: "Tipo de partición equivocada, tipo esperado: %`s"

# WARN_VERS_PART_FULL
source: "Versioned table %`s.%`s: last HISTORY partition (%`s) is out of %s, need more HISTORY partitions"
spa: "Tabla versionada %`s.%`s: última partición HISTORY (%`s) fuera de %s, necesita de más particiones HISTORY"

# WARN_VERS_PARAMETERS
source: "Maybe missing parameters: %s"
spa: "Parámetros que quizás faltan: %s"

# ER_VERS_DROP_PARTITION_INTERVAL
source: "Can only drop oldest partitions when rotating by INTERVAL"
spa: "Sólo se pueden eliminar viejas particiones al rotar mediante INTERVAL"

# ER_UNUSED_25
source: "You should never see it"
spa: "Nunca debería vd de ver esto"

# WARN_VERS_PART_NON_HISTORICAL
source: "Partition %`s contains non-historical data"
spa: "La partición %`s contiene datos no históricos"

# ER_VERS_ALTER_NOT_ALLOWED
source: "Not allowed for system-versioned %`s.%`s. Change @@system_versioning_alter_history to proceed with ALTER."
spa: "No permitido para versionado del sistema %`s.%`s. Cambie @@system_versioning_alter_history para proceder con ALTER."

# ER_VERS_ALTER_ENGINE_PROHIBITED
source: "Not allowed for system-versioned %`s.%`s. Change to/from native system versioning engine is not supported."
spa: "No permitido para versionado del sistema %`s.%`s. Cambio a/desde motor de versionado nativo no soportado."

# ER_VERS_RANGE_PROHIBITED
source: "SYSTEM_TIME range selector is not allowed"
spa: "Selector de rango SYSTEM_TIME no permitido"

# ER_CONFLICTING_FOR_SYSTEM_TIME
source: "Conflicting FOR SYSTEM_TIME clauses in WITH RECURSIVE"
spa: "Cláusulas conflictivas FOR SYSTEM_TIME en WITH RECURSIVE"

# ER_VERS_TABLE_MUST_HAVE_COLUMNS
source: "Table %`s must have at least one versioned column"
spa: "La tabla %`s debe de tener al menos una columna versionada"

# ER_VERS_NOT_VERSIONED
source: "Table %`s is not system-versioned"
spa: "La tabla %`s no es versionada del sistema"

# ER_MISSING
source: "Wrong parameters for %`s: missing '%s'"
spa: "Parámetros equivocados para %`s: falta '%s'"

# ER_VERS_PERIOD_COLUMNS
source: "PERIOD FOR SYSTEM_TIME must use columns %`s and %`s"
spa: "PERIOD FOR SYSTEM_TIME debe de usar columnas %`s y %`s"

# ER_PART_WRONG_VALUE
source: "Wrong parameters for partitioned %`s: wrong value for '%s'"
spa: "Parámetros equivocados para particionado %`s: valor equivocado para '%s'"

# ER_VERS_WRONG_PARTS
source: "Wrong partitions for %`s: must have at least one HISTORY and exactly one last CURRENT"
spa: "Particiones equivocadas para %`s: debe de tener al menos una HISTORY y exactamente un último CURRENT"

# ER_VERS_NO_TRX_ID
source: "TRX_ID %llu not found in `mysql.transaction_registry`"
spa: "TRX_ID %llu no hallado en `mysql.transaction_registry`"

# ER_VERS_ALTER_SYSTEM_FIELD
source: "Can not change system versioning field %`s"
spa: "No puedo cambiar campo de versionado de sistema %`s"

# ER_DROP_VERSIONING_SYSTEM_TIME_PARTITION
source: "Can not DROP SYSTEM VERSIONING for table %`s partitioned BY SYSTEM_TIME"
spa: "No puedo DROP SYSTEM VERSIONING para la tabla %`s particionada BY SYSTEM_TIME"

# ER_VERS_DB_NOT_SUPPORTED
source: "System-versioned tables in the %`s database are not supported"
spa: "No se soportan las tablas versionadas del sistema en la base de datos %`s"

# ER_VERS_TRT_IS_DISABLED
source: "Transaction registry is disabled"
spa: "El registro de transaciones está desactivado"

# ER_VERS_DUPLICATE_ROW_START_END
source: "Duplicate ROW %s column %`s"
spa: "Duplicada FILA %s columna %`s"

# ER_VERS_ALREADY_VERSIONED
source: "Table %`s is already system-versioned"
spa: "La tabla %`s ya es versionada del sistema"

# ER_UNUSED_24
source: "You should never see it"
spa: "Nunca debería vd de ver esto"

# ER_VERS_NOT_SUPPORTED
source: "System-versioned tables do not support %s"
spa: "Las tablas versionadas del sistema no soportan %s"

# ER_VERS_TRX_PART_HISTORIC_ROW_NOT_SUPPORTED
source: "Transaction-precise system-versioned tables do not support partitioning by ROW START or ROW END"
spa: "Las tablas versionadas del sistemas de transacción precisa no soportan particionado mediante ROW START o ROW END"

# ER_INDEX_FILE_FULL
source: "The index file for table '%-.192s' is full"
spa: "El fichero/archivo índice para la tabla '%-.192s' está lleno"

# ER_UPDATED_COLUMN_ONLY_ONCE
source: "The column %`s.%`s cannot be changed more than once in a single UPDATE statement"
spa: "La columna %`s.%`s no se pude cambiar más de ua vez en una sentencia UPDATE única"
