Repository: vladbogo/test-translation
Catalog: spa.xlf
Languages: spa

# ER_ONLY_INTEGERS_ALLOWED
source: "Only integers allowed as number here"
spa: "Sólo se permiten enteros como número aquí"

# ER_UNSUPORTED_LOG_ENGINE
source: "Storage engine %s cannot be used for log tables"
spa: "No se puede usar el motor de almacenaje %s para tablas de historial (log)"

# ER_BAD_LOG_STATEMENT
source: "You cannot '%s' a log table if logging is enabled"
spa: "No puede '%s' una tabla de historial (log) cuando se encuentra activado el llevar historial (log)"

# ER_CANT_RENAME_LOG_TABLE
source: "Cannot rename '%s'. When logging enabled, rename to/from log table must rename two tables: the log table to an archive table and another table back to '%s'"
spa: "No puedo renombrar '%s'. Si se encuentra activo el llevar historial (log), el renombrar a/desde tabla de historial (log) debe de renombrar dos tablas: la tabla de historial (log) a una tabla archivo y otra tabla de vuelta a '%s'"

# ER_WRONG_PARAMCOUNT_TO_NATIVE_FCT 42000
source: "Incorrect parameter count in the call to native function '%-.192s'"
spa: "Contador de parámetro incorrecto en la llamada a función nativa '%-.192s'"

# ER_WRONG_PARAMETERS_TO_NATIVE_FCT 42000
source: "Incorrect parameters in the call to native function '%-.192s'"
spa: "Parámetros incorrectos en la llamada a función nativa '%-.192s'"

# ER_WRONG_PARAMETERS_TO_STORED_FCT 42000
source: "Incorrect parameters in the call to stored function '%-.192s'"
spa: "Parámetros incorrectos en la llamada a función almacenada '%-.192s'"

# ER_NATIVE_FCT_NAME_COLLISION
source: "This function '%-.192s' has the same name as a native function"
spa: "Esta función '%-.192s' tiene el mismo nombre que una función nativa"

# ER_DUP_ENTRY_WITH_KEY_NAME 23000 S1009
source: "Duplicate entry '%-.64T' for key '%-.192s'"
spa: "Entrada duplicada '%-.64T' para la clave '%-.192s'"

# ER_BINLOG_PURGE_EMFILE
source: "Too many files opened, please execute the command again"
spa: "Demasiados ficheros/archivos abiertos. Por favor, ejecute el comando otra vez"

# ER_EVENT_CANNOT_CREATE_IN_THE_PAST
source: "Event execution time is in the past and ON COMPLETION NOT PRESERVE is set. The event was dropped immediately after creation"
spa: "El tiempo de jecución del evento se encuentra en el pasado y está configurado ON COMPLETION NOT PRESERVE. El evento fue eliminado inmediatamente tras su creación"

# ER_EVENT_CANNOT_ALTER_IN_THE_PAST
source: "Event execution time is in the past and ON COMPLETION NOT PRESERVE is set. The event was not changed. Specify a time in the future"
spa: "El tiempo de jecución del evento se encuentra en el pasado y está configurado ON COMPLETION NOT PRESERVE. El evento no fue cambiado. Especifique un tiempo del futuro"

# ER_SLAVE_INCIDENT
source: "The incident %s occurred on the master. Message: %-.64s"
spa: "Ha ocurrido un incidente %s en el maestro (master). Mensaje: %-.64s"

# ER_NO_PARTITION_FOR_GIVEN_VALUE_SILENT
source: "Table has no partition for some existing values"
spa: "La tabla no tiene partición para algunos valores existentes"

# ER_BINLOG_UNSAFE_STATEMENT
source: "Unsafe statement written to the binary log using statement format since BINLOG_FORMAT = STATEMENT. %s"
spa: "Se ha grabado una sentencia no segura en historial (log) binario usando el formato de sentencia desde BINLOG_FORMAT = STATEMENT. %s"

# ER_SLAVE_FATAL_ERROR
source: "Fatal error: %s"
spa: "Error fatal: %s"

# ER_SLAVE_RELAY_LOG_READ_FAILURE
source: "Relay log read failure: %s"
spa: "Fallo de lectura en historial (log) de reenvío: %s"

# ER_SLAVE_RELAY_LOG_WRITE_FAILURE
source: "Relay log write failure: %s"
spa: "Fallo de grabación en historial (log) de reenvío: %s"

# ER_SLAVE_CREATE_EVENT_FAILURE
source: "Failed to create %s"
spa: "Fallo al crear %s"

# ER_SLAVE_MASTER_COM_FAILURE
source: "Master command %s failed: %s"
spa: "El comando maestro (master) %s ha fallado: %s"

# ER_BINLOG_LOGGING_IMPOSSIBLE
source: "Binary logging not possible. Message: %s"
spa: "No es posible llevar historial (log) binario. Mensaje: %s"

# ER_VIEW_NO_CREATION_CTX
source: "View %`s.%`s has no creation context"
spa: "La vista %`s.%`s no tiene contexto de creación"

# ER_VIEW_INVALID_CREATION_CTX
source: "Creation context of view %`s.%`s is invalid"
spa: "El contexto de creación de la vista %`s.%`s es inválido"

# ER_SR_INVALID_CREATION_CTX
source: "Creation context of stored routine %`s.%`s is invalid"
spa: "El contexto de creación de la rutina almacenada %`s.%`s es inválido"

# ER_TRG_CORRUPTED_FILE
source: "Corrupted TRG file for table %`s.%`s"
spa: "Fichero/archivo TRG estropeado para la tabla %`s.%`s`"

# ER_TRG_NO_CREATION_CTX
source: "Triggers for table %`s.%`s have no creation context"
spa: "Los disparadores para la tabla %`s.%`s no tienen contexto de creación"

# ER_TRG_INVALID_CREATION_CTX
source: "Trigger creation context of table %`s.%`s is invalid"
spa: "El contexto de creación del disparador de la tabla %`s.%`s es inválido"

# ER_EVENT_INVALID_CREATION_CTX
source: "Creation context of event %`s.%`s is invalid"
spa: "El contexto de creación del evento %`s.%`s es inválido"

# ER_TRG_CANT_OPEN_TABLE
source: "Cannot open table for trigger %`s.%`s"
spa: "No puedo abrir tabla para disparador %`s.%`s"

# ER_CANT_CREATE_SROUTINE
source: "Cannot create stored routine %`s. Check warnings"
spa: "No puedo crear rutina alnacenada %`s. Revise los avisos"

# ER_UNUSED_11
source: "You should never see it"
spa: "Nunca debería vd de ver esto"

# ER_NO_FORMAT_DESCRIPTION_EVENT_BEFORE_BINLOG_STATEMENT
source: "The BINLOG statement of type %s was not preceded by a format description BINLOG statement"
spa: "La sentencia BINLOG del tipo `%s` no ha sido precedida por una sentencia de descripción de formato BINLOG"

# ER_SLAVE_CORRUPT_EVENT
source: "Corrupted replication event was detected"
spa: "Se ha detectado un evento de réplica estropeado"

# ER_LOAD_DATA_INVALID_COLUMN
source: "Invalid column reference (%-.64s) in LOAD DATA"
spa: "Referencia inválida a columna (%-.64s) en LOAD DATA"

# ER_LOG_PURGE_NO_FILE
source: "Being purged log %s was not found"
spa: "No ha sido hallado historial (log) %s siendo purgado"

# ER_XA_RBTIMEOUT XA106
source: "XA_RBTIMEOUT: Transaction branch was rolled back: took too long"
spa: "XA_RBTIMEOUT: Rama de transacción ha sido retrocedida (rolled back): transcurrido demasiado tiempo"

# ER_XA_RBDEADLOCK XA102
source: "XA_RBDEADLOCK: Transaction branch was rolled back: deadlock was detected"
spa: "XA_RBDEADLOCK: Rama de transacción ha dido retrocedida (rolled back): se ha detectado estancamiento (deadlock)"

# ER_NEED_REPREPARE
source: "Prepared statement needs to be re-prepared"
spa: "Sentencia preparada necesita volver a ser preparada"

# ER_DELAYED_NOT_SUPPORTED
source: "DELAYED option not supported for table '%-.192s'"
spa: "Opción DELAYED no soportada para la tabla '%-.192s'"

# WARN_NO_MASTER_INFO
source: "There is no master connection '%.*s'"
spa: "No existe conexión maestra '%.*s'"

# WARN_OPTION_IGNORED
source: "<%-.64s> option ignored"
spa: "Opción <%-.64s> ignorada"

# ER_PLUGIN_DELETE_BUILTIN
source: "Built-in plugins cannot be deleted"
spa: "No se pueden borrar los enchufes (plugins) internos"

# WARN_PLUGIN_BUSY
source: "Plugin is busy and will be uninstalled on shutdown"
spa: "El enchufe (plugin) está ocupado y será desinstalado cuando se apague"

# ER_VARIABLE_IS_READONLY
source: "%s variable '%s' is read-only. Use SET %s to assign the value"
spa: "%s variable '%s' es de sólo lectura. Use SET %s para asignar el valor"

# ER_WARN_ENGINE_TRANSACTION_ROLLBACK
source: "Storage engine %s does not support rollback for this statement. Transaction rolled back and must be restarted"
spa: "El motor de almacenaje %s no soporta retroceso (rollback) para esta sentencia. Transacción retrocedida (rolled back) y debe de ser rearrancada"

# ER_SLAVE_HEARTBEAT_FAILURE
source: "Unexpected master's heartbeat data: %s"
spa: "Datos inesperados de latido (heartbeat) de maestro (master): %s"

# ER_SLAVE_HEARTBEAT_VALUE_OUT_OF_RANGE
source: "The requested value for the heartbeat period is either negative or exceeds the maximum allowed (%u seconds)"
spa: "El valor requerido para el período de latido o es negativo o excede al máximo permitido (%u segundos)"

# ER_UNUSED_14
source: "You should never see it"
spa: "Nunca debería vd de ver esto"

# ER_CONFLICT_FN_PARSE_ERROR
source: "Error in parsing conflict function. Message: %-.64s"
spa: "Error al analizar función de conflicto. Mensaje: %-.64s"

# ER_EXCEPTIONS_WRITE_ERROR
source: "Write to exceptions table failed. Message: %-.128s""
spa: "Ha fallado el grabar en tabla de excepciones. Mensaje: %-.128s""

# ER_TOO_LONG_TABLE_COMMENT
source: "Comment for table '%-.64s' is too long (max = %u)"
spa: "El comentario para tabla '%-.64s' es demasiado largo (máx = %u)"

# ER_TOO_LONG_FIELD_COMMENT
source: "Comment for field '%-.64s' is too long (max = %u)"
spa: "El comentario para el campo '%-.64s' es demasiado largo (máx = %u)"

# ER_FUNC_INEXISTENT_NAME_COLLISION 42000
source: "FUNCTION %s does not exist. Check the 'Function Name Parsing and Resolution' section in the Reference Manual"
spa: "La FUNCTION %s no existe. Revise la sección de 'Function Name Parsing and Resolution' en el Manual de Referencia"

# ER_DATABASE_NAME
source: "Database"
spa: "Base de datos"

# ER_TABLE_NAME
source: "Table"
spa: "Tabla"

# ER_PARTITION_NAME
source: "Partition"
spa: "Partición"

# ER_SUBPARTITION_NAME
source: "Subpartition"
spa: "Subpartición"

# ER_TEMPORARY_NAME
source: "Temporary"
spa: "Temporaria"

# ER_RENAMED_NAME
source: "Renamed"
spa: "Renombrado"

# ER_TOO_MANY_CONCURRENT_TRXS
source: "Too many active concurrent transactions"
spa: "Demasiadas transacciones concurrentes activas"

# WARN_NON_ASCII_SEPARATOR_NOT_IMPLEMENTED
source: "Non-ASCII separator arguments are not fully supported"
spa: "Los argumentos con separador No ASCII no están completamente soportados"

# ER_DEBUG_SYNC_TIMEOUT
source: "debug sync point wait timed out"
spa: "agotado tiempo de espera de punto de sincronización de depuración"

# ER_DEBUG_SYNC_HIT_LIMIT
source: "debug sync point hit limit reached"
spa: "alcanzado límite de punto de sincronización de depuración"

# ER_DUP_SIGNAL_SET 42000
source: "Duplicate condition information item '%s'"
spa: "Duplicado elemento de información de condición '%s'"

# ER_SIGNAL_WARN 01000
source: "Unhandled user-defined warning condition"
spa: "Condición de aviso definida por usuario sin manejar"

# ER_SIGNAL_NOT_FOUND 02000
source: "Unhandled user-defined not found condition"
spa: "Condición de no hallado definida por usuario sin manejar"

# ER_SIGNAL_EXCEPTION HY000
source: "Unhandled user-defined exception condition"
spa: "Condición de excepción definida por usuario sin manejar"

# ER_RESIGNAL_WITHOUT_ACTIVE_HANDLER 0K000
source: "RESIGNAL when handler not active"
spa: "RESIGNAL cuando el manejador no activo"

# ER_SIGNAL_BAD_CONDITION_TYPE
source: "SIGNAL/RESIGNAL can only use a CONDITION defined with SQLSTATE"
spa: "SIGNAL/RESIGNAL sólo pueden usar una CONDITION definida mediante SQLSTATE"

# WARN_COND_ITEM_TRUNCATED
source: "Data truncated for condition item '%s'"
spa: "Datos truncados para elemento de condición '%s'"

# ER_COND_ITEM_TOO_LONG
source: "Data too long for condition item '%s'"
spa: "Datos demasiados largos para elemento de condición '%s'"

# ER_UNKNOWN_LOCALE
source: "Unknown locale: '%-.64s'"
spa: "Localización (locale) desconocida: '%-.64s'"

# ER_SLAVE_IGNORE_SERVER_IDS
source: "The requested server id %d clashes with the slave startup option --replicate-same-server-id"
spa: "La id %d del servidor requerido choca con la opción de arranque del esclavo --replicate-same-server-id"

# ER_QUERY_CACHE_DISABLED
source: "Query cache is disabled; set query_cache_type to ON or DEMAND to enable it"
spa: "Caché de consulta (query) desactivada; configura query_cache_type a ON o DEMAND para activarla"

# ER_SAME_NAME_PARTITION_FIELD
source: "Duplicate partition field name '%-.192s'"
spa: "Nombre de campo de partición duplicado '%-.192s'"

# ER_PARTITION_COLUMN_LIST_ERROR
source: "Inconsistency in usage of column lists for partitioning"
spa: "Inconsistencia en uso de listas de columna para particionar"

# ER_WRONG_TYPE_COLUMN_VALUE_ERROR
source: "Partition column values of incorrect type"
spa: "Valores de columna de partición de tipo incorrecto"

# ER_TOO_MANY_PARTITION_FUNC_FIELDS_ERROR
source: "Too many fields in '%-.192s'"
spa: "Demasiados campos en '%-.192s'"

# ER_MAXVALUE_IN_VALUES_IN
source: "Cannot use MAXVALUE as value in VALUES IN"
spa: "No puedo usar MAXVALUE como valor en VALUES IN"

# ER_TOO_MANY_VALUES_ERROR
source: "Cannot have more than one value for this type of %-.64s partitioning"
spa: "No puedo tener más de un valor para este tipo de particionamiento %-.64s"

# ER_ROW_SINGLE_PARTITION_FIELD_ERROR
source: "Row expressions in VALUES IN only allowed for multi-field column partitioning"
spa: "Expresiones de fila en VALUES IN sólo permitidas para particionamiento de columna multi-campo"

# ER_FIELD_TYPE_NOT_ALLOWED_AS_PARTITION_FIELD
source: "Field '%-.192s' is of a not allowed type for this type of partitioning"
spa: "El campo '%-.192s' es de un tipo no permitido para este tipo de particionado"

# ER_PARTITION_FIELDS_TOO_LONG
source: "The total length of the partitioning fields is too large"
spa: "El tamaño total de los campos de particionado es demasiado grande"

# ER_BINLOG_ROW_ENGINE_AND_STMT_ENGINE
source: "Cannot execute statement: impossible to write to binary log since both row-incapable engines and statement-incapable engines are involved"
spa: "No puedo ejecutar sentencia: imposible grabar historial (log) binario ya que ambos motores de fila-incapaz y de sentencia-incapaz están involucrados"

# ER_BINLOG_ROW_MODE_AND_STMT_ENGINE
source: "Cannot execute statement: impossible to write to binary log since BINLOG_FORMAT = ROW and at least one table uses a storage engine limited to statement-based logging"
spa: "No puedo ejecutar sentencia: imposible grabar historial (log) binario ya que BINLOG_FORMAT = ROW y al menos una tabla utiliza motor de almacenaje limitado a historiales basados en sentencia"

# ER_BINLOG_UNSAFE_AND_STMT_ENGINE
source: "Cannot execute statement: impossible to write to binary log since statement is unsafe, storage engine is limited to statement-based logging, and BINLOG_FORMAT = MIXED. %s"
spa: "No puedo ejecutar sentencia: imposible grabar historial (log) binario ya que la sentencia no es segura, el motor de almacenaje está limitado a historial basado en sentencia y BINLOG_FORMAT = MIXED. %s"

# ER_BINLOG_ROW_INJECTION_AND_STMT_ENGINE
source: "Cannot execute statement: impossible to write to binary log since statement is in row format and at least one table uses a storage engine limited to statement-based logging"
spa: "No puedo ejecutar sentencia: imposible grabar historial (log) binario ya que la sentencia está en un formato de fila y al menos una tabla utiliza un motor de almacenaje limitado a historial basado en sentencia"

# ER_BINLOG_STMT_MODE_AND_ROW_ENGINE
source: "Cannot execute statement: impossible to write to binary log since BINLOG_FORMAT = STATEMENT and at least one table uses a storage engine limited to row-based logging.%s"
spa: "No puedo ejecutar sentencia: imposible grabar historial (log) binario ya que BINLOG_FORMAT = STATEMENT y al menos una tabla utilizan un motor de almacenaje limitado a historial basado en fila. %s"

# ER_BINLOG_ROW_INJECTION_AND_STMT_MODE
source: "Cannot execute statement: impossible to write to binary log since statement is in row format and BINLOG_FORMAT = STATEMENT"
spa: "No puedo ejecutar sentencia: imposible grabar historial (log) binario ya que la sentencia está en formato de fila y BINLOG_FORMAT = STATEMENT"

# ER_BINLOG_MULTIPLE_ENGINES_AND_SELF_LOGGING_ENGINE
source: "Cannot execute statement: impossible to write to binary log since more than one engine is involved and at least one engine is self-logging"
spa: "No puedo ejecutar sentencia: imposible grabar historial (log) binario ya que hay más de un motor involucrado y al menos un motor usa auto-historial"

# ER_BINLOG_UNSAFE_LIMIT
source: "The statement is unsafe because it uses a LIMIT clause. This is unsafe because the set of rows included cannot be predicted"
spa: "La sentencia no es segura debido a usar una cláusula LIMIT. No es segura porque el conjunto incluido de filas no se puede predecir"

# ER_BINLOG_UNSAFE_INSERT_DELAYED
source: "The statement is unsafe because it uses INSERT DELAYED. This is unsafe because the times when rows are inserted cannot be predicted"
spa: "La sentencia no es segura debido a usar una INSERT DELAYED. No es segura porque los momentos en que las filas han de insertarse no se pueden predecir"

# ER_BINLOG_UNSAFE_SYSTEM_TABLE
source: "The statement is unsafe because it uses the general log, slow query log, or performance_schema table(s). This is unsafe because system tables may differ on slaves"
spa: "La sentencia no es segura debido a usar el historial (log) general, un historial (log) lento o tabla(s) de performance_schema. No es segura porque las tablas de sistema pueden diferir de las esclavas"

# ER_BINLOG_UNSAFE_AUTOINC_COLUMNS
source: "Statement is unsafe because it invokes a trigger or a stored function that inserts into an AUTO_INCREMENT column. Inserted values cannot be logged correctly"
spa: "La sentencia no es segura debido a invocar un disparador o una función almacenada que inserta una columna de AUTO_INCREMENT. No se puede llevar historial correcto de Los valores insertados".

# ER_BINLOG_UNSAFE_UDF
source: "Statement is unsafe because it uses a UDF which may not return the same value on the slave"
spa: "La sentencia no es segura porque usa un UDF que puede no devolver el mismo valor en el esclavo"

# ER_BINLOG_UNSAFE_SYSTEM_VARIABLE
source: "Statement is unsafe because it uses a system variable that may have a different value on the slave"
spa: "La sentencia no es segura porque usa una variable de sistema que puede tener un valor diferente en el esclavo"

# ER_BINLOG_UNSAFE_SYSTEM_FUNCTION
source: "Statement is unsafe because it uses a system function that may return a different value on the slave"
spa: "La sentencia no es segura porque usa una función de sistema que puede devolver un valor diferente en el esclavo"

# ER_BINLOG_UNSAFE_NONTRANS_AFTER_TRANS
source: "Statement is unsafe because it accesses a non-transactional table after accessing a transactional table within the same transaction"
spa: "La sentencia no es segura porque accede a una tabla no transaccional tras acceder a una transaccional dentro de la misma transacción"

# ER_MESSAGE_AND_STATEMENT
source: "%s Statement: %s"
spa: "%s Sentencia: %s"

# ER_SLAVE_CONVERSION_FAILED
source: "Column %d of table '%-.192s.%-.192s' cannot be converted from type '%-.50s' to type '%-.50s'"
spa: "La columna %d de la tabla '%-.192s.%-.192s' no puede ser convertida desde el tipo '%-.50s' al tipo '%-.50s'"

# ER_SLAVE_CANT_CREATE_CONVERSION
source: "Can't create conversion table for table '%-.192s.%-.192s'"
spa: "No puedo crear tabla de conversión para la tabla '%-.192s.%-.192s'"

# ER_INSIDE_TRANSACTION_PREVENTS_SWITCH_BINLOG_FORMAT
source: "Cannot modify @@session.binlog_format inside a transaction"
spa: "No puedo modificar @@session.binlog_format dentro de una transacción"

# ER_PATH_LENGTH
source: "The path specified for %.64T is too long"
spa: "La ruta especificada para %.64T es demasiado larga"

# ER_WARN_DEPRECATED_SYNTAX_NO_REPLACEMENT
source: "'%s' is deprecated and will be removed in a future release"
spa: "'%s' está obsoleto y será quitada en una entrega futura"

# ER_WRONG_NATIVE_TABLE_STRUCTURE
source: "Native table '%-.64s'.'%-.64s' has the wrong structure"
spa: "La tabla nativa '%-.64s'.'%-.64s' tiene una estructura equivocada"

# ER_WRONG_PERFSCHEMA_USAGE
source: "Invalid performance_schema usage"
spa: "Uso inválido de performance_schema"

# ER_WARN_I_S_SKIPPED_TABLE
source: "Table '%s'.'%s' was skipped since its definition is being modified by concurrent DDL statement"
spa: "La tabla '%s'.'%s' fue saltada ya que su definición está siendo modificada por la sentencia DDL concurrente"

# ER_INSIDE_TRANSACTION_PREVENTS_SWITCH_BINLOG_DIRECT
source: "Cannot modify @@session.binlog_direct_non_transactional_updates inside a transaction"
spa: "No puedo modificar @@session.binlog_direct_non_transactional_updates dentro de una transacción"

# ER_STORED_FUNCTION_PREVENTS_SWITCH_BINLOG_DIRECT
source: "Cannot change the binlog direct flag inside a stored function or trigger"
spa: "No puedo cambiar la bandera directa de binlog dentro de una función almacenada o de un disparador"

# ER_SPATIAL_MUST_HAVE_GEOM_COL 42000
source: "A SPATIAL index may only contain a geometrical type column"
spa: "Un índice SPATIAL sólo puede contener una columna de tipo geométrico"

# ER_TOO_LONG_INDEX_COMMENT
source: "Comment for index '%-.64s' is too long (max = %lu)"
spa: "El comentario para el índice '%-.64s' es demasiado largo (máx = %lu)"

# ER_LOCK_ABORTED
source: "Wait on a lock was aborted due to a pending exclusive lock"
spa: "Se ha abortado la espera por un bloqueo debido a bloqueo exclusivo pendiente"

# ER_DATA_OUT_OF_RANGE 22003
source: "%s value is out of range in '%s'"
spa: "%s valor se encuentra fuera de rango '%s'"

# ER_WRONG_SPVAR_TYPE_IN_LIMIT
source: "A variable of a non-integer based type in LIMIT clause"
spa: "Una variable de tipo basado en no entero en cláusula LIMIT"

# ER_BINLOG_UNSAFE_MULTIPLE_ENGINES_AND_SELF_LOGGING_ENGINE
source: "Mixing self-logging and non-self-logging engines in a statement is unsafe"
spa: "No es segura la mezcla de motores de auto-historial (log) y de no auto-historial en una sentencia"

# ER_BINLOG_UNSAFE_MIXED_STATEMENT
source: "Statement accesses nontransactional table as well as transactional or temporary table, and writes to any of them"
spa: "La sentencia accede a tabla no transaccional así como transaccional o tabla temporal y graba en cualquiera de ellas"

# ER_INSIDE_TRANSACTION_PREVENTS_SWITCH_SQL_LOG_BIN
source: "Cannot modify @@session.sql_log_bin inside a transaction"
spa: "No puedo modificar @@session.sql_log_bin dentro de una transacción"

# ER_STORED_FUNCTION_PREVENTS_SWITCH_SQL_LOG_BIN
source: "Cannot change the sql_log_bin inside a stored function or trigger"
spa: "No puedo cambiar sql_log_bin dentro de una función almacenada o disparador"

# ER_FAILED_READ_FROM_PAR_FILE
source: "Failed to read from the .par file"
spa: "No pude leer desde fichero/archivo .par"

# ER_VALUES_IS_NOT_INT_TYPE_ERROR
source: "VALUES value for partition '%-.64s' must have type INT"
spa: "El valor VALUES para la partición '%-.64s' debe de tener el tipo INT"

# ER_ACCESS_DENIED_NO_PASSWORD_ERROR 28000
source: "Access denied for user '%s'@'%s'"
spa: "Acceso denegado para usuario: '%s'@'%s'"

# ER_SET_PASSWORD_AUTH_PLUGIN
source: "SET PASSWORD is ignored for users authenticating via %s plugin"
spa: "SET PASSWORD no tiene significado para usuarios que se autentican vía enchufe (plugin) %s"

# ER_GRANT_PLUGIN_USER_EXISTS
source: "GRANT with IDENTIFIED WITH is illegal because the user %-.*s already exists"
spa: "GRANT con IDENTIFIED WITH es ilegal porque el usuario %-.*s ya existe"

# ER_TRUNCATE_ILLEGAL_FK 42000
source: "Cannot truncate a table referenced in a foreign key constraint (%.192s)"
spa: "No puedo truncar una tabla referenciada en una restricción de clave foránea (%.192s)"

# ER_PLUGIN_IS_PERMANENT
source: "Plugin '%s' is force_plus_permanent and can not be unloaded"
spa: "El enchufe (plugin) '%s' está force_plus_permanent y no puede ser descargado"
