Repository: vladbogo/test-translation
Catalog: spa.xlf
Languages: spa

# ER_UNSUPPORTED_PS
source: "This command is not supported in the prepared statement protocol yet"
spa: "Este comando no se encuentra soportado para protocolo de sentencia preparada, aún"

# ER_GET_ERRMSG
source: "Got error %d '%-.200s' from %s"
spa: "Obtenido error %d '%-.200s' desde %s"

# ER_GET_TEMPORARY_ERRMSG
source: "Got temporary error %d '%-.200s' from %s"
spa: "Obtenido error temporal %d '%-.200s' desde %s"

# ER_UNKNOWN_TIME_ZONE
source: "Unknown or incorrect time zone: '%-.64s'"
spa: "Zona temporal desconocida o incorrecta: '%-.64s'"

# ER_WARN_INVALID_TIMESTAMP
source: "Invalid TIMESTAMP value in column '%s' at row %lu"
spa: "Valor inválido de SELLO TEMPORAL (TIMESTAMP) en la columna '%s' de la fila %lu"

# ER_INVALID_CHARACTER_STRING
source: "Invalid %s character string: '%.64T'"
spa: "Cadena de carácter %s inválida: '%.64T'"

# ER_WARN_ALLOWED_PACKET_OVERFLOWED
source: "Result of %s() was larger than max_allowed_packet (%ld) - truncated"
spa: "El resultado de %s() ha sido mayor que max_allowed_packet (%ld) - truncado"

# ER_CONFLICTING_DECLARATIONS
source: "Conflicting declarations: '%s%s' and '%s%s'"
spa: "Declaraciones conflictivas: '%s%s' y '%s%s'"

# ER_SP_NO_RECURSIVE_CREATE 2F003
source: "Can't create a %s from within another stored routine"
spa: "No puedo crear una %s desde dentro de otra rutina almacenada"

# ER_SP_ALREADY_EXISTS 42000
source: "%s %s already exists"
spa: "%s %s ya existe"

# ER_SP_DOES_NOT_EXIST 42000
source: "%s %s does not exist"
spa: "%s %s no existe"

# ER_SP_DROP_FAILED
source: "Failed to DROP %s %s"
spa: "No pude ELIMINAR (DROP) %s %s"

# ER_SP_STORE_FAILED
source: "Failed to CREATE %s %s"
spa: "No pude CREAR %s %s"

# ER_SP_LILABEL_MISMATCH 42000
source: "%s with no matching label: %s"
spa: "%s sin etiqueta coincidente: %s"

# ER_SP_LABEL_REDEFINE 42000
source: "Redefining label %s"
spa: "Redefiniendo etiqueta %s"

# ER_SP_LABEL_MISMATCH 42000
source: "End-label %s without match"
spa: "Etiqueta-Final %s sin coincidencia"

# ER_SP_UNINIT_VAR 01000
source: "Referring to uninitialized variable %s"
spa: "Refiriéndose a variable %s sin inicializar"

# ER_SP_BADSELECT 0A000
source: "PROCEDURE %s can't return a result set in the given context"
spa: "El PROCEDIMIENTO (PROCEDURE) %s no puede devolver un conjunto de resultados en el contexto dado"

# ER_SP_BADRETURN 42000
source: "RETURN is only allowed in a FUNCTION"
spa: "RETURN sólo se permite dentro de una FUNCIÓN"

# ER_SP_BADSTATEMENT 0A000
source: "%s is not allowed in stored procedures"
spa: "%s no permitido en procedimientos almacenados"

# ER_UPDATE_LOG_DEPRECATED_IGNORED 42000
source: "The update log is deprecated and replaced by the binary log; SET SQL_LOG_UPDATE has been ignored. This option will be removed in MariaDB 5.6"
spa: "El historial (log) de actualización se encuentra obsoleto y reemplazado por el historial (log) binario; SET SQL_LOG_UPDATE ha sido ignorado. Esta opción será quitada en MariaDB 5.6"

# ER_UPDATE_LOG_DEPRECATED_TRANSLATED 42000
source: "The update log is deprecated and replaced by the binary log; SET SQL_LOG_UPDATE has been translated to SET SQL_LOG_BIN. This option will be removed in MariaDB 5.6"
spa: "El historial (log) de actualización se encuentra obsoleto y reemplazado por el historial binario; SET SQL_LOG_UPDATE ha sido traducido a SET SQL_LOG_BIN. Esta opción será quitada en MariaDB 5.6"

# ER_QUERY_INTERRUPTED 70100
source: "Query execution was interrupted"
spa: "Se ha interrumpido la ejecución de la consulta (query)"

# ER_SP_WRONG_NO_OF_ARGS 42000
source: "Incorrect number of arguments for %s %s; expected %u, got %u"
spa: "Número incorrecto de argumentos para %s %s; se esperaba %u, se obtuvo %u"

# ER_SP_COND_MISMATCH 42000
source: "Undefined CONDITION: %s"
spa: "CONDICIÓN no definida: %s"

# ER_SP_NORETURN 42000
source: "No RETURN found in FUNCTION %s"
spa: "No se hallado RETURN en FUNCIÓN %s"

# ER_SP_NORETURNEND 2F005
source: "FUNCTION %s ended without RETURN"
spa: "La FUNCIÓN %s termina sin RETURN"

# ER_SP_BAD_CURSOR_QUERY 42000
source: "Cursor statement must be a SELECT"
spa: "La sentencia de cursor debe de ser un SELECT"

# ER_SP_BAD_CURSOR_SELECT 42000
source: "Cursor SELECT must not have INTO"
spa: "El SELECT de cursor no debe de tener INTO"

# ER_SP_CURSOR_MISMATCH 42000
source: "Undefined CURSOR: %s"
spa: "CURSOR indefinido: %s"

# ER_SP_CURSOR_ALREADY_OPEN 24000
source: "Cursor is already open"
spa: "Cursor ya abierto"

# ER_SP_CURSOR_NOT_OPEN 24000
source: "Cursor is not open"
spa: "Cursor no abierto"

# ER_SP_UNDECLARED_VAR 42000
source: "Undeclared variable: %s"
spa: "Variable sin declarar: %s"

# ER_SP_WRONG_NO_OF_FETCH_ARGS
source: "Incorrect number of FETCH variables"
spa: "Incorrecto número de variables FETCH"

# ER_SP_FETCH_NO_DATA 02000
source: "No data - zero rows fetched, selected, or processed"
spa: "No hay datos - cero filas logradas, seleccionadas o procesadas"

# ER_SP_DUP_PARAM 42000
source: "Duplicate parameter: %s"
spa: "Parámetro duplicado: %s"

# ER_SP_DUP_VAR 42000
source: "Duplicate variable: %s"
spa: "Variable duplicada: %s"

# ER_SP_DUP_COND 42000
source: "Duplicate condition: %s"
spa: "Condición duplicada: %s"

# ER_SP_DUP_CURS 42000
source: "Duplicate cursor: %s"
spa: "Cursor duplicado: %s"

# ER_SP_CANT_ALTER
source: "Failed to ALTER %s %s"
spa: "Fallo en ALTER %s %s"

# ER_SP_SUBSELECT_NYI 0A000
source: "Subquery value not supported"
spa: "Valor de Subconsulta (subquery) no soportado"

# ER_STMT_NOT_ALLOWED_IN_SF_OR_TRG 0A000
source: "%s is not allowed in stored function or trigger"
spa: "%s no permitido en función almacenada o en disparador"

# ER_SP_VARCOND_AFTER_CURSHNDLR 42000
source: "Variable or condition declaration after cursor or handler declaration"
spa: "Declaración de variable o condición tras declaración de cursor o manejador"

# ER_SP_CURSOR_AFTER_HANDLER 42000
source: "Cursor declaration after handler declaration"
spa: "Declaración de cursor tras declaración de manejador"

# ER_SP_CASE_NOT_FOUND 20000
source: "Case not found for CASE statement"
spa: "Caso no hallado para sentencia CASE"

# ER_FPARSER_TOO_BIG_FILE
source: "Configuration file '%-.192s' is too big"
spa: "El fichero/archivo de configuración '%-.192s' es demasiado grande"

# ER_FPARSER_BAD_HEADER
source: "Malformed file type header in file '%-.192s'"
spa: "Cabecera de tipo de fichero/archivo malformada en fichero/archivo '%-.192s'"

# ER_FPARSER_EOF_IN_COMMENT
source: "Unexpected end of file while parsing comment '%-.200s'"
spa: "Inesperado fin de fichero/archivo mientras se analizaba comentario '%-.200s'"

# ER_FPARSER_ERROR_IN_PARAMETER
source: "Error while parsing parameter '%-.192s' (line: '%-.192s')"
spa: "Error mientras se analizaba parámetro '%-.192s' (línea: '%-.192s')"

# ER_FPARSER_EOF_IN_UNKNOWN_PARAMETER
source: "Unexpected end of file while skipping unknown parameter '%-.192s'"
spa: "Inesperado fin de fichero/archivo mientras se saltaba parámetro desconocido '%-.192s'"

# ER_VIEW_NO_EXPLAIN
source: "ANALYZE/EXPLAIN/SHOW can not be issued; lacking privileges for underlying table"
spa: "ANALYZE/EXPLAIN/SHOW no puede ser emitdo; privilegios insuficientes para tabla subyacente"

# ER_FRM_UNKNOWN_TYPE
source: "File '%-.192s' has unknown type '%-.64s' in its header"
spa: "El fichero/archivo '%-.192s' es de un tipo desconocido '%-.64s' en su cabecera"

# ER_WRONG_OBJECT
source: "'%-.192s.%-.192s' is not of type '%s'"
spa: "'%-.192s.%-.192s' no es del tipo '%s'"

# ER_NONUPDATEABLE_COLUMN
source: "Column '%-.192s' is not updatable"
spa: "La columna '%-.192s' no es actualiable"

# ER_VIEW_SELECT_DERIVED
source: "View's SELECT contains a subquery in the FROM clause"
spa: "El SELECT de la vista contiene una subconsulta (subquery) en la cláusula FROM"

# ER_VIEW_SELECT_CLAUSE
source: "View's SELECT contains a '%s' clause"
spa: "El SELECT de la vista contiene una cláusula '%s'"

# ER_VIEW_SELECT_VARIABLE
source: "View's SELECT contains a variable or parameter"
spa: "El SELECT de la vista contiene una variable o un parámetro"

# ER_VIEW_SELECT_TMPTABLE
source: "View's SELECT refers to a temporary table '%-.192s'"
spa: "El SELECT de la vista se refiere a una tabla temporal '%-.192s'"

# ER_VIEW_WRONG_LIST
source: "View's SELECT and view's field list have different column counts"
spa: "El SELECT de la vista y la lista de campos de la vista tienen un contador diferente de columnas"

# ER_WARN_VIEW_MERGE
source: "View merge algorithm can't be used here for now (assumed undefined algorithm)"
spa: "El algoritmo de fusión de la vista no se puede usar aquí por ahora (se asume algoritmo indefinido)"

# ER_WARN_VIEW_WITHOUT_KEY
source: "View being updated does not have complete key of underlying table in it"
spa: "La vista que se está actualizando no tiene clave completa de la tabla subyacente que contiene"

# ER_VIEW_INVALID
source: "View '%-.192s.%-.192s' references invalid table(s) or column(s) or function(s) or definer/invoker of view lack rights to use them"
spa: "La vista '%-.192s.%-.192s' hace referencia a tabla(s) o columna(s) o función(es) inválida(s) o al definidor/invocador de vista le faltan derechos para usarlos"

# ER_SP_NO_DROP_SP
source: "Can't drop or alter a %s from within another stored routine"
spa: "No puedo eliminar o alterar una %s desde dentro de otra rutina almacenada"

# ER_SP_GOTO_IN_HNDLR
source: "GOTO is not allowed in a stored procedure handler"
spa: "GOTO no permitido en manejador de procedimiento almacenado"

# ER_TRG_ALREADY_EXISTS
source: "Trigger '%s' already exists"
spa: "Ya existe el disparador `%s`"

# ER_TRG_DOES_NOT_EXIST
source: "Trigger does not exist"
spa: "El disparador no existe"

# ER_TRG_ON_VIEW_OR_TEMP_TABLE
source: "Trigger's '%-.192s' is a view, temporary table or sequence"
spa: "El disparador '%-.192s' es una vista, tabla temporal o secuencia"

# ER_TRG_CANT_CHANGE_ROW
source: "Updating of %s row is not allowed in %strigger"
spa: "Actualizar la fila %s no está permitido en disparador %s"

# ER_TRG_NO_SUCH_ROW_IN_TRG
source: "There is no %s row in %s trigger"
spa: "No hay fila %s en disparador %s"

# ER_NO_DEFAULT_FOR_FIELD
source: "Field '%-.192s' doesn't have a default value"
spa: "El campo '%-.192s' no tiene un valor por defecto"

# ER_DIVISION_BY_ZERO 22012
source: "Division by 0"
spa: "División por 0"

# ER_TRUNCATED_WRONG_VALUE_FOR_FIELD 22007
source: "Incorrect %-.32s value: '%-.128T' for column `%.192s`.`%.192s`.`%.192s` at row %lu"
spa: "Incorrecto %-.32s valor: '%-.128T' para columna `%.192s`.`%.192s`.`%.192s` en la fila %lu"

# ER_ILLEGAL_VALUE_FOR_TYPE 22007
source: "Illegal %s '%-.192T' value found during parsing"
spa: "Hallado valor ilegal %s '%-.192T' durante el análisi"

# ER_VIEW_NONUPD_CHECK
source: "CHECK OPTION on non-updatable view %`-.192s.%`-.192s"
spa: "CHECK OPTION en vista no actualizable %`-.192s.%`-.192s"

# ER_VIEW_CHECK_FAILED 44000
source: "CHECK OPTION failed %`-.192s.%`-.192s"
spa: "CHECK OPTION falló %`-.192s.%`-.192s"

# ER_PROCACCESS_DENIED_ERROR 42000
source: "%-.32s command denied to user '%s'@'%s' for routine '%-.192s'"
spa: "Comando %-.32s denegado para el usuario '%s'@'%s' para rutina '%-.192s'"

# ER_RELAY_LOG_FAIL
source: "Failed purging old relay logs: %s"
spa: "Falló la purga de viejos historiales (logs) de reenvío: %s"

# ER_PASSWD_LENGTH
source: "Password hash should be a %d-digit hexadecimal number"
spa: "El valor calculado de la contraseña debería de ser un número hexadecimal de %d-dígitos"

# ER_UNKNOWN_TARGET_BINLOG
source: "Target log not found in binlog index"
spa: "Historial (log) de destino no hallado en índice binlog"

# ER_IO_ERR_LOG_INDEX_READ
source: "I/O error reading log index file"
spa: "Error de E/S leyendo fichero/archivo índice de historial (log)"

# ER_BINLOG_PURGE_PROHIBITED
source: "Server configuration does not permit binlog purge"
spa: "La configuración del servidor no permite purgar binlog"

# ER_FSEEK_FAIL
source: "Failed on fseek()"
spa: "Fallo en fseek()"

# ER_BINLOG_PURGE_FATAL_ERR
source: "Fatal error during log purge"
spa: "Error fatal durante la purga del historial (log)"

# ER_LOG_IN_USE
source: "A purgeable log is in use, will not purge"
spa: "Se encuentra en uso un historial purgable, no lo purgaré"

# ER_LOG_PURGE_UNKNOWN_ERR
source: "Unknown error during log purge"
spa: "Error desconocido durante la purga del historial (log)"

# ER_RELAY_LOG_INIT
source: "Failed initializing relay log position: %s"
spa: "Fallo inicializando la posición del historial de reenvío: %s"

# ER_NO_BINARY_LOGGING
source: "You are not using binary logging"
spa: "No está usando historial (log) binario"

# ER_RESERVED_SYNTAX
source: "The '%-.64s' syntax is reserved for purposes internal to the MariaDB server"
spa: "La sintaxis '%-.64s' está reservada para propósitos internos del servidor MariaDB"

# ER_WSAS_FAILED
source: "WSAStartup Failed"
spa: "Falló WSAStartup"

# ER_DIFF_GROUPS_PROC
source: "Can't handle procedures with different groups yet"
spa: "No puedo manejar procedimientos con grupos diferentes, aún"

# ER_NO_GROUP_FOR_PROC
source: "Select must have a group with this procedure"
spa: "La selección debe de tener un grupo con este procedimiento"

# ER_ORDER_WITH_PROC
source: "Can't use ORDER clause with this procedure"
spa: "No puedo usar la cláusula ORDER con este procedimiento"

# ER_LOGGING_PROHIBIT_CHANGING_OF
source: "Binary logging and replication forbid changing the global server %s"
spa: "El historial (log) binario y la réplica prohibe cambiar el servidor global %s"

# ER_NO_FILE_MAPPING
source: "Can't map file: %-.200s, errno: %M"
spa: "No puedo mapear fichero/archivo: %-.200s, error: %M"

# ER_WRONG_MAGIC
source: "Wrong magic in %-.64s"
spa: "Magia equivocada en %-.64s"

# ER_PS_MANY_PARAM
source: "Prepared statement contains too many placeholders"
spa: "Sentencia preparada contiene demasiados marcadores de posición"

# ER_KEY_PART_0
source: "Key part '%-.192s' length cannot be 0"
spa: "El tamaño de trozo de clave '%-.192s' no puede ser 0"

# ER_VIEW_CHECKSUM
source: "View text checksum failed"
spa: "Ha fallado la suma de comprobación del texto de la vista"

# ER_VIEW_MULTIUPDATE
source: "Can not modify more than one base table through a join view '%-.192s.%-.192s'"
spa: "No puedo modificar más de una tabla base a través de una vista de unión '%-.192s.%-.192s'"

# ER_VIEW_NO_INSERT_FIELD_LIST
source: "Can not insert into join view '%-.192s.%-.192s' without fields list"
spa: "No puedo insertar dentro de vista de unión '%-.192s.%-.192s' sin lista de campos"

# ER_VIEW_DELETE_MERGE_VIEW
source: "Can not delete from join view '%-.192s.%-.192s'"
spa: "No puedo borrar desde vista de unión '%-.192s.%-.192s'"

# ER_CANNOT_USER
source: "Operation %s failed for %.256s"
spa: "Ha fallado la operación %s para %.256s"

# ER_XAER_NOTA XAE04
source: "XAER_NOTA: Unknown XID"
spa: "XAER_NOTA: XID desconocido"

# ER_XAER_INVAL XAE05
source: "XAER_INVAL: Invalid arguments (or unsupported command)"
spa: "XAER_INVAL: Argumentos inválidos (o comando no soportado)"

# ER_XAER_RMFAIL XAE07
source: "XAER_RMFAIL: The command cannot be executed when global transaction is in the %.64s state"
spa: "XAER_RMFAIL: El comando no se puede ejecutar cuando la transacción global se encuentra en estado %.64s"

# ER_XAER_OUTSIDE XAE09
source: "XAER_OUTSIDE: Some work is done outside global transaction"
spa: "XAER_OUTSIDE: Algún trabajo se ha realizado fuera de la transacción global"

# ER_XAER_RMERR XAE03
source: "XAER_RMERR: Fatal error occurred in the transaction branch - check your data for consistency"
spa: "XAER_RMERR: Ha ocurrido un error fatal en la rama de la transacción - revise la consitencia de sus datos"

# ER_XA_RBROLLBACK XA100
source: "XA_RBROLLBACK: Transaction branch was rolled back"
spa: "XA_RBROLLBACK: La rama de la transacción ha sido retrocedida (rolled back)"

# ER_NONEXISTING_PROC_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s' on routine '%-.192s'"
spa: "No existe tal concesión definida para el usuario '%-.48s' en equipo '%-.64s' en rutina '%-.192s'"

# ER_PROC_AUTO_GRANT_FAIL
source: "Failed to grant EXECUTE and ALTER ROUTINE privileges"
spa: "Fallo al conceder privilegios de EXECUTE y ALTER ROUTINE"

# ER_PROC_AUTO_REVOKE_FAIL
source: "Failed to revoke all privileges to dropped routine"
spa: "Fallo al rescindir todos los privilegios de la rutina anulada"

# ER_DATA_TOO_LONG 22001
source: "Data too long for column '%s' at row %lu"
spa: "Datos demasiado largos para la columna '%s' en la fila %lu"

# ER_SP_BAD_SQLSTATE 42000
source: "Bad SQLSTATE: '%s'"
spa: "Mal SQLSTATE: '%s'"

# ER_STARTUP
source: "%s: ready for connections.\nVersion: '%s' socket: '%s' port: %d %s"
spa: "%s: preparada para conexiones.\nVersión: '%s' conector: '%s' puerto: %d %s"

# ER_LOAD_FROM_FIXED_SIZE_ROWS_TO_VAR
source: "Can't load value from file with fixed size rows to variable"
spa: "No puedo cargar valor desde fichero/archivo con filas de tamaño fijo en variable"

# ER_CANT_CREATE_USER_WITH_GRANT 42000
source: "You are not allowed to create a user with GRANT"
spa: "No está autorizado a crear un usuario con GRANT"

# ER_WRONG_VALUE_FOR_TYPE
source: "Incorrect %-.32s value: '%-.128T' for function %-.32s"
spa: "Incorrecto valor %-.32s: '%-.128T' para la función %-.32s"

# ER_TABLE_DEF_CHANGED
source: "Table definition has changed, please retry transaction"
spa: "Ha cambiado la definición de la tabla, por favor reintente la transacción"

# ER_SP_DUP_HANDLER 42000
source: "Duplicate handler declared in the same block"
spa: "Manejador duplicado declarado en mismo bloque"

# ER_SP_NOT_VAR_ARG 42000
source: "OUT or INOUT argument %d for routine %s is not a variable or NEW pseudo-variable in BEFORE trigger"
spa: "El argumento %d OUT o INOUT para la rutina %s no es una variable o pseudo-variable NEW en disparador BEFORE"

# ER_SP_NO_RETSET 0A000
source: "Not allowed to return a result set from a %s"
spa: "No autorizado a devolver un conjunto de resultados desde un %s"

# ER_CANT_CREATE_GEOMETRY_OBJECT 22003
source: "Cannot get geometry object from data you send to the GEOMETRY field"
spa: "No puedo obtener objeto de geometría desde los datos que vd envía al campo GEOMETRY"

# ER_FAILED_ROUTINE_BREAK_BINLOG
source: "A routine failed and has neither NO SQL nor READS SQL DATA in its declaration and binary logging is enabled; if non-transactional tables were updated, the binary log will miss their changes"
spa: "Ha fallado una rutina y no tiene ni NO SQL ni READS SQL DATA en su declaración y el historial (log) binario se encuentra activado; si han sido actualizadas tablas no transaccionales, el fichero/archivo binario de historial (log) perderá sus cambios"

# ER_BINLOG_UNSAFE_ROUTINE
source: "This function has none of DETERMINISTIC, NO SQL, or READS SQL DATA in its declaration and binary logging is enabled (you *might* want to use the less safe log_bin_trust_function_creators variable)"
spa: "Esta función no tiene ninguno de DETERMINISTIC, NO SQL o READS SQL DATA en su declaración y está activado el historial binario (vd *podría* querer usar la variable menos segura log_bin_trust_function_creators)"

# ER_BINLOG_CREATE_ROUTINE_NEED_SUPER
source: "You do not have the SUPER privilege and binary logging is enabled (you *might* want to use the less safe log_bin_trust_function_creators variable)"
spa: "No tiene el privilegio SUPER y está activado el historial binario (*podría* querer usar la variable menos segura log_bin_trust_function_creators)"

# ER_EXEC_STMT_WITH_OPEN_CURSOR
source: "You can't execute a prepared statement which has an open cursor associated with it. Reset the statement to re-execute it"
spa: "No puede ejecutar una sentencia preparada que tiene abierto un cursor asociado con ella. Renueve la sentencia para re-ejecutarla"

# ER_STMT_HAS_NO_OPEN_CURSOR
source: "The statement (%lu) has no open cursor"
spa: "La sentencia (%lu) no tiene cursor abierto"

# ER_COMMIT_NOT_ALLOWED_IN_SF_OR_TRG
source: "Explicit or implicit commit is not allowed in stored function or trigger"
spa: "Comisión (commit) implícita o explícita no permitida en funciones almacenadas o en disparadores"

# ER_NO_DEFAULT_FOR_VIEW_FIELD
source: "Field of view '%-.192s.%-.192s' underlying table doesn't have a default value"
spa: "El campo de tabla subyacente de vista '%-.192s.%-.192s' no tiene valor por defecto"

# ER_SP_NO_RECURSION
source: "Recursive stored functions and triggers are not allowed"
spa: "No autorizadas funciones almacenadas recursivas ni disparadores"

# ER_TOO_BIG_SCALE 42000 S1009
source: "Too big scale specified for '%-.192s'. Maximum is %u"
spa: "Escala demasiado grande especificada para '%-.192s'. El máximo es de %u"

# ER_TOO_BIG_PRECISION 42000 S1009
source: "Too big precision specified for '%-.192s'. Maximum is %u"
spa: "Precisión demasiado grande especificada para '%-.192s'. El máximo es de %u"

# ER_M_BIGGER_THAN_D 42000 S1009
source: "For float(M,D), double(M,D) or decimal(M,D), M must be >= D (column '%-.192s')"
spa: "Para flotante(M,D), doble(M,D) o decimal(M,D), M debe de ser >= D (columna '%-.192s')"

# ER_WRONG_LOCK_OF_SYSTEM_TABLE
source: "You can't combine write-locking of system tables with other tables or lock types"
spa: "No puede combinar bloqueo de escritura de tablas de sistema con otras tablas o tipos de bloqueo"

# ER_CONNECT_TO_FOREIGN_DATA_SOURCE
source: "Unable to connect to foreign data source: %.64s"
spa: "No puedo conectar a fuente foránea de datos: %.64s"

# ER_QUERY_ON_FOREIGN_DATA_SOURCE
source: "There was a problem processing the query on the foreign data source. Data source error: %-.64s"
spa: "Hubo un problema procesando la consulta (query) en la fuente foránea de datos. Error de fuente de datos: %-.64s"

# ER_FOREIGN_DATA_SOURCE_DOESNT_EXIST
source: "The foreign data source you are trying to reference does not exist. Data source error: %-.64s"
spa: "La fuente foránea de datos que intenta referenciar no existe. Error en fuente de datos: %-.64s"

# ER_FOREIGN_DATA_STRING_INVALID_CANT_CREATE
source: "Can't create federated table. The data source connection string '%-.64s' is not in the correct format"
spa: "No puedo crear tabla federada. La cadena de conexión de la fuente de datos '%-.64s' no tiene el formato correcto"

# ER_FOREIGN_DATA_STRING_INVALID
source: "The data source connection string '%-.64s' is not in the correct format"
spa: "La cadena de conexón de la fuente de datos '%-.64s' no tiene el formato correcto"

# ER_CANT_CREATE_FEDERATED_TABLE
source: "Can't create federated table. Foreign data src error: %-.64s"
spa: "No puedo crear tabla federada. Error en fuente de datos foráneos: %-.64s"

# ER_TRG_IN_WRONG_SCHEMA
source: "Trigger in wrong schema"
spa: "Disparador en esquema equivocado"

# ER_STACK_OVERRUN_NEED_MORE
source: "Thread stack overrun: %ld bytes used of a %ld byte stack, and %ld bytes needed. Consider increasing the thread_stack system variable."
spa: "Desbordamiento en pila de hilos (threads): %ld bytes usados de una pila de %ld y son necesarios %ld bytes. Considere el incrementar la variable de sistema --thread_stack=#."

# ER_TOO_LONG_BODY 42000 S1009
source: "Routine body for '%-.100s' is too long"
spa: "El cuerpo de rutina para '%-.100s' es demasiado largo"

# ER_WARN_CANT_DROP_DEFAULT_KEYCACHE
source: "Cannot drop default keycache"
spa: "No puedo eliminar keycache por defecto"

# ER_TOO_BIG_DISPLAYWIDTH 42000 S1009
source: "Display width out of range for '%-.192s' (max = %lu)"
spa: "Ancho a mostrar fuera de rango para '%-.192s' (máx = %lu)"

# ER_XAER_DUPID XAE08
source: "XAER_DUPID: The XID already exists"
spa: "XAER_DUPID: El XID ya existe"

# ER_DATETIME_FUNCTION_OVERFLOW 22008
source: "Datetime function: %-.32s field overflow"
spa: "Función Datetime: %-.32s desbordamiento de campo"
