Repository: vladbogo/test-translation
Catalog: spa.xlf
Languages: spa

# ER_YES
source: "YES"
spa: "SÍ"

# ER_CANT_CREATE_FILE
source: "Can't create file '%-.200s' (errno: %M)"
spa: "No puedo crear el fichero/archivo '%-.200s' (Error: %M)"

# ER_CANT_CREATE_TABLE
source: "Can't create table %`s.%`s (errno: %M)"
spa: "No puedo crear la tabla %`s.%`s (Error: %M)"

# ER_CANT_CREATE_DB
source: "Can't create database '%-.192s' (errno: %M)"
spa: "No puedo crear la base de datos '%-.192s' (Error: %M)"

# ER_DB_CREATE_EXISTS
source: "Can't create database '%-.192s'; database exists"
spa: "No puedo crear la base de datos '%-.192s'; la base de datos ya existe"

# ER_DB_DROP_EXISTS
source: "Can't drop database '%-.192s'; database doesn't exist"
spa: "No puedo eliminar la base de datos '%-.192s'; la base de datos no existe"

# ER_DB_DROP_DELETE
source: "Error dropping database (can't delete '%-.192s', errno: %M)"
spa: "Error eliminando la base de datos (no puedo borrar '%-.192s', error %M)"

# ER_DB_DROP_RMDIR
source: "Error dropping database (can't rmdir '%-.192s', errno: %M)"
spa: "Error eliminando la base de datos (No puedo borrar el directorio '%-.192s', error %M)"

# ER_CANT_DELETE_FILE
source: "Error on delete of '%-.192s' (errno: %M)"
spa: "Error en el borrado de '%-.192s' (Error: %M)"

# ER_CANT_FIND_SYSTEM_REC
source: "Can't read record in system table"
spa: "No puedo leer el registro en la tabla del sistema"

# ER_CANT_GET_STAT
source: "Can't get status of '%-.200s' (errno: %M)"
spa: "No puedo obtener el estado de '%-.200s' (Error: %M)"

# ER_CANT_GET_WD
source: "Can't get working directory (errno: %M)"
spa: "No puedo obtener directorio de trabajo (Error: %M)"

# ER_CANT_LOCK
source: "Can't lock file (errno: %M)"
spa: "No puedo bloquear fichero/archivo: (Error: %M)"

# ER_CANT_OPEN_FILE
source: "Can't open file: '%-.200s' (errno: %M)"
spa: "No puedo abrir el fichero/archivo: '%-.200s' (Error: %M)"

# ER_FILE_NOT_FOUND
source: "Can't find file: '%-.200s' (errno: %M)"
spa: "No puedo hallar el fichero/archivo: '%-.200s' (Error: %M)"

# ER_CANT_READ_DIR
source: "Can't read dir of '%-.192s' (errno: %M)"
spa: "No puedo leer el directorio de '%-.192s' (Error: %M)"

# ER_CANT_SET_WD
source: "Can't change dir to '%-.192s' (errno: %M)"
spa: "No puedo cambiar al directorio a '%-.192s' (Error: %M)"

# ER_CHECKREAD
source: "Record has changed since last read in table '%-.192s'"
spa: "El registro ha cambiado desde la ultima lectura de la tabla '%-.192s'"

# ER_DISK_FULL
source: "Disk full (%s); waiting for someone to free some space... (errno: %M)"
spa: "Disco lleno (%s). Esperando a que alguien libere algo de espacio... (Error: %M)"

# ER_DUP_KEY 23000
source: "Can't write; duplicate key in table '%-.192s'"
spa: "No puedo escribir, clave duplicada en la tabla '%-.192s'"

# ER_ERROR_ON_CLOSE
source: "Error on close of '%-.192s' (errno: %M)"
spa: "Error en el cierre de '%-.192s' (Error: %M)"

# ER_ERROR_ON_READ
source: "Error reading file '%-.200s' (errno: %M)"
spa: "Error leyendo el fichero/archivo '%-.200s' (Error: %M)"

# ER_ERROR_ON_RENAME
source: "Error on rename of '%-.210s' to '%-.210s' (errno: %M)"
spa: "Error en el renombrado de '%-.210s' a '%-.210s' (Error: %M)"

# ER_ERROR_ON_WRITE
source: "Error writing file '%-.200s' (errno: %M)"
spa: "Error escribiendo el fichero/archivo '%-.200s' (Error: %M)"

# ER_FILE_USED
source: "'%-.192s' is locked against change"
spa: "'%-.192s' esta bloqueado contra cambios"

# ER_FILSORT_ABORT
source: "Sort aborted"
spa: "Ordenación cancelada"

# ER_FORM_NOT_FOUND
source: "View '%-.192s' doesn't exist for '%-.192s'"
spa: "La vista '%-.192s' no existe para '%-.192s'"

# ER_GET_ERRNO
source: "Got error %M from storage engine %s"
spa: "Obtenido error %M desde el motor de almacenaje %s"

# ER_ILLEGAL_HA
source: "Storage engine %s of the table %`s.%`s doesn't have this option"
spa: "El motor de almacenaje %s de la tabla %`s.%`s no contiene esta opción"

# ER_KEY_NOT_FOUND
source: "Can't find record in '%-.192s'"
spa: "No puedo encontrar el registro en '%-.192s'"

# ER_NOT_FORM_FILE
source: "Incorrect information in file: '%-.200s'"
spa: "Información incorrecta en el fichero/archivo: '%-.200s'"

# ER_NOT_KEYFILE
source: "Index for table '%-.200s' is corrupt; try to repair it"
spa: "El índice para la tabla: '%-.200s' está corrupto; intente repararlo"

# ER_OLD_KEYFILE
source: "Old key file for table '%-.192s'; repair it!"
spa: "Clave antigua de fichero/archivo para la tabla '%-.192s'; ¡repárela!"

# ER_OPEN_AS_READONLY
source: "Table '%-.192s' is read only"
spa: "La tabla '%-.192s' es de sólo lectura"

# ER_OUTOFMEMORY HY001 S1001
source: "Out of memory; restart server and try again (needed %d bytes)"
spa: "Memoria insuficiente. Reinicie el servidor e inténtelo otra vez (necesita %d bytes)"

# ER_OUT_OF_SORTMEMORY HY001 S1001
source: "Out of sort memory, consider increasing server sort buffer size"
spa: "Memoria de ordenación insuficiente. Considere el incrementar el tamaño del búfer de ordenación del servidor"

# ER_UNEXPECTED_EOF
source: "Unexpected EOF found when reading file '%-.192s' (errno: %M)"
spa: "Inesperado fin de fichero/archivo mientras leíamos el fichero/archivo '%-.192s' (Error: %M)"

# ER_CON_COUNT_ERROR 08004
source: "Too many connections"
spa: "Demasiadas conexiones"

# ER_OUT_OF_RESOURCES
source: "Out of memory."
spa: "Memoria agotada"

# ER_BAD_HOST_ERROR 08S01
source: "Can't get hostname for your address"
spa: "No puedo obtener el nombre de equipo de la dirección de vd."

# ER_HANDSHAKE_ERROR 08S01
source: "Bad handshake"
spa: "Mal apretón de manos (handshake)"

# ER_DBACCESS_DENIED_ERROR 42000
source: "Access denied for user '%s'@'%s' to database '%-.192s'"
spa: "Acceso denegado para usuario: '%s'@'%s' a la base de datos '%-.192s'"

# ER_ACCESS_DENIED_ERROR 28000
source: "Access denied for user '%s'@'%s' (using password: %s)"
spa: "Acceso denegado para usuario: '%s'@'%s' (Usando contraseña: %s)"

# ER_NO_DB_ERROR 3D000
source: "No database selected"
spa: "Base de datos no seleccionada"

# ER_UNKNOWN_COM_ERROR 08S01
source: "Unknown command"
spa: "Comando desconocido"

# ER_BAD_NULL_ERROR 23000
source: "Column '%-.192s' cannot be null"
spa: "La columna '%-.192s' no puede ser nula"

# ER_BAD_DB_ERROR 42000
source: "Unknown database '%-.192s'"
spa: "Base de datos '%-.192s' desconocida"

# ER_TABLE_EXISTS_ERROR 42S01
source: "Table '%-.192s' already exists"
spa: "La tabla '%-.192s' ya existe"

# ER_BAD_TABLE_ERROR 42S02
source: "Unknown table '%-.100T'"
spa: "Tabla '%-.100T' no reconocida"

# ER_NON_UNIQ_ERROR 23000
source: "Column '%-.192s' in %-.192s is ambiguous"
spa: "La columna: '%-.192s' en %-.192s es ambigua"

# ER_SERVER_SHUTDOWN 08S01
source: "Server shutdown in progress"
spa: "Desconexión de servidor en proceso"

# ER_BAD_FIELD_ERROR 42S22 S0022
source: "Unknown column '%-.192s' in '%-.192s'"
spa: "No se reconoce la columna '%-.192s' en %-.192s"

# ER_WRONG_FIELD_WITH_GROUP 42000 S1009
source: "'%-.192s' isn't in GROUP BY"
spa: "'%-.192s' no se encuentra en GROUP BY"

# ER_WRONG_GROUP_FIELD 42000 S1009
source: "Can't group on '%-.192s'"
spa: "No puedo agrupar por '%-.192s'"

# ER_WRONG_SUM_SELECT 42000 S1009
source: "Statement has sum functions and columns in same statement"
spa: "La sentencia tiene funciones de suma y columnas en la misma sentencia"

# ER_WRONG_VALUE_COUNT 21S01
source: "Column count doesn't match value count"
spa: "El contador de columnas no coincide con el contador de valores"

# ER_TOO_LONG_IDENT 42000 S1009
source: "Identifier name '%-.100T' is too long"
spa: "El nombre del identificador '%-.100T' es demasiado grande"

# ER_DUP_FIELDNAME 42S21 S1009
source: "Duplicate column name '%-.192s'"
spa: "Nombre duplicado de columna '%-.192s'"

# ER_DUP_KEYNAME 42000 S1009
source: "Duplicate key name '%-.192s'"
spa: "Nombre duplicado de clave '%-.192s'"

# ER_DUP_ENTRY 23000 S1009
source: "Duplicate entry '%-.192T' for key %d"
spa: "Entrada duplicada '%-.192T' para la clave %d"

# ER_WRONG_FIELD_SPEC 42000 S1009
source: "Incorrect column specifier for column '%-.192s'"
spa: "Especificador de columna incorrecto para la columna '%-.192s'"

# ER_PARSE_ERROR 42000 s1009
source: "%s near '%-.80T' at line %d"
spa: "%s cerca de '%-.80T' en la línea %d"

# ER_EMPTY_QUERY 42000
source: "Query was empty"
spa: "La consulta (query) estaba vacia"

# ER_NONUNIQ_TABLE 42000 S1009
source: "Not unique table/alias: '%-.192s'"
spa: "La tabla/alias: '%-.192s' no es única"

# ER_INVALID_DEFAULT 42000 S1009
source: "Invalid default value for '%-.192s'"
spa: "Valor por defecto inválido para '%-.192s'"

# ER_MULTIPLE_PRI_KEY 42000 S1009
source: "Multiple primary key defined"
spa: "Múltiples claves primarias definidas"

# ER_TOO_MANY_KEYS 42000 S1009
source: "Too many keys specified; max %d keys allowed"
spa: "Demasiadas claves primarias declaradas. Se permite un máximo de %d claves"

# ER_TOO_MANY_KEY_PARTS 42000 S1009
source: "Too many key parts specified; max %d parts allowed"
spa: "Demasiadas partes de clave declaradas. Se permite un máximo de %d partes"

# ER_TOO_LONG_KEY 42000 S1009
source: "Specified key was too long; max key length is %d bytes"
spa: "Declaración de clave demasiado larga. La máxima longitud de clave es de %d"

# ER_KEY_COLUMN_DOES_NOT_EXIST 42000 S1009
source: "Key column '%-.192s' doesn't exist in table"
spa: "La columna de clave '%-.192s' no existe en la tabla"

# ER_BLOB_USED_AS_KEY 42000 S1009
source: "BLOB column %`s can't be used in key specification in the %s table"
spa: "La columna BLOB %`s no se puede usar en la especificación de clave en la tabla %s"

# ER_TOO_BIG_FIELDLENGTH 42000 S1009
source: "Column length too big for column '%-.192s' (max = %lu); use BLOB or TEXT instead"
spa: "Longitud de columna demasiado grande para la columna '%-.192s' (máximo = %lu). Use BLOB o TEXT en su lugar"

# ER_WRONG_AUTO_KEY 42000 S1009
source: "Incorrect table definition; there can be only one auto column and it must be defined as a key"
spa: "Definición incorrecta de tabla; sólo puede haber una columna automática y ésta debe de ser definida como una clave"

# ER_BINLOG_CANT_DELETE_GTID_DOMAIN
source: "Could not delete gtid domain. Reason: %s."
spa: "No pude borrar el dominio gtid. Motivo: %s."

# ER_NORMAL_SHUTDOWN
source: "%s (initiated by: %s): Normal shutdown"
spa: "%s (iniciado por: %s): Apagado normal"

# ER_GOT_SIGNAL
source: "%s: Got signal %d. Aborting!\n"
spa: "%s: Obtenida señal %d. ¡Abortando!\n"

# ER_SHUTDOWN_COMPLETE
source: "%s: Shutdown complete\n"
spa: "%s: Apagado completado\n"

# ER_FORCING_CLOSE 08S01
source: "%s: Forcing close of thread %ld user: '%-.48s'\n"
spa: "%s: Forzando a cerrar el hilo (thread) %ld usuario: '%-.48s'\n"

# ER_IPSOCK_ERROR 08S01
source: "Can't create IP socket"
spa: "No puedo crear IP socket"

# ER_NO_SUCH_INDEX 42S12 S1009
source: "Table '%-.192s' has no index like the one used in CREATE INDEX; recreate the table"
spa: "La tabla '%-.192s' no tiene un índice como el usado en CREATE INDEX. Crea de nuevo la tabla"

# ER_WRONG_FIELD_TERMINATORS 42000 S1009
source: "Field separator argument is not what is expected; check the manual"
spa: "Los separadores de argumentos del campo no son los especificados. Compruebe el manual"

# ER_BLOBS_AND_NO_TERMINATED 42000 S1009
source: "You can't use fixed rowlength with BLOBs; please use 'fields terminated by'"
spa: "No se pueden usar longitudes fijas de filas con BLOBs. Por favor, use 'campos terminados por'"

# ER_TEXTFILE_NOT_READABLE
source: "The file '%-.128s' must be in the database directory or be readable by all"
spa: "El fichero/archivo '%-.128s' debe de estar en el directorio de la base de datos o debe de ser legible por todos"

# ER_FILE_EXISTS_ERROR
source: "File '%-.200s' already exists"
spa: "El fichero/archivo '%-.200s' ya existe"

# ER_LOAD_INFO
source: "Records: %ld Deleted: %ld Skipped: %ld Warnings: %ld"
spa: "Registros: %ld Borrados: %ld Saltados: %ld Avisos: %ld"

# ER_ALTER_INFO
source: "Records: %ld Duplicates: %ld"
spa: "Registros: %ld Duplicados: %ld"

# ER_WRONG_SUB_KEY
source: "Incorrect prefix key; the used key part isn't a string, the used length is longer than the key part, or the storage engine doesn't support unique prefix keys"
spa: "Prefijo incorrecto de clave; la parte utilizada de la clave no es una cadena, la longitud usada es mayor que la parte de la clave o el motor de almacenaje no soporta claves con prefijo único"

# ER_CANT_REMOVE_ALL_FIELDS 42000
source: "You can't delete all columns with ALTER TABLE; use DROP TABLE instead"
spa: "No se pueden borrar todas las columnas con ALTER TABLE. Use DROP TABLE para hacerlo"

# ER_CANT_DROP_FIELD_OR_KEY 42000
source: "Can't DROP %s %`-.192s; check that it exists"
spa: "No puedo eliminar %s %`-.192s; compruebe que ya existe"

# ER_INSERT_INFO
source: "Records: %ld Duplicates: %ld Warnings: %ld"
spa: "Registros: %ld Duplicados: %ld Avisos: %ld"

# ER_NO_SUCH_THREAD
source: "Unknown thread id: %lu"
spa: "Identificador del hilo (thread): %lu desconocido"

# ER_KILL_DENIED_ERROR
source: "You are not owner of thread %lld"
spa: "No eres el propietario del hilo (thread) %lld"

# ER_NO_TABLES_USED
source: "No tables used"
spa: "No se están usando tablas"

# ER_TOO_BIG_SET
source: "Too many strings for column %-.192s and SET"
spa: "Demasiadas cadenas para la columna %-.192s y SET"

# ER_NO_UNIQUE_LOGFILE
source: "Can't generate a unique log-filename %-.200s.(1-999)\n"
spa: "No puedo generar un único fichero/archivo de historial (log) llamado %-.200s.(1-999)\n"

# ER_TABLE_NOT_LOCKED_FOR_WRITE
source: "Table '%-.192s' was locked with a READ lock and can't be updated"
spa: "La tabla '%-.192s' ha sido bloqueada con un READ lock y no puede ser actualizada"

# ER_TABLE_NOT_LOCKED
source: "Table '%-.192s' was not locked with LOCK TABLES"
spa: "La tabla '%-.192s' no fue bloqueada con LOCK TABLES"

# ER_UNUSED_17
source: "You should never see it"
spa: "Nunca debería vd de ver esto"

# ER_WRONG_DB_NAME 42000
source: "Incorrect database name '%-.100T'"
spa: "Nombre incorrecto de base de datos '%-.100T'"

# ER_WRONG_TABLE_NAME 42000
source: "Incorrect table name '%-.100s'"
spa: "Nombre incorrecto de tabla '%-.100s'"

# ER_TOO_BIG_SELECT 42000
source: "The SELECT would examine more than MAX_JOIN_SIZE rows; check your WHERE and use SET SQL_BIG_SELECTS=1 or SET MAX_JOIN_SIZE=# if the SELECT is okay"
spa: "El SELECT debería de examinar más de MAX_JOIN_SIZE filas; revise su WHERE y utilice SET SQL_BIG_SELECTS=1 o SET MAX_JOIN_SIZE=# si el SELECT está ok"

# ER_UNKNOWN_ERROR
source: "Unknown error"
spa: "Error desconocido"

# ER_UNKNOWN_PROCEDURE 42000
source: "Unknown procedure '%-.192s'"
spa: "Procedimiento desconocido %-.192s"

# ER_WRONG_PARAMCOUNT_TO_PROCEDURE 42000
source: "Incorrect parameter count to procedure '%-.192s'"
spa: "Contador de parámetros incorrecto para procedimiento %-.192s"

# ER_WRONG_PARAMETERS_TO_PROCEDURE
source: "Incorrect parameters to procedure '%-.192s'"
spa: "Parámetros incorrectos para procedimiento %-.192s"

# ER_UNKNOWN_TABLE 42S02
source: "Unknown table '%-.192s' in %-.32s"
spa: "Tabla desconocida '%-.192s' en %-.32s"

# ER_FIELD_SPECIFIED_TWICE 42000
source: "Column '%-.192s' specified twice"
spa: "Columna '%-.192s' especificada dos veces"

# ER_INVALID_GROUP_FUNC_USE
source: "Invalid use of group function"
spa: "Inválido uso de función de grupo"

# ER_UNSUPPORTED_EXTENSION 42000
source: "Table '%-.192s' uses an extension that doesn't exist in this MariaDB version"
spa: "La tabla '%-.192s' usa una extensión que no existe en esta versión de MariaDB"

# ER_TABLE_MUST_HAVE_COLUMNS 42000
source: "A table must have at least 1 column"
spa: "Una tabla debe de tener al menos 1 columna"

# ER_RECORD_FILE_FULL
source: "The table '%-.192s' is full"
spa: "La tabla '%-.192s' está llena"

# ER_UNKNOWN_CHARACTER_SET 42000
source: "Unknown character set: '%-.64s'"
spa: "Juego desconocido de caracteres: '%-.64s'"

# ER_TOO_MANY_TABLES
source: "Too many tables; MariaDB can only use %d tables in a join"
spa: "Demasiadas tablas. MariaDB solamente puede usar %d tablas en un join"

# ER_TOO_MANY_FIELDS
source: "Too many columns"
spa: "Demasiadas columnas"

# ER_TOO_BIG_ROWSIZE 42000
source: "Row size too large. The maximum row size for the used table type, not counting BLOBs, is %ld. This includes storage overhead, check the manual. You have to change some columns to TEXT or BLOBs"
spa: "Tamaño de fila muy grande. El máximo tamaño de fila para el tipo de tabla usada, sin contar BLOBs, es de %ld. Esto incluye sobrecarga de almacenaje, revise el manual. Tiene que cambiar algunas columnas a TEXT o BLOBs"

# ER_STACK_OVERRUN
source: "Thread stack overrun: Used: %ld of a %ld stack. Use 'mariadbd --thread_stack=#' to specify a bigger stack if needed"
spa: "Desbordamiento de la pila de hilos (threads): Usado: %ld de una pila de %ld. Considere el incrementar la variable de sistema thread_stack"

# ER_WRONG_OUTER_JOIN 42000
source: "Cross dependency found in OUTER JOIN; examine your ON conditions"
spa: "Dependencia cruzada hallada en OUTER JOIN. Examina tus condiciones ON"

# ER_NULL_COLUMN_IN_INDEX 42000
source: "Table handler doesn't support NULL in given index. Please change column '%-.192s' to be NOT NULL or use another handler"
spa: "El manejador de tabla no soporta NULL en índice suministrado. Por favor, cambie la columna '%-.192s' para que sea NOT NULL o utilice otro manejador"

# ER_CANT_FIND_UDF
source: "Can't load function '%-.192s'"
spa: "No puedo cargar la función '%-.192s'"

# ER_CANT_INITIALIZE_UDF
source: "Can't initialize function '%-.192s'; %-.80s"
spa: "No puedo inicializar la función '%-.192s'; %-.80s"

# ER_UDF_NO_PATHS
source: "No paths allowed for shared library"
spa: "No existen rutas autorizadas para biblioteca compartida"

# ER_UDF_EXISTS
source: "Function '%-.192s' already exists"
spa: "La función '%-.192s' ya existe"

# ER_CANT_OPEN_LIBRARY
source: "Can't open shared library '%-.192s' (errno: %d, %-.128s)"
spa: "No puedo abrir la biblioteca compartida '%-.192s' (error: %d, %-.128s)"

# ER_CANT_FIND_DL_ENTRY
source: "Can't find symbol '%-.128s' in library"
spa: "No puedo encontrar el símbolo '%-.128s' en biblioteca"

# ER_FUNCTION_NOT_DEFINED
source: "Function '%-.192s' is not defined"
spa: "La función '%-.192s' no está definida"

# ER_HOST_IS_BLOCKED
source: "Host '%-.64s' is blocked because of many connection errors; unblock with 'mariadb-admin flush-hosts'"
spa: "El equipo '%-.64s' está bloqueado debido a muchos errores de conexión; desbloquea con 'mariadb-admin flush-hosts'"

# ER_HOST_NOT_PRIVILEGED
source: "Host '%-.64s' is not allowed to connect to this MariaDB server"
spa: "El equipo '%-.64s' no está autorizado a conectar con este servidor MariaDB"

# ER_PASSWORD_ANONYMOUS_USER 42000
source: "You are using MariaDB as an anonymous user and anonymous users are not allowed to modify user settings"
spa: "Está usando MariaDB como un usuario anónimo y lo usuarios anónimos no tienen permiso para cambiar las propiedades de usuario"

# ER_PASSWORD_NOT_ALLOWED 42000
source: "You must have privileges to update tables in the mysql database to be able to change passwords for others"
spa: "Vd debe de tener privilegios para actualizar tablas en la base de datos mysql para poder cambiar las contraseñas de otros"

# ER_PASSWORD_NO_MATCH 28000
source: "Can't find any matching row in the user table"
spa: "No puedo encontrar una fila coincidente en la tabla de usuario"

# ER_UPDATE_INFO
source: "Rows matched: %ld Changed: %ld Warnings: %ld"
spa: "Líneas coincidentes: %ld Cambiadas: %ld Avisos: %ld"

# ER_CANT_CREATE_THREAD
source: "Can't create a new thread (errno %M); if you are not out of available memory, you can consult the manual for a possible OS-dependent bug"
spa: "No puedo crear un nuevo hilo (thread) (error %M). Si no está falto de memoria disponible, vd puede consultar el manual para un posible error dependiente del SO"

# ER_WRONG_VALUE_COUNT_ON_ROW 21S01
source: "Column count doesn't match value count at row %lu"
spa: "El número de columnas no se corresponde con el número de valores en la línea %lu"

# ER_CANT_REOPEN_TABLE
source: "Can't reopen table: '%-.192s'"
spa: "No puedo reabrir la tabla: '%-.192s"

# ER_INVALID_USE_OF_NULL 22004
source: "Invalid use of NULL value"
spa: "Uso inválido del valor NULL"

# ER_REGEXP_ERROR 42000
source: "Regex error '%s'"
spa: "Obtenido error '%s' de regexp"

# ER_MIX_OF_GROUP_FUNC_AND_FIELDS 42000
source: "Mixing of GROUP columns (MIN(),MAX(),COUNT(),...) with no GROUP columns is illegal if there is no GROUP BY clause"
spa: "La mezcla de columnas GROUP (MIN(),MAX(),COUNT()...) con columnas no GROUP es ilegal si no exite la cláusula GROUP BY"

# ER_NONEXISTING_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s'"
spa: "No existe tal concesión (grant) definida para usuario '%-.48s' en el equipo '%-.64s'"

# ER_TABLEACCESS_DENIED_ERROR 42000
source: "%-.100T command denied to user '%s'@'%s' for table '%-.192s'"
spa: "%-.100T comando denegado a usuario '%s'@'%s' para la tabla '%-.192s'"

# ER_COLUMNACCESS_DENIED_ERROR 42000
source: "%-.32s command denied to user '%s'@'%s' for column '%-.192s' in table '%-.192s'"
spa: "%-.32s comando denegado a el usuario '%s'@'%s' para la columna '%-.192s' en la tabla '%-.192s'"

# ER_ILLEGAL_GRANT_FOR_TABLE 42000
source: "Illegal GRANT/REVOKE command; please consult the manual to see which privileges can be used"
spa: "Comando GRANT/REVOKE ilegal; por favor, consulte el manual para ver los permisos que se pueden usar"

# ER_GRANT_WRONG_HOST_OR_USER 42000
source: "The host or user argument to GRANT is too long"
spa: "El argumento de GRANT para el equipo o usuario es demasiado grande"

# ER_NO_SUCH_TABLE 42S02
source: "Table '%-.192s.%-.192s' doesn't exist"
spa: "La tabla '%-.192s.%-.192s' no existe"

# ER_NONEXISTING_TABLE_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s' on table '%-.192s'"
spa: "No existe tal concesión (grant) definida para el usuario '%-.48s' en el equipo '%-.64s' en la tabla '%-.192s'"

# ER_NOT_ALLOWED_COMMAND 42000
source: "The used command is not allowed with this MariaDB version"
spa: "El comando usado no está permitido con esta versión de MariaDB"

# ER_SYNTAX_ERROR 42000
source: "You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use"
spa: "Existe un error en su sintaxis SQL; revise el manual que se corresponde con su versión del servidor MariaDB para averiguar la sintaxis correcta a utilizar"

# ER_DELAYED_CANT_CHANGE_LOCK
source: "Delayed insert thread couldn't get requested lock for table %-.192s"
spa: "El hilo (thread) de inserción retardada no pudo obtener bloqueo requerido para la tabla %-.192s"

# ER_TOO_MANY_DELAYED_THREADS
source: "Too many delayed threads in use"
spa: "Demasiados hilos (threads) retardados en uso"

# ER_ABORTING_CONNECTION 08S01
source: "Aborted connection %ld to db: '%-.192s' user: '%-.48s' (%-.64s)"
spa: "Conexión %ld abortada para la base de datos: '%-.192s' usuario: '%-.48s' (%-.64s)"

# ER_NET_PACKET_TOO_LARGE 08S01
source: "Got a packet bigger than 'max_allowed_packet' bytes"
spa: "Obtenido un paquete mayor de 'max_allowed_packet' bytes"

# ER_NET_READ_ERROR_FROM_PIPE 08S01
source: "Got a read error from the connection pipe"
spa: "Obtenido un error de lectura desde la tubería de la conexión"

# ER_NET_FCNTL_ERROR 08S01
source: "Got an error from fcntl()"
spa: "Obtenido un error de fcntl()"

# ER_NET_PACKETS_OUT_OF_ORDER 08S01
source: "Got packets out of order"
spa: "Obtenidos paquetes desordenados"

# ER_NET_UNCOMPRESS_ERROR 08S01
source: "Couldn't uncompress communication packet"
spa: "No pude descomprimir paquete de comunicación"

# ER_NET_READ_ERROR 08S01
source: "Got an error reading communication packets"
spa: "Obtenido un error leyendo paquetes de comunicación"
