Repository: vladbogo/test-translation
Catalog: spa.xlf
Languages: spa

# ER_SLAVE_HEARTBEAT_VALUE_OUT_OF_RANGE_MIN
source: "The requested value for the heartbeat period is less than 1 millisecond. The value is reset to 0, meaning that heartbeating will effectively be disabled"
spa: "El valor de requerimiento para el período de latido es menor de 1 milisegundo. El valor se vuelve a poner a 0, indicando que el latido será efectivamente desactivado"

# ER_SLAVE_HEARTBEAT_VALUE_OUT_OF_RANGE_MAX
source: "The requested value for the heartbeat period exceeds the value of `slave_net_timeout' seconds. A sensible value for the period should be less than the timeout"
spa: "El valor de requerimiento para el período de latido excede el valor de `slave_net_timeout` segundos. Un valor sensible para el período debería de ser menor que el 'tiempo agotado'"

# ER_STMT_CACHE_FULL
source: "Multi-row statements required more than 'max_binlog_stmt_cache_size' bytes of storage."
spa: "Las sentencias Multi-fila requieren de más de 'max_binlog_stmt_cache_size' bytes para almacenaje."

# ER_MULTI_UPDATE_KEY_CONFLICT
source: "Primary key/partition key update is not allowed since the table is updated both as '%-.192s' and '%-.192s'"
spa: "La actualización de clave primaria de o de partición no está permitida por estar la tabla actualizada como '%-.192s' y '%-.192s'"

# ER_TABLE_NEEDS_REBUILD
source: "Table rebuild required. Please do \"ALTER TABLE %`s FORCE\" or dump/reload to fix it!"
spa: "Se requiere reconstrucción de la tabla. Por favor, ¡haga un \"ALTER TABLE %`s FORCE\" o volcado/recarga para solucionarlo!"

# WARN_OPTION_BELOW_LIMIT
source: "The value of '%s' should be no less than the value of '%s'"
spa: "El valor de '%s' debería de ser no menor que el valor de '%s'"

# ER_INDEX_COLUMN_TOO_LONG
source: "Index column size too large. The maximum column size is %lu bytes"
spa: "El tamaño de índice de columna es demasiado grande. El tamaño máximo de columna es de %lu bytes"

# ER_ERROR_IN_TRIGGER_BODY
source: "Trigger '%-.64s' has an error in its body: '%-.256s'"
spa: "El disparador '%-.64s' tiene una error en su cuerpo: '%-.256s'"

# ER_ERROR_IN_UNKNOWN_TRIGGER_BODY
source: "Unknown trigger has an error in its body: '%-.256s'"
spa: "El disparador desconocido tiene un error en su cuerpo: '%-.256s'"

# ER_INDEX_CORRUPT
source: "Index %s is corrupted"
spa: "El índice %s está estropeado"

# ER_UNDO_RECORD_TOO_BIG
source: "Undo log record is too big"
spa: "El registro de historial (log) para deshacer es demasiado grande"

# ER_BINLOG_UNSAFE_INSERT_IGNORE_SELECT
source: "INSERT IGNORE... SELECT is unsafe because the order in which rows are retrieved by the SELECT determines which (if any) rows are ignored. This order cannot be predicted and may differ on master and the slave"
spa: "INSERT IGNORE... SELECT es no seguro porque el orden en el que las filas se recuperan por el SELECT determina qué filas (si hay alguna) son ignoradas. Este orden no puede ser predicho y puede diferir entre maestro (master) y esclavo"

# ER_BINLOG_UNSAFE_INSERT_SELECT_UPDATE
source: "INSERT... SELECT... ON DUPLICATE KEY UPDATE is unsafe because the order in which rows are retrieved by the SELECT determines which (if any) rows are updated. This order cannot be predicted and may differ on master and the slave"
spa: "INSERT... SELECT... ON DUPLICATE KEY UPDATE no es seguro porque el orden en el que las filas se recuperan por el SELECT determina qué filas (si hay alguna) son actualizadas. Este orden no puede ser predicho y puede diferir entre maestro (master) y esclavo"

# ER_BINLOG_UNSAFE_REPLACE_SELECT
source: "REPLACE... SELECT is unsafe because the order in which rows are retrieved by the SELECT determines which (if any) rows are replaced. This order cannot be predicted and may differ on master and the slave"
spa: "REPLACE... SELECT no es seguro porque el orden en el que las filas se recuperan por el SELECT determina qué filas (si hay alguna) son sustituidas. Este orden no puede ser predicho y puede diferir entre maestro (master) y esclavo"

# ER_BINLOG_UNSAFE_CREATE_IGNORE_SELECT
source: "CREATE... IGNORE SELECT is unsafe because the order in which rows are retrieved by the SELECT determines which (if any) rows are ignored. This order cannot be predicted and may differ on master and the slave"
spa: "CREATE... IGNORE SELECT no es seguro porque el orden en el que las filas se recuperan por el SELECT determina qué filas (si hay alguna) son ignoradas. Este orden no puede ser predicho y puede diferir entre maestro (master) y esclavo"

# ER_BINLOG_UNSAFE_CREATE_REPLACE_SELECT
source: "CREATE... REPLACE SELECT is unsafe because the order in which rows are retrieved by the SELECT determines which (if any) rows are replaced. This order cannot be predicted and may differ on master and the slave"
spa: "CREATE... REPLACE SELECT no es seguro porque el orden en el que las filas se recuperan por el SELECT determina qué filas (si hay alguna) son sustituidas. Este orden no puede ser predicho y puede diferir entre maestro (master) y esclavo"

# ER_BINLOG_UNSAFE_UPDATE_IGNORE
source: "UPDATE IGNORE is unsafe because the order in which rows are updated determines which (if any) rows are ignored. This order cannot be predicted and may differ on master and the slave"
spa: "UPDATE IGNORE no es seguro porque el orden en el que las filas son actualizadas determina qué filas (si hay alguna) son ignoradas. Este orden no puede ser predicho y puede diferir entre maestro (master) y esclavo"

# ER_UNUSED_15
source: "You should never see it"
spa: "Nunca debería vd de ver esto"

# ER_UNUSED_16
source: "You should never see it"
spa: "Nunca debería vd de ver esto"

# ER_BINLOG_UNSAFE_WRITE_AUTOINC_SELECT
source: "Statements writing to a table with an auto-increment column after selecting from another table are unsafe because the order in which rows are retrieved determines what (if any) rows will be written. This order cannot be predicted and may differ on master and the slave"
spa: "Las sentencias que graban en una tabla con columna de auto-incremento tras seleccionar desde otra tabla no son seguras porque el orden en el que las filas son recuperadas determina qué filas (si hay alguna) serán grabadas. Este orden no puede ser predicho y puede diferir entre maestro (master) y esclavo"

# ER_BINLOG_UNSAFE_CREATE_SELECT_AUTOINC
source: "CREATE TABLE... SELECT... on a table with an auto-increment column is unsafe because the order in which rows are retrieved by the SELECT determines which (if any) rows are inserted. This order cannot be predicted and may differ on master and the slave"
spa: "CREATE TABLE... SELECT... en una tabla con columna de auto-incremento no es segura porque el orden en el que las filas son recuperadas por el SELECT determina qué filas (si hay alguna) serán insertadas. Este orden no puede ser predicho y puede diferir entre maestro (master) y esclavo"

# ER_BINLOG_UNSAFE_INSERT_TWO_KEYS
source: "INSERT... ON DUPLICATE KEY UPDATE on a table with more than one UNIQUE KEY is unsafe"
spa: "INSERT... ON DUPLICATE KEY UPDATE en una tabla con más de una UNIQUE KEY no es segura"

# ER_UNUSED_28
source: "You should never see it"
spa: "Nunca debería vd de ver esto"

# ER_BINLOG_UNSAFE_AUTOINC_NOT_FIRST
source: "INSERT into autoincrement field which is not the first part in the composed primary key is unsafe"
spa: "INSERT dentro de campo con autoincremento que no es la primera parte en la clave primaria compuesta no es seguro"

# ER_CANNOT_LOAD_FROM_TABLE_V2
source: "Cannot load from %s.%s. The table is probably corrupted"
spa: "No puedo cargar desde %s.%s. La tabla está probablemente estropeada"

# ER_MASTER_DELAY_VALUE_OUT_OF_RANGE
source: "The requested value %lu for the master delay exceeds the maximum %lu"
spa: "El valor requerido %lu para retraso en maestro (master) excede el máximo de %lu"

# ER_ONLY_FD_AND_RBR_EVENTS_ALLOWED_IN_BINLOG_STATEMENT
source: "Only Format_description_log_event and row events are allowed in BINLOG statements (but %s was provided)"
spa: "Sólo se permiten Format_description_log_event y eventos de fila en sentencias BINLOG (pero %s fue suministrado)"

# ER_PARTITION_EXCHANGE_DIFFERENT_OPTION
source: "Non matching attribute '%-.64s' between partition and table"
spa: "Atributo no coincidente '%-.64s' entre la partición y la tabla"

# ER_PARTITION_EXCHANGE_PART_TABLE
source: "Table to exchange with partition is partitioned: '%-.64s'"
spa: "La tabla para intercambiar con la partición está particionada: '%-.64s'"

# ER_PARTITION_EXCHANGE_TEMP_TABLE
source: "Table to exchange with partition is temporary: '%-.64s'"
spa: "La tabla para intercambiar con la partición es temporal: '%-.64s'"

# ER_PARTITION_INSTEAD_OF_SUBPARTITION
source: "Subpartitioned table, use subpartition instead of partition"
spa: "La tabla subparticionada utiliza subpartición en lugar de partición"

# ER_UNKNOWN_PARTITION
source: "Unknown partition '%-.64s' in table '%-.64s'"
spa: "Partición desconocida '%-.64s' en la tabla '%-.64s'"

# ER_TABLES_DIFFERENT_METADATA
source: "Tables have different definitions"
spa: "Las tablas tienen diferentes definiciones"

# ER_ROW_DOES_NOT_MATCH_PARTITION
source: "Found a row that does not match the partition"
spa: "Hallada una fila que no coincide con la partición"

# ER_BINLOG_CACHE_SIZE_GREATER_THAN_MAX
source: "Option binlog_cache_size (%lu) is greater than max_binlog_cache_size (%lu); setting binlog_cache_size equal to max_binlog_cache_size"
spa: "La opción binlog_cache_size (%lu) es mayor que max_binlog_cache_size (%lu); configurando binlog_cache_size igual a max_binlog_cache_size"

# ER_WARN_INDEX_NOT_APPLICABLE
source: "Cannot use %-.64s access on index '%-.64s' due to type or collation conversion on field '%-.64s'"
spa: "No puedo usar acceso %-.64s en índice '%-.64s' debido al tipo o conversión de cotejo en campo '%-.64s'"

# ER_PARTITION_EXCHANGE_FOREIGN_KEY
source: "Table to exchange with partition has foreign key references: '%-.64s'"
spa: "La tabla para intercambiar con la partición tiene referencias a clave foránea: '%-.64s'"

# ER_NO_SUCH_KEY_VALUE
source: "Key value '%-.192s' was not found in table '%-.192s.%-.192s'"
spa: "Valor de clave '%-.192s' no hallado en la tabla '%-.192s.%-.192s'"

# ER_VALUE_TOO_LONG
source: "Too long value for '%s'"
spa: "Valor demasiado largo para '%s'"

# ER_NETWORK_READ_EVENT_CHECKSUM_FAILURE
source: "Replication event checksum verification failed while reading from network"
spa: "Ha fallado la verificación de la suma de revisión de evento de réplica mientras se leía desde la red"

# ER_BINLOG_READ_EVENT_CHECKSUM_FAILURE
source: "Replication event checksum verification failed while reading from a log file"
spa: "Ha fallado la verificación de la suma de revisión de evento de réplica mientras se leía desde fichero/archivo de historial (log)"

# ER_BINLOG_STMT_CACHE_SIZE_GREATER_THAN_MAX
source: "Option binlog_stmt_cache_size (%lu) is greater than max_binlog_stmt_cache_size (%lu); setting binlog_stmt_cache_size equal to max_binlog_stmt_cache_size"
spa: "La opción binlog_stmt_cache_size (%lu) es mayor que max_binlog_stmt_cache_size (%lu); configurando binlog_stmt_cache_size igual a max_binlog_stmt_cache_size"

# ER_CANT_UPDATE_TABLE_IN_CREATE_TABLE_SELECT
source: "Can't update table '%-.192s' while '%-.192s' is being created"
spa: "No puedo actualizar tabla '%-.192s' mientras '%-.192s' está siendo creada"

# ER_PARTITION_CLAUSE_ON_NONPARTITIONED
source: "PARTITION () clause on non partitioned table"
spa: "Cláusula PARTITION () en tabla no particionada"

# ER_ROW_DOES_NOT_MATCH_GIVEN_PARTITION_SET
source: "Found a row not matching the given partition set"
spa: "Hallada una fila que no coincide con el conjunto dado de partición"

# ER_UNUSED_5
source: "You should never see it"
spa: "Nunca debería vd de ver esto"

# ER_CHANGE_RPL_INFO_REPOSITORY_FAILURE
source: "Failure while changing the type of replication repository: %s"
spa: "Fallo mientras cambiaba el tipo de repositorio de réplica: %s"

# ER_WARNING_NOT_COMPLETE_ROLLBACK_WITH_CREATED_TEMP_TABLE
source: "The creation of some temporary tables could not be rolled back"
spa: "La creación de algunas tablas temporales no se pudo retroceder (ROLLBACK)"

# ER_WARNING_NOT_COMPLETE_ROLLBACK_WITH_DROPPED_TEMP_TABLE
source: "Some temporary tables were dropped, but these operations could not be rolled back"
spa: "Algunas tablas temporales fueron eliminadas, pero estas operaciones no se pudieron retroceder (ROLLBACK)"

# ER_MTS_FEATURE_IS_NOT_SUPPORTED
source: "%s is not supported in multi-threaded slave mode. %s"
spa: "%s no se soporta en modo esclavo multi-hilo (thread). %s"

# ER_MTS_UPDATED_DBS_GREATER_MAX
source: "The number of modified databases exceeds the maximum %d; the database names will not be included in the replication event metadata"
spa: "El núermo de bases de datos modificadas excede el máximo de %d; los nombres de base de datos no serán incluidos en los metadatos de eventos de réplica"

# ER_MTS_CANT_PARALLEL
source: "Cannot execute the current event group in the parallel mode. Encountered event %s, relay-log name %s, position %s which prevents execution of this event group in parallel mode. Reason: %s"
spa: "No puedo ejecutar el grupo de eventos actual en modo paralelo. Encontrado evento %s, nombre de historial (log) de reenvío %s, posición %s que previene la ejecución de este grupo de eventos en modo paralelo. Motivo: %s"

# ER_FULLTEXT_NOT_SUPPORTED_WITH_PARTITIONING
source: "FULLTEXT index is not supported for partitioned tables"
spa: "El índice FULLTEXT no está soportado para tablas particionadas"

# ER_DA_INVALID_CONDITION_NUMBER 35000
source: "Invalid condition number"
spa: "Número inválido de condición"

# ER_INSECURE_PLAIN_TEXT
source: "Sending passwords in plain text without SSL/TLS is extremely insecure"
spa: "Enviar contraseñas en texto plano sin SSL/TLS es extremadamente inseguro"

# ER_INSECURE_CHANGE_MASTER
source: "Storing MariaDB user name or password information in the master.info repository is not secure and is therefore not recommended. Please see the MariaDB Manual for more about this issue and possible alternatives"
spa: "Almacenar nombre de usuario de MariaDB o información de contraseña en el repositorio master.info no es seguro y por ello no se recomienda. Por favor, mira el manual de MariaDB para saber más acerca de este asunto y sus posibles alternativas"

# ER_FOREIGN_DUPLICATE_KEY_WITH_CHILD_INFO 23000 S1009
source: "Foreign key constraint for table '%.192s', record '%-.192s' would lead to a duplicate entry in table '%.192s', key '%.192s'"
spa: "La restricción de clave foránea para tabla '%.192s', registro '%-.192s' llevaría a una entrada duplicada en la tabla '%.192s', clave '%.192s'"

# ER_FOREIGN_DUPLICATE_KEY_WITHOUT_CHILD_INFO 23000 S1009
source: "Foreign key constraint for table '%.192s', record '%-.192s' would lead to a duplicate entry in a child table"
spa: "La restricción de clave foránea para tabla '%.192s', registro '%-.192s' llevaría a una entrada duplicada en una tabla hija"

# ER_SQLTHREAD_WITH_SECURE_SLAVE
source: "Setting authentication options is not possible when only the Slave SQL Thread is being started"
spa: "Configurar opciones de autenticación no es posible si sólo se ha arrancado el Hilo (thread) SQL Esclavo"

# ER_TABLE_HAS_NO_FT
source: "The table does not have FULLTEXT index to support this query"
spa: "La tabla no tiene índice FULLTEXT que soporte esta consulta (query)"

# ER_VARIABLE_NOT_SETTABLE_IN_SF_OR_TRIGGER
source: "The system variable %.200s cannot be set in stored functions or triggers"
spa: "La variable de sistema %.200s no se puede poner en funciones almacenadas o disparadores"

# ER_VARIABLE_NOT_SETTABLE_IN_TRANSACTION
source: "The system variable %.200s cannot be set when there is an ongoing transaction"
spa: "La variable de sistema %.200s no se puede poner si hay una transacción en curso"

# ER_GTID_NEXT_IS_NOT_IN_GTID_NEXT_LIST
source: "The system variable @@SESSION.GTID_NEXT has the value %.200s, which is not listed in @@SESSION.GTID_NEXT_LIST"
spa: "La variable de sistema @@SESSION.GTID_NEXT tiene el valor %.200s, el cual no está listado en @@SESSION.GTID_NEXT_LIST"

# ER_CANT_CHANGE_GTID_NEXT_IN_TRANSACTION_WHEN_GTID_NEXT_LIST_IS_NULL
source: "When @@SESSION.GTID_NEXT_LIST == NULL, the system variable @@SESSION.GTID_NEXT cannot change inside a transaction"
spa: "Cuando @@SESSION.GTID_NEXT_LIST == NULL, la variable de sistema @@SESSION.GTID_NEXT no puede cambiar dentro de una transacción"

# ER_SET_STATEMENT_CANNOT_INVOKE_FUNCTION
source: "The statement 'SET %.200s' cannot invoke a stored function"
spa: "La sentencia 'SET %.200s' no puede invocar una función almacenada"

# ER_GTID_NEXT_CANT_BE_AUTOMATIC_IF_GTID_NEXT_LIST_IS_NON_NULL
source: "The system variable @@SESSION.GTID_NEXT cannot be 'AUTOMATIC' when @@SESSION.GTID_NEXT_LIST is non-NULL"
spa: "La variable de sistema @@SESSION.GTID_NEXT no puede ser 'AUTOMATIC' si la @@SESSION.GTID_NEXT_LIST es no-NULL"

# ER_SKIPPING_LOGGED_TRANSACTION
source: "Skipping transaction %.200s because it has already been executed and logged"
spa: "Saltando transacción %.200s porque ya ha sido ejecutada y puesta en historial (log)"

# ER_MALFORMED_GTID_SET_SPECIFICATION
source: "Malformed GTID set specification '%.200s'"
spa: "GTID malformado pone especificación '%.200s'"

# ER_MALFORMED_GTID_SET_ENCODING
source: "Malformed GTID set encoding"
spa: "GTID malformado pone codificación"

# ER_MALFORMED_GTID_SPECIFICATION
source: "Malformed GTID specification '%.200s'"
spa: "GTID malformado especificación '%.200s'"

# ER_GNO_EXHAUSTED
source: "Impossible to generate Global Transaction Identifier: the integer component reached the maximal value. Restart the server with a new server_uuid"
spa: "Imposible generar Identificador Global de Transacción: el componente entero alcanzó el máximo valor. Rearranque el servidor con un nuevo server_uuid"

# ER_BAD_SLAVE_AUTO_POSITION
source: "Parameters MASTER_LOG_FILE, MASTER_LOG_POS, RELAY_LOG_FILE and RELAY_LOG_POS cannot be set when MASTER_AUTO_POSITION is active"
spa: "Los parámetros MASTER_LOG_FILE, MASTER_LOG_POS, RELAY_LOG_FILE y RELAY_LOG_POS no pueden ser puestos cuando MASTER_AUTO_POSITION esté activo"

# ER_AUTO_POSITION_REQUIRES_GTID_MODE_ON
source: "CHANGE MASTER TO MASTER_AUTO_POSITION = 1 can only be executed when GTID_MODE = ON"
spa: "CHANGE MASTER TO MASTER_AUTO_POSITION = 1 sólo se puede ejecutar cuando GTID_MODE = ON"

# ER_CANT_DO_IMPLICIT_COMMIT_IN_TRX_WHEN_GTID_NEXT_IS_SET
source: "Cannot execute statements with implicit commit inside a transaction when GTID_NEXT != AUTOMATIC or GTID_NEXT_LIST != NULL"
spa: "No puedo ejecutar sentencias con acometidas (commit) implícitas dentro de una transacción cuando GTID_NEXT != AUTOMATIC o GTID_NEXT_LIST != NULL"

# ER_GTID_MODE_2_OR_3_REQUIRES_ENFORCE_GTID_CONSISTENCY_ON
source: "GTID_MODE = ON or GTID_MODE = UPGRADE_STEP_2 requires ENFORCE_GTID_CONSISTENCY = 1"
spa: "GTID_MODE = ON o GTID_MODE = UPGRADE_STEP_2 requiere que ENFORCE_GTID_CONSISTENCY = 1"

# ER_GTID_MODE_REQUIRES_BINLOG
source: "GTID_MODE = ON or UPGRADE_STEP_1 or UPGRADE_STEP_2 requires --log-bin and --log-slave-updates"
spa: "GTID_MODE = ON o UPGRADE_STEP_1 o UPGRADE_STEP_2 requiere --log-bin y --log-slave-updates"

# ER_CANT_SET_GTID_NEXT_TO_GTID_WHEN_GTID_MODE_IS_OFF
source: "GTID_NEXT cannot be set to UUID:NUMBER when GTID_MODE = OFF"
spa: "GTID_NEXT no se puede poner a UUID:NUMBER cuando GTID_MODE = OFF"

# ER_CANT_SET_GTID_NEXT_TO_ANONYMOUS_WHEN_GTID_MODE_IS_ON
source: "GTID_NEXT cannot be set to ANONYMOUS when GTID_MODE = ON"
spa: "GTID_NEXT no se puede poner como ANONYMOUS cuando GTID_MODE = ON"

# ER_CANT_SET_GTID_NEXT_LIST_TO_NON_NULL_WHEN_GTID_MODE_IS_OFF
source: "GTID_NEXT_LIST cannot be set to a non-NULL value when GTID_MODE = OFF"
spa: "GTID_NEXT_LIST no se puede poner como valor no-NULL cuando GTID_MODE = OFF"

# ER_FOUND_GTID_EVENT_WHEN_GTID_MODE_IS_OFF
source: "Found a Gtid_log_event or Previous_gtids_log_event when GTID_MODE = OFF"
spa: "Hallado un Gtid_log_event o Previous_gtids_log_event cuando GTID_MODE = OFF"

# ER_GTID_UNSAFE_NON_TRANSACTIONAL_TABLE
source: "When ENFORCE_GTID_CONSISTENCY = 1, updates to non-transactional tables can only be done in either autocommitted statements or single-statement transactions, and never in the same statement as updates to transactional tables"
spa: "Cuando ENFORCE_GTID_CONSISTENCY = 1, las actualiaciones a tablas no transaccionales sólo se puede hacer o bien en sentencias autoacometidas o en transacciones de sentencias simples y nunca dentro de la misma sentencia como actualizaciones a tablas transaccionales"

# ER_GTID_UNSAFE_CREATE_SELECT
source: "CREATE TABLE ... SELECT is forbidden when ENFORCE_GTID_CONSISTENCY = 1"
spa: "CREATE TABLE ... SELECT está prohibido si ENFORCE_GTID_CONSISTENCY = 1"

# ER_GTID_UNSAFE_CREATE_DROP_TEMPORARY_TABLE_IN_TRANSACTION
source: "When ENFORCE_GTID_CONSISTENCY = 1, the statements CREATE TEMPORARY TABLE and DROP TEMPORARY TABLE can be executed in a non-transactional context only, and require that AUTOCOMMIT = 1"
spa: "Cuando ENFORCE_GTID_CONSISTENCY = 1, las sentencias CREATE TEMPORARY TABLE y DROP TEMPORARY TABLE pueden ser ejecutadas sólo en contextos no-transaccionales y requieren que AUTOCOMMIT = 1"

# ER_GTID_MODE_CAN_ONLY_CHANGE_ONE_STEP_AT_A_TIME
source: "The value of GTID_MODE can only change one step at a time: OFF <-> UPGRADE_STEP_1 <-> UPGRADE_STEP_2 <-> ON. Also note that this value must be stepped up or down simultaneously on all servers; see the Manual for instructions."
spa: "El valor de GTID_MODE sólo puede cambiar un paso a la vez: OFF <-> UPGRADE_STEP_1 <-> UPGRADE_STEP_2 <-> ON. También ten en cuenta que este valor debe de ser aumentado y disminuido simultaneamente en todos los servidores; mira el Manual para instrucciones."

# ER_MASTER_HAS_PURGED_REQUIRED_GTIDS
source: "The slave is connecting using CHANGE MASTER TO MASTER_AUTO_POSITION = 1, but the master has purged binary logs containing GTIDs that the slave requires"
spa: "El esclavo se está conectando usando CHANGE MASTER TO MASTER_AUTO_POSITION = 1, pero el maestro (master) ha purgado los historiales (logs) binarios que contienen GTIDs requeridos por el esclavo"

# ER_CANT_SET_GTID_NEXT_WHEN_OWNING_GTID
source: "GTID_NEXT cannot be changed by a client that owns a GTID. The client owns %s. Ownership is released on COMMIT or ROLLBACK"
spa: "GTID_NEXT no se puede cambiar por un cliente que posee un GTID. El cliente posee %s. La propiedad se libera con COMMIT o ROLLBACK"

# ER_UNKNOWN_EXPLAIN_FORMAT
source: "Unknown %s format name: '%s'"
spa: "Nombre de formato %s desconocido: '%s'"

# ER_CANT_EXECUTE_IN_READ_ONLY_TRANSACTION 25006
source: "Cannot execute statement in a READ ONLY transaction"
spa: "No puedo ejecutar sentencia en una transacción READ ONLY"

# ER_TOO_LONG_TABLE_PARTITION_COMMENT
source: "Comment for table partition '%-.64s' is too long (max = %lu)"
spa: "El comentario para partición de tabla '%-.64s' es demasido largo (máx = %lu)"

# ER_SLAVE_CONFIGURATION
source: "Slave is not configured or failed to initialize properly. You must at least set --server-id to enable either a master or a slave. Additional error messages can be found in the MariaDB error log"
spa: "El esclavo no está configurado o falló al inicializarse de forma adecuada. Vd debe de poner al menos --server-id para activar o bien un maestro (master) o un esclavo. Mensajes de error adicionales pueden ser hallados en historial (log) de errores de MariaDB"

# ER_INNODB_FT_LIMIT
source: "InnoDB presently supports one FULLTEXT index creation at a time"
spa: "Actualmente InnoDB soporta la creación de un índice FULLTEXT a la vez"

# ER_INNODB_NO_FT_TEMP_TABLE
source: "Cannot create FULLTEXT index on temporary InnoDB table"
spa: "No puedo crear índice FULLTEXT en tabla temporaria InnoDB"
