Repository: vladbogo/test-translation
Catalog: spa.xlf
Languages: spa

# ER_INNODB_FT_WRONG_DOCID_COLUMN
source: "Column '%-.192s' is of wrong type for an InnoDB FULLTEXT index"
spa: "La columna '%-.192s' es de tipo equivocado para un índice InnoDB FULLTEXT"

# ER_INNODB_FT_WRONG_DOCID_INDEX
source: "Index '%-.192s' is of wrong type for an InnoDB FULLTEXT index"
spa: "El índice '%-.192s' es de tipo equivocado para un índice InnoDB FULLTEXT"

# ER_INNODB_ONLINE_LOG_TOO_BIG
source: "Creating index '%-.192s' required more than 'innodb_online_alter_log_max_size' bytes of modification log. Please try again"
spa: "La creación de índice '%-.192s' requirió más de 'innodb_online_alter_log_max_size' bytes de historial (log) de modificaciones. Por favor, pruebe otra vez"

# ER_UNKNOWN_ALTER_ALGORITHM
source: "Unknown ALGORITHM '%s'"
spa: "ALGORITHM desconocido '%s'"

# ER_UNKNOWN_ALTER_LOCK
source: "Unknown LOCK type '%s'"
spa: "Tipo de LOCK desconocido '%s'"

# ER_MTS_CHANGE_MASTER_CANT_RUN_WITH_GAPS
source: "CHANGE MASTER cannot be executed when the slave was stopped with an error or killed in MTS mode. Consider using RESET SLAVE or START SLAVE UNTIL"
spa: "CHANGE MASTER no se puede ejecutar cuando se ha parado el esclavo con un error o matado en modo MTS. Considere el usar RESET SLAVE o START SLAVE UNTIL"

# ER_MTS_RECOVERY_FAILURE
source: "Cannot recover after SLAVE errored out in parallel execution mode. Additional error messages can be found in the MariaDB error log"
spa: "No puedo recuperar después de que SLAVE diera error en modo paralelo de ejecución. Mensajes de error adicionales se pueden hallar en el historial (log) de error de MariaDB"

# ER_MTS_RESET_WORKERS
source: "Cannot clean up worker info tables. Additional error messages can be found in the MariaDB error log"
spa: "No puedo limpiar tablas de información de trabajador. Mensajes de error adicionales se pueden hallar en el historial (log) de error de MariaDB"

# ER_COL_COUNT_DOESNT_MATCH_CORRUPTED_V2
source: "Column count of %s.%s is wrong. Expected %d, found %d. The table is probably corrupted"
spa: "El contador de columnas %s.%s está equivocado. Se esperaba %d, hallado %d. La tabla está probablemente estropeada"

# ER_SLAVE_SILENT_RETRY_TRANSACTION
source: "Slave must silently retry current transaction"
spa: "El esclavo debe de reintentar silenciosamente la transacción en curso"

# ER_UNUSED_22
source: "You should never see it"
spa: "Nunca debería vd de ver esto"

# ER_TABLE_SCHEMA_MISMATCH
source: "Schema mismatch (%s)"
spa: "Esquema no coincide (%s)"

# ER_TABLE_IN_SYSTEM_TABLESPACE
source: "Table %-.192s in system tablespace"
spa: "Tabla %-.192s en espacio de tablas del sitema"

# ER_IO_READ_ERROR
source: "IO Read error: (%lu, %s) %s"
spa: "Error de Lectura de E/S: (%lu, %s) %s"

# ER_IO_WRITE_ERROR
source: "IO Write error: (%lu, %s) %s"
spa: "Error de Escritura de E/S: (%lu, %s) %s"

# ER_TABLESPACE_MISSING
source: "Tablespace is missing for table '%-.192s'"
spa: "Espacio de tabla falta para la tabla '%-.192s'"

# ER_TABLESPACE_EXISTS
source: "Tablespace for table '%-.192s' exists. Please DISCARD the tablespace before IMPORT"
spa: "Existe Espacio de tabla para la tabla '%-.192s'. Por favor, haga DISCARD del espacio de tabla antes de hacer IMPORT"

# ER_TABLESPACE_DISCARDED
source: "Tablespace has been discarded for table %`s"
spa: "El espacio de tabla ha sido descartado para la tabla %`s"

# ER_INTERNAL_ERROR
source: "Internal error: %-.192s"
spa: "Error interno: %-.192s"

# ER_INNODB_IMPORT_ERROR
source: "ALTER TABLE '%-.192s' IMPORT TABLESPACE failed with error %lu : '%s'"
spa: "ALTER TABLE '%-.192s' IMPORT TABLESPACE ha fallado con error %lu : '%s'"

# ER_INNODB_INDEX_CORRUPT
source: "Index corrupt: %s"
spa: "Índice corrupto: %s"

# ER_INVALID_YEAR_COLUMN_LENGTH
source: "YEAR(%lu) column type is deprecated. Creating YEAR(4) column instead"
spa: "El tipo de columna YEAR(%lu) está obsoleto. Creando columna YEAR(4) en su lugar"

# ER_NOT_VALID_PASSWORD
source: "Your password does not satisfy the current policy requirements"
spa: "Su contraseña no satisface los requerimientos de la política en curso"

# ER_MUST_CHANGE_PASSWORD
source: "You must SET PASSWORD before executing this statement"
spa: "Debe vd de poner SET PASSWORD antes de ejecutar esta sentencia"

# ER_FK_NO_INDEX_CHILD
source: "Failed to add the foreign key constraint. Missing index for constraint '%s' in the foreign table '%s'"
spa: "No pude añadir la restricción de clave foránea. Falta índice para restricción '%s' en la tabla foránea '%s'"

# ER_FK_NO_INDEX_PARENT
source: "Failed to add the foreign key constraint. Missing index for constraint '%s' in the referenced table '%s'"
spa: "No pude añadir la restricción de clave foránea. Falta índice para restricción '%s' en la tabla referenciada '%s'"

# ER_FK_FAIL_ADD_SYSTEM
source: "Failed to add the foreign key constraint '%s' to system tables"
spa: "No pude añadir la restricción de clave foránea '%s' a las tablas del sistema"

# ER_FK_CANNOT_OPEN_PARENT
source: "Failed to open the referenced table '%s'"
spa: "No pude abrir la tabla referenciada '%s'"

# ER_FK_INCORRECT_OPTION
source: "Failed to add the foreign key constraint on table '%s'. Incorrect options in FOREIGN KEY constraint '%s'"
spa: "No pude añadir restricción de clave foránea en la tabla '%s'. Opciones incorrectas en restricción FOREIGN KEY '%s'"

# ER_DUP_CONSTRAINT_NAME
source: "Duplicate %s constraint name '%s'"
spa: "Duplicada restricción %s llamada '%s'"

# ER_PASSWORD_FORMAT
source: "The password hash doesn't have the expected format. Check if the correct password algorithm is being used with the PASSWORD() function"
spa: "El cálculo de contraseña no tiene el formato esperado. Revise si se está usando el algoritmo correcto de contraseña con la función PASSWORD()"

# ER_FK_COLUMN_CANNOT_DROP
source: "Cannot drop column '%-.192s': needed in a foreign key constraint '%-.192s'"
spa: "No puedo eliminar la columna '%-.192s': necesaria en restricción de clave foránea '%-.192s'"

# ER_FK_COLUMN_CANNOT_DROP_CHILD
source: "Cannot drop column '%-.192s': needed in a foreign key constraint '%-.192s' of table %-.192s"
spa: "No puedo eliminar la columna '%-.192s': necesaria en restriccón de clave foránea '%-.192s' de la tabla %-.192s"

# ER_FK_COLUMN_NOT_NULL
source: "Column '%-.192s' cannot be NOT NULL: needed in a foreign key constraint '%-.192s' SET NULL"
spa: "La columna '%-.192s' no puede ser NOT NULL: necesaria en restricción de clave foránea '%-.192s' SET NULL"

# ER_DUP_INDEX
source: "Duplicate index %`s. This is deprecated and will be disallowed in a future release"
spa: "Índice duplicado %`s. Éste está obsoleto y será quitado en entregas futuras"

# ER_FK_COLUMN_CANNOT_CHANGE
source: "Cannot change column '%-.192s': used in a foreign key constraint '%-.192s'"
spa: "No puedo cambiar la columna '%-.192s': usada en una restricción de clave foránea '%-.192s'"

# ER_FK_COLUMN_CANNOT_CHANGE_CHILD
source: "Cannot change column '%-.192s': used in a foreign key constraint '%-.192s' of table '%-.192s'"
spa: "No puedo cambiar la columna '%-.192s': usada en restricción de clave foránea '%-.192s' de la tabla '%-.192s'"

# ER_FK_CANNOT_DELETE_PARENT
source: "Cannot delete rows from table which is parent in a foreign key constraint '%-.192s' of table '%-.192s'"
spa: "No puedo borrar filas de la tabla que es padre en restricción de clave foránea '%-.192s' de la tabla '%-.192s'"

# ER_MALFORMED_PACKET
source: "Malformed communication packet"
spa: "Paquete de comunicación malformado"

# ER_READ_ONLY_MODE
source: "Running in read-only mode"
spa: "Ejecutando em modo sólo-lectura"

# ER_GTID_NEXT_TYPE_UNDEFINED_GROUP
source: "When GTID_NEXT is set to a GTID, you must explicitly set it again after a COMMIT or ROLLBACK. If you see this error message in the slave SQL thread, it means that a table in the current transaction is transactional on the master and non-transactional on the slave. In a client connection, it means that you executed SET GTID_NEXT before a transaction and forgot to set GTID_NEXT to a different identifier or to 'AUTOMATIC' after COMMIT or ROLLBACK. Current GTID_NEXT is '%s'"
spa: "Cuando GTID_NEXT se pone a GTID, debe vd de ponerlo de nuevo de forma explícita tras un COMMIT o ROLLBACK. Si vd ve este mensaje de error en el hilo (thread) de SQL esclavo, indica que una tabla de la transacción en curso es transaccional en el maestro (master) y no transaccional en el esclavo. En una conexión cliente, indica que has ejecutado SET GTID_NEXT antes de una transacción y has olvidado poner GTID_NEXT a un identificador diferente o a 'AUTOMATIC' tras COMMIT o ROLLBACK. El GTID_NEXT actual es '%s'"

# ER_VARIABLE_NOT_SETTABLE_IN_SP
source: "The system variable %.200s cannot be set in stored procedures"
spa: "La variable de sistema %.200s no se puede poner en procedimentos almacenados"

# ER_CANT_SET_GTID_PURGED_WHEN_GTID_MODE_IS_OFF
source: "GTID_PURGED can only be set when GTID_MODE = ON"
spa: "GTID_PURGED sólo se puede usar cuando GTID_MODE = ON"

# ER_CANT_SET_GTID_PURGED_WHEN_GTID_EXECUTED_IS_NOT_EMPTY
source: "GTID_PURGED can only be set when GTID_EXECUTED is empty"
spa: "GTID_PURGED sólo se puede poner cuando GTID_EXECUTED está vacío"

# ER_CANT_SET_GTID_PURGED_WHEN_OWNED_GTIDS_IS_NOT_EMPTY
source: "GTID_PURGED can only be set when there are no ongoing transactions (not even in other clients)"
spa: "GTID_PURGED sólo se puede poner cuando no hay trasacciones en curso (ni incluso en otros clientes)"

# ER_GTID_PURGED_WAS_CHANGED
source: "GTID_PURGED was changed from '%s' to '%s'"
spa: "GTID_PURGED se cambió de '%s' a '%s'"

# ER_GTID_EXECUTED_WAS_CHANGED
source: "GTID_EXECUTED was changed from '%s' to '%s'"
spa: "GTID_EXECUTED se cambió de '%s' a '%s'"

# ER_BINLOG_STMT_MODE_AND_NO_REPL_TABLES
source: "Cannot execute statement: impossible to write to binary log since BINLOG_FORMAT = STATEMENT, and both replicated and non replicated tables are written to"
spa: "No puedo ejecutar sentencia: imposible escribir en historial (log) binario desde BINLOG_FORMAT = STATEMENT y en tablas replicadas y no replicadas"

# ER_ALTER_OPERATION_NOT_SUPPORTED 0A000
source: "%s is not supported for this operation. Try %s"
spa: "%s no está soportado para esta operación. Pruebe %s"

# ER_ALTER_OPERATION_NOT_SUPPORTED_REASON 0A000
source: "%s is not supported. Reason: %s. Try %s"
spa: "%s no está soportado. Motivo: %s. Pruebe %s"

# ER_ALTER_OPERATION_NOT_SUPPORTED_REASON_COPY
source: "COPY algorithm requires a lock"
spa: "El algoritmo de COPY requiere de un bloqueo"

# ER_ALTER_OPERATION_NOT_SUPPORTED_REASON_PARTITION
source: "Partition specific operations do not yet support LOCK/ALGORITHM"
spa: "Las operaciones específicas de partición aún no soportan LOCK/ALGORITHM"

# ER_ALTER_OPERATION_NOT_SUPPORTED_REASON_FK_RENAME
source: "Columns participating in a foreign key are renamed"
spa: "Las columnas que participan en una clave foránea son renombradas"

# ER_ALTER_OPERATION_NOT_SUPPORTED_REASON_COLUMN_TYPE
source: "Cannot change column type"
spa: "No puedo cambiar el tipo de la columna"

# ER_ALTER_OPERATION_NOT_SUPPORTED_REASON_FK_CHECK
source: "Adding foreign keys needs foreign_key_checks=OFF"
spa: "El añadir claves foráneas necesita de foreign_key_checks=OFF"

# ER_ALTER_OPERATION_NOT_SUPPORTED_REASON_IGNORE
source: "Creating unique indexes with IGNORE requires COPY algorithm to remove duplicate rows"
spa: "El crear ídices únicos con IGNORE requiere del algoritmo COPY para quitar filas duplicadas"

# ER_ALTER_OPERATION_NOT_SUPPORTED_REASON_NOPK
source: "Dropping a primary key is not allowed without also adding a new primary key"
spa: "Eliminar una clave primaria no está permitido sin añadir también una nueva clave primaria"

# ER_ALTER_OPERATION_NOT_SUPPORTED_REASON_AUTOINC
source: "Adding an auto-increment column requires a lock"
spa: "Para añadir una columna auto-incrementable se requiere de un bloqueo"

# ER_ALTER_OPERATION_NOT_SUPPORTED_REASON_HIDDEN_FTS
source: "Cannot replace hidden FTS_DOC_ID with a user-visible one"
spa: "No puedo reemplazar FTS_DOC_ID oculta con una visible-por-usuario"

# ER_ALTER_OPERATION_NOT_SUPPORTED_REASON_CHANGE_FTS
source: "Cannot drop or rename FTS_DOC_ID"
spa: "No puedo eliminar o renombrar FTS_DOC_ID"

# ER_ALTER_OPERATION_NOT_SUPPORTED_REASON_FTS
source: "Fulltext index creation requires a lock"
spa: "La creación de un índice Fulltext requiere de un bloqueo"

# ER_SQL_SLAVE_SKIP_COUNTER_NOT_SETTABLE_IN_GTID_MODE
source: "sql_slave_skip_counter can not be set when the server is running with GTID_MODE = ON. Instead, for each transaction that you want to skip, generate an empty transaction with the same GTID as the transaction"
spa: "sql_slave_skip_counter no se puede poner cuando el servidor se ejecuta con GTID_MODE = ON. En su lugar, para cada transacción que desees saltar, genera una transacción vacía con el mismo GTID que la transacción"

# ER_DUP_UNKNOWN_IN_INDEX 23000
source: "Duplicate entry for key '%-.192s'"
spa: "Entrada duplicada para la clave '%-.192s'"

# ER_IDENT_CAUSES_TOO_LONG_PATH
source: "Long database name and identifier for object resulted in path length exceeding %d characters. Path: '%s'"
spa: "Nombre largo de base de datos e identificador para objeto resultó en que el tamaño de la ruta excedió de %d caracteres. Ruta: '%s'"

# ER_ALTER_OPERATION_NOT_SUPPORTED_REASON_NOT_NULL
source: "cannot convert NULL to non-constant DEFAULT"
spa: "no puedo convertir NULL a DEFAULT no-constante"

# ER_MUST_CHANGE_PASSWORD_LOGIN
source: "Your password has expired. To log in you must change it using a client that supports expired passwords"
spa: "Su contraseña ha expirado. Para ingresar, vd debe de cambiarla usando un cliente que soporte contraseñas expiradas"

# ER_ROW_IN_WRONG_PARTITION
source: "Found a row in wrong partition %s"
spa: "Hallada una fila en partición equivocada %s"

# ER_MTS_EVENT_BIGGER_PENDING_JOBS_SIZE_MAX
source: "Cannot schedule event %s, relay-log name %s, position %s to Worker thread because its size %lu exceeds %lu of slave_pending_jobs_size_max"
spa: "No puedo organizar evento %s, nombre de historial (log)-reenvío %s, posiciona %s a hilo (thread) de Trabajador porque su tamaño %lu excede %lu de slave_pending_jobs_size_max"

# ER_INNODB_NO_FT_USES_PARSER
source: "Cannot CREATE FULLTEXT INDEX WITH PARSER on InnoDB table"
spa: "No puedo CREATE FULLTEXT INDEX WITH PARSER en tabla InnoDB"

# ER_BINLOG_LOGICAL_CORRUPTION
source: "The binary log file '%s' is logically corrupted: %s"
spa: "El fichero/archivo de historial (log) binario '%s' está lógicamente corrupto: %s"

# ER_WARN_PURGE_LOG_IN_USE
source: "file %s was not purged because it was being read by %d thread(s), purged only %d out of %d files"
spa: "el fchero %s no se ha purgado porque estaba siendo leído por hilo(s) (thread) %d, purgado sólo %d de %d ficheros/archivos"

# ER_WARN_PURGE_LOG_IS_ACTIVE
source: "file %s was not purged because it is the active log file"
spa: "el fichero/archivo %s no fue purgado porque es el fichero/archivo activo de historial (log)"

# ER_AUTO_INCREMENT_CONFLICT
source: "Auto-increment value in UPDATE conflicts with internally generated values"
spa: "Valor de Auto-incremento en UPDATE está en conflicto con valores generados internamente"

# WARN_ON_BLOCKHOLE_IN_RBR
source: "Row events are not logged for %s statements that modify BLACKHOLE tables in row format. Table(s): '%-.192s'"
spa: "Los eventos de fila no son puestos en historial (log) para sentencias %s que modifican tablas BLACKHOLE en formato de fila. Tabla(s): '%-.192s'"

# ER_SLAVE_MI_INIT_REPOSITORY
source: "Slave failed to initialize master info structure from the repository"
spa: "El esclavo falló al inicializar información de estructura del maestro (master) desde el repositorio"

# ER_SLAVE_RLI_INIT_REPOSITORY
source: "Slave failed to initialize relay log info structure from the repository"
spa: "El esclavo falló al inicializar estructura de información de historial (log) de reenvío desde el repositorio"

# ER_ACCESS_DENIED_CHANGE_USER_ERROR 28000
source: "Access denied trying to change to user '%-.48s'@'%-.64s' (using password: %s). Disconnecting"
spa: "Acceso denegado intentando cambiar a usuario '%-.48s'@'%-.64s' (usando contraseña: %s). Desconectando"

# ER_INNODB_READ_ONLY
source: "InnoDB is in read only mode"
spa: "InnoDB está en modo de sólo lectura"

# ER_STOP_SLAVE_SQL_THREAD_TIMEOUT
source: "STOP SLAVE command execution is incomplete: Slave SQL thread got the stop signal, thread is busy, SQL thread will stop once the current task is complete"
spa: "La ejecución del comando STOP SLAVE está incompleta: El hilo (thread) de SQL esclavo recibió la señal de parada, hilo (thread) ocupado, el hilo (thread) SQL se parará una vez que se complete la tarea actual"

# ER_STOP_SLAVE_IO_THREAD_TIMEOUT
source: "STOP SLAVE command execution is incomplete: Slave IO thread got the stop signal, thread is busy, IO thread will stop once the current task is complete"
spa: "La ejecución del comando STOP SLAVE está incompleta: El hilo (thread) de E/S esclavo recibió la señal de parada, hilo (thread) ocupado, el hilo (thread) de E/S se parará una vez que se complete la tarea actual"

# ER_TABLE_CORRUPT
source: "Operation cannot be performed. The table '%-.64s.%-.64s' is missing, corrupt or contains bad data"
spa: "La operación no se puede realizar. Falta la tabla '%-.64s.%-.64s', está corrupta o contiene datos malos"

# ER_TEMP_FILE_WRITE_FAILURE
source: "Temporary file write failure"
spa: "Fallo al escribir fichero/archivo temporal"

# ER_INNODB_FT_AUX_NOT_HEX_ID
source: "Upgrade index name failed, please use create index(alter table) algorithm copy to rebuild index"
spa: "Falló la mejora de nombre de índice. Por favor, use una copia del algoritmo de create index(alter table) para reconstruir el índice"

# ER_GENERATED_COLUMN_FUNCTION_IS_NOT_ALLOWED
source: "Function or expression '%s' cannot be used in the %s clause of %`s"
spa: "La Función o expresión '%s' no se puede usar en la cláusula %s de %`s"

# ER_PRIMARY_KEY_BASED_ON_GENERATED_COLUMN
source: "Primary key cannot be defined upon a generated column"
spa: "La clave primaria no se puede definir sobre una columna generada"

# ER_KEY_BASED_ON_GENERATED_VIRTUAL_COLUMN
source: "Key/Index cannot be defined on a virtual generated column"
spa: "Key/Index no se puede definir en una columna virtual generada"

# ER_WRONG_FK_OPTION_FOR_GENERATED_COLUMN
source: "Cannot define foreign key with %s clause on a generated column"
spa: "No puedo definir clave foránea con cláusula %s en una columna generada"

# ER_WARNING_NON_DEFAULT_VALUE_FOR_GENERATED_COLUMN
source: "The value specified for generated column '%s' in table '%s' has been ignored"
spa: "El valor especificado para columna generada '%s' en la tabla '%s' ha sido ignorado"

# ER_UNSUPPORTED_ACTION_ON_GENERATED_COLUMN
source: "This is not yet supported for generated columns"
spa: "Esto no está aún soportado para columnas generadas"

# ER_UNSUPPORTED_ENGINE_FOR_GENERATED_COLUMNS
source: "%s storage engine does not support generated columns"
spa: "El motor de almacenaje %s no soporta columnas generadas"

# ER_UNKNOWN_OPTION
source: "Unknown option '%-.64s'"
spa: "Opción desconocida '%-.64s'"

# ER_BAD_OPTION_VALUE
source: "Incorrect value '%-.64T' for option '%-.64s'"
spa: "Valor incorrecto '%-.64T' para opción '%-.64s'"

# ER_UNUSED_6
source: "You should never see it"
spa: "Nunca debería vd de ver esto"

# ER_UNUSED_7
source: "You should never see it"
spa: "Nunca debería vd de ver esto"

# ER_UNUSED_8
source: "You should never see it"
spa: "Nunca debería vd de ver esto"

# ER_DATA_OVERFLOW 22003
source: "Got overflow when converting '%-.128s' to %-.32s. Value truncated"
spa: "Obtenido desbordamiento al convertir '%-.128s' a %-.32s. Valor truncado"

# ER_DATA_TRUNCATED 22003
source: "Truncated value '%-.128s' when converting to %-.32s"
spa: "Valor truncado '%-.128s' al convertir a %-.32s"

# ER_BAD_DATA 22007
source: "Encountered illegal value '%-.128s' when converting to %-.32s"
spa: "Encontrado valor ilegal '%-.128s' al convertir a %-.32s"

# ER_DYN_COL_WRONG_FORMAT
source: "Encountered illegal format of dynamic column string"
spa: "Encontrado formato ilegal de cadena en columna dinámica"

# ER_DYN_COL_IMPLEMENTATION_LIMIT
source: "Dynamic column implementation limit reached"
spa: "Alcanzado límite de implementación de columna dinámica"

# ER_DYN_COL_DATA 22007
source: "Illegal value used as argument of dynamic column function"
spa: "Valor ilegal usado como argumento de función de columna dinámica"

# ER_DYN_COL_WRONG_CHARSET
source: "Dynamic column contains unknown character set"
spa: "Columna dinámica contiene conjunto desconocido de caracteres"

# ER_ILLEGAL_SUBQUERY_OPTIMIZER_SWITCHES
source: "At least one of the 'in_to_exists' or 'materialization' optimizer_switch flags must be 'on'"
spa: "Al menos una de las banderas de optimizer_switch 'in_to_exists' o 'materialization' debe de estar a 'on'"

# ER_QUERY_CACHE_IS_DISABLED
source: "Query cache is disabled (resize or similar command in progress); repeat this command later"
spa: "Caché de consulta (query) desactivada (el comando ajustar o similar está en proceso); repite este comando más tarde"

# ER_QUERY_CACHE_IS_GLOBALY_DISABLED
source: "Query cache is globally disabled and you can't enable it only for this session"
spa: "La caché de consulta (query) está desactivada de forma global y no puede activarla sólo para esta sesión"

# ER_VIEW_ORDERBY_IGNORED
source: "View '%-.192s'.'%-.192s' ORDER BY clause ignored because there is other ORDER BY clause already"
spa: "Cláusula de vista '%-.192s'.'%-.192s' ORDER BY ignorada porque ya hay otra clásula ORDER BY"

# ER_CONNECTION_KILLED 70100
source: "Connection was killed"
spa: "La conexión fue matada"

# ER_UNUSED_12
source: "You should never see it"
spa: "Nunca debería vd de ver esto"

# ER_INSIDE_TRANSACTION_PREVENTS_SWITCH_SKIP_REPLICATION
source: "Cannot modify @@session.skip_replication inside a transaction"
spa: "No puedo modificar @@session.skip_replication dentro de una transacción"

# ER_STORED_FUNCTION_PREVENTS_SWITCH_SKIP_REPLICATION
source: "Cannot modify @@session.skip_replication inside a stored function or trigger"
spa: "No puedo modificar @@session.skip_replication dentro de una función almacenada o disparador"

# ER_QUERY_EXCEEDED_ROWS_EXAMINED_LIMIT
source: "Query execution was interrupted. The query examined at least %llu rows, which exceeds LIMIT ROWS EXAMINED (%llu). The query result may be incomplete"
spa: "Se ha interrumpido la ejecución de la consulta (query). La consulta (query) examinó al menos %llu filas, lo cual excede LIMIT ROWS EXAMINED (%llu). El resultado de la consulta (query) puede estar incompleto"

# ER_NO_SUCH_TABLE_IN_ENGINE 42S02
source: "Table '%-.192s.%-.192s' doesn't exist in engine"
spa: "La tabla '%-.192s.%-.192s' no existe en el motor"

# ER_TARGET_NOT_EXPLAINABLE
source: "Target is not executing an operation with a query plan"
spa: "El objetivo no está ejecutando una operación con un plan de consulta (query)"

# ER_CONNECTION_ALREADY_EXISTS
source: "Connection '%.*s' conflicts with existing connection '%.*s'"
spa: "La conexión '%.*s' está en conflicto con la conexión existente '%.*s'"

# ER_MASTER_LOG_PREFIX
source: "Master '%.*s': "
spa: "Maestro (master) '%.*s': "

# ER_CANT_START_STOP_SLAVE
source: "Can't %s SLAVE '%.*s'"
spa: "No puedo %s ESCLAVO '%.*s'"

# ER_SLAVE_STARTED
source: "SLAVE '%.*s' started"
spa: "ESCLAVO '%.*s' arrancado"

# ER_SLAVE_STOPPED
source: "SLAVE '%.*s' stopped"
spa: "ESCLAVO '%.*s' parado"

# ER_SQL_DISCOVER_ERROR
source: "Engine %s failed to discover table %`-.192s.%`-.192s with '%s'"
spa: "El motor %s no pudo descubr la tabla %`-.192s.%`-.192s con '%s'"

# ER_FAILED_GTID_STATE_INIT
source: "Failed initializing replication GTID state"
spa: "Fallo inicializando estado de réplica GTID"
