Repository: vladbogo/test-translation
Catalog: spa.xlf
Languages: spa

# ER_CANT_UPDATE_USED_TABLE_IN_SF_OR_TRG
source: "Can't update table '%-.192s' in stored function/trigger because it is already used by statement which invoked this stored function/trigger"
spa: "No puedo actualizar tabla '%-.192s' en función almacenada/disparador porque ya está siendo usada por la sentencia que invocó esta función almacenada/disparador"

# ER_VIEW_PREVENT_UPDATE
source: "The definition of table '%-.192s' prevents operation %-.192s on table '%-.192s'"
spa: "La definición de la tabla '%-.192s' previene la operación %-.192s en la tabla '%-.192s'"

# ER_PS_NO_RECURSION
source: "The prepared statement contains a stored routine call that refers to that same statement. It's not allowed to execute a prepared statement in such a recursive manner"
spa: "La sentencia preparada contiene una llamada a rutina almacenada que se refiere a esa misma sentencia. No está permitido ejecutar una sentencia preparada de esta manera recursiva"

# ER_SP_CANT_SET_AUTOCOMMIT
source: "Not allowed to set autocommit from a stored function or trigger"
spa: "No permitido usar auto acometida (autocommit) desde una función almacenada o disparador"

# ER_MALFORMED_DEFINER 0L000
source: "Invalid definer"
spa: "Definidor inválido"

# ER_VIEW_FRM_NO_USER
source: "View '%-.192s'.'%-.192s' has no definer information (old table format). Current user is used as definer. Please recreate the view!"
spa: "La vista '%-.192s'.'%-.192s' no tiene información de definidor (formato viejo de tabla). Se usa el usuario actual como definidor. Por favor, ¡recrea la vista!"

# ER_VIEW_OTHER_USER
source: "You need the SUPER privilege for creation view with '%-.192s'@'%-.192s' definer"
spa: "Vd necesita el privilegio SUPER para la creación de la vista con definidor '%-.192s'@'%-.192s'"

# ER_NO_SUCH_USER
source: "The user specified as a definer ('%-.64s'@'%-.64s') does not exist"
spa: "El usuario especificado como definidor ('%-.64s'@'%-.64s') no existe"

# ER_FORBID_SCHEMA_CHANGE
source: "Changing schema from '%-.192s' to '%-.192s' is not allowed"
spa: "Vd no está autorizado a cambiar el esquema de '%-.192s' a '%-.192s'"

# ER_ROW_IS_REFERENCED_2 23000
source: "Cannot delete or update a parent row: a foreign key constraint fails (%.192s)"
spa: "No puedo borrar o actualizar una fila padre: falla una restricción de clave foránea (%.192s)"

# ER_NO_REFERENCED_ROW_2 23000
source: "Cannot add or update a child row: a foreign key constraint fails (%.192s)"
spa: "No puedo añadir o actualizar una fila hija: falla una restricción de clave foránea (%.192s)"

# ER_SP_BAD_VAR_SHADOW 42000
source: "Variable '%-.64s' must be quoted with `...`, or renamed"
spa: "La variable '%-.64s' debe de ser entrecomillada con `...` o renombrada"

# ER_TRG_NO_DEFINER
source: "No definer attribute for trigger '%-.192s'.'%-.192s'. The trigger will be activated under the authorization of the invoker, which may have insufficient privileges. Please recreate the trigger"
spa: "No hay atributo de definidor para disparador '%-.192s'.'%-.192s'. El disparador será activado bajo la autorización del invocador, el cual puede tener insuficientes privilegios. Por favor, vuelva a crear el disparador"

# ER_OLD_FILE_FORMAT
source: "'%-.192s' has an old format, you should re-create the '%s' object(s)"
spa: "'%-.192s' tiene un formato viejo, debería vd de volver a crear el/los objeto(s) '%s'"

# ER_SP_RECURSION_LIMIT
source: "Recursive limit %d (as set by the max_sp_recursion_depth variable) was exceeded for routine %.192s"
spa: "El límite recursivo %d (según se indica mediante la variable max_sp_recursion_depth) se ha excedido para la rutina %.192s"

# ER_SP_PROC_TABLE_CORRUPT
source: "Failed to load routine %-.192s (internal code %d). For more details, run SHOW WARNINGS"
spa: "No pude cargar la rutina %-.192s (código interno %d). Para más detalles, ejecute SHOW WARNINGS"

# ER_SP_WRONG_NAME 42000
source: "Incorrect routine name '%-.192s'"
spa: "Nombre incorrecto de rutina '%-.192s'"

# ER_TABLE_NEEDS_UPGRADE
source: "Upgrade required. Please do \"REPAIR %s %`s\" or dump/reload to fix it!"
spa: "Es necesaria una mejora. Por favor, ¡haga \"REPAIR %s %`s\" o vuelque/recargue para arreglarlo!"

# ER_SP_NO_AGGREGATE 42000
source: "AGGREGATE is not supported for stored functions"
spa: "AGGREGATE no está soportado en funciones almacenadas"

# ER_MAX_PREPARED_STMT_COUNT_REACHED 42000
source: "Can't create more than max_prepared_stmt_count statements (current value: %u)"
spa: "No puedo crear más de max_prepared_stmt_count sentencias (valor en curso: %u)"

# ER_VIEW_RECURSIVE
source: "%`s.%`s contains view recursion"
spa: "`%-.192s`.`%-.192s` contiene recursividad de vista""

# ER_NON_GROUPING_FIELD_USED 42000
source: "Non-grouping field '%-.192s' is used in %-.64s clause"
spa: "No hay campo agrupado '%-.192s' usado en cláusula %-.64s"

# ER_TABLE_CANT_HANDLE_SPKEYS
source: "The storage engine %s doesn't support SPATIAL indexes"
spa: "El motor de almacenaje %s no soporta índices SPATIAL"

# ER_NO_TRIGGERS_ON_SYSTEM_SCHEMA
source: "Triggers can not be created on system tables"
spa: "Los disparadores no pueden ser creados en las tablas del sistema"

# ER_REMOVED_SPACES
source: "Leading spaces are removed from name '%s'"
spa: "Se quitan los espacios iniciales del nombre '%s'"

# ER_AUTOINC_READ_FAILED
source: "Failed to read auto-increment value from storage engine"
spa: "No pude leer valor de auto-incremento del motor de almacenaje"

# ER_USERNAME
source: "user name"
spa: "nombre de usuario"

# ER_HOSTNAME
source: "host name"
spa: "nombre de equipo"

# ER_WRONG_STRING_LENGTH
source: "String '%-.70T' is too long for %s (should be no longer than %d)"
spa: "La cadena '%-.70T' es demasiado larga para %s (no debería de ser mayor de %d)"

# ER_NON_INSERTABLE_TABLE
source: "The target table %-.100s of the %s is not insertable-into"
spa: "La tabla destino %-.100s de la %s no es insertable-dentro"

# ER_ADMIN_WRONG_MRG_TABLE
source: "Table '%-.64s' is differently defined or of non-MyISAM type or doesn't exist"
spa: "La tabla '%-.64s' está definida de forma diferente o es del tipo no-MyISAM o no existe"

# ER_TOO_HIGH_LEVEL_OF_NESTING_FOR_SELECT
source: "Too high level of nesting for select"
spa: "Demasiado alto el nivel de anidamiento para la selección"

# ER_NAME_BECOMES_EMPTY
source: "Name '%-.64s' has become ''"
spa: "El nombre '%-.64s' ha pasado a ser ''"

# ER_AMBIGUOUS_FIELD_TERM
source: "First character of the FIELDS TERMINATED string is ambiguous; please use non-optional and non-empty FIELDS ENCLOSED BY"
spa: "El primer carácter de la cadena de los FIELDS TERMINATED es ambiguo; por favor, use FIELDS ENCLOSED BY no opcionales y no vacíos"

# ER_FOREIGN_SERVER_EXISTS
source: "The foreign server, %s, you are trying to create already exists"
spa: "El servidor foráneo %s que intenta crear ya existe"

# ER_FOREIGN_SERVER_DOESNT_EXIST
source: "The foreign server name you are trying to reference does not exist. Data source error: %-.64s"
spa: "El nombre del servidor foráneo que intenta referenciar no existe. Error en fuentes de datos: %-.64s"

# ER_ILLEGAL_HA_CREATE_OPTION
source: "Table storage engine '%-.64s' does not support the create option '%.64s'"
spa: "El motor de almacenaje de la tabla '%-.64s' no soporta la opción de creación '%.64s'"

# ER_PARTITION_REQUIRES_VALUES_ERROR
source: "Syntax error: %-.64s PARTITIONING requires definition of VALUES %-.64s for each partition"
spa: "Error de sintaxis: %-.64s PARTITIONING requiere de la definición de VALUES %-.64s para cada partición"

# ER_PARTITION_WRONG_VALUES_ERROR
source: "Only %-.64s PARTITIONING can use VALUES %-.64s in partition definition"
spa: "Sólo %-.64s PARTITIONING puede usar VALUES %-.64s en la definición de la partición"

# ER_PARTITION_MAXVALUE_ERROR
source: "MAXVALUE can only be used in last partition definition"
spa: "MAXVALUE sólo se puede usar en la definición de la última partición"

# ER_PARTITION_SUBPARTITION_ERROR
source: "Subpartitions can only be hash partitions and by key"
spa: "Las subparticiones sólo pueden ser particiones dispersas (hash) y mediante clave"

# ER_PARTITION_SUBPART_MIX_ERROR
source: "Must define subpartitions on all partitions if on one partition"
spa: "Se deben de definir subparticiones en todas las particiones si se está en una partición"

# ER_PARTITION_WRONG_NO_PART_ERROR
source: "Wrong number of partitions defined, mismatch with previous setting"
spa: "Definido un número equivocado de particiones, no coincide con configuración previa"

# ER_PARTITION_WRONG_NO_SUBPART_ERROR
source: "Wrong number of subpartitions defined, mismatch with previous setting"
spa: "Definido un número equivocado de subparticiones, no coincide con configuración previa"

# ER_WRONG_EXPR_IN_PARTITION_FUNC_ERROR
source: "Constant, random or timezone-dependent expressions in (sub)partitioning function are not allowed"
spa: "Las expresiones constantes, al azar o dependientes de zona en función de (sub)particionado no están permitidas"

# ER_NOT_CONSTANT_EXPRESSION
source: "Expression in %s must be constant"
spa: "Las expresiones incluidas en %s deben de ser constantes"

# ER_FIELD_NOT_FOUND_PART_ERROR
source: "Field in list of fields for partition function not found in table"
spa: "Campo en la lista de campos para función de partición no hallado en tabla"

# ER_LIST_OF_FIELDS_ONLY_IN_HASH_ERROR
source: "List of fields is only allowed in KEY partitions"
spa: "Lista de campos sólo se permite en particiones KEY"

# ER_INCONSISTENT_PARTITION_INFO_ERROR
source: "The partition info in the frm file is not consistent with what can be written into the frm file"
spa: "La información de partición en el fichero/archivo frm no es consistente con lo que se puede grabar en un fichero/archivo frm"

# ER_PARTITION_FUNC_NOT_ALLOWED_ERROR
source: "The %-.192s function returns the wrong type"
spa: "La función %-.192s devueve un tipo equivocado"

# ER_PARTITIONS_MUST_BE_DEFINED_ERROR
source: "For %-.64s partitions each partition must be defined"
spa: "Para las particiones %-.64s, se debe de definir cada partición"

# ER_RANGE_NOT_INCREASING_ERROR
source: "VALUES LESS THAN value must be strictly increasing for each partition"
spa: "El valor VALUES LESS THAN debe de ser estrictamente incremental para cada partición"

# ER_INCONSISTENT_TYPE_OF_FUNCTIONS_ERROR
source: "VALUES value must be of same type as partition function"
spa: "El valor VALUES debe de ser del mismo tipo que la función de partición"

# ER_MULTIPLE_DEF_CONST_IN_LIST_PART_ERROR
source: "Multiple definition of same constant in list partitioning"
spa: "Definición múltiple de la misma constante en el particionamiento de la lista"

# ER_PARTITION_ENTRY_ERROR
source: "Partitioning can not be used stand-alone in query"
spa: "El particionado no puede ser usado de forma autónoma en consulta (query)"

# ER_MIX_HANDLER_ERROR
source: "The mix of handlers in the partitions is not allowed in this version of MariaDB"
spa: "La mezcla de manejadores en las particiones no está autorizada en esta versión de MariaDB"

# ER_PARTITION_NOT_DEFINED_ERROR
source: "For the partitioned engine it is necessary to define all %-.64s"
spa: "Para el motor de particionado es necesario definir todas %-.64s"

# ER_TOO_MANY_PARTITIONS_ERROR
source: "Too many partitions (including subpartitions) were defined"
spa: "Definidas demasiadas particiones (incluyendo las subparticiones)"

# ER_SUBPARTITION_ERROR
source: "It is only possible to mix RANGE/LIST partitioning with HASH/KEY partitioning for subpartitioning"
spa: "Sólo es posible mezclar particionado RANGE/LIST con particionado HASH/KEY para el subparticionado"

# ER_CANT_CREATE_HANDLER_FILE
source: "Failed to create specific handler file"
spa: "No pude crear fichero/archivo de manejador específico"

# ER_BLOB_FIELD_IN_PART_FUNC_ERROR
source: "A BLOB field is not allowed in partition function"
spa: "No se autoriza campo BLOB en la función de partición"

# ER_UNIQUE_KEY_NEED_ALL_FIELDS_IN_PF
source: "A %-.192s must include all columns in the table's partitioning function"
spa: "Un %-.192s debe de incluir todas las columnas en la función de particionado de la tabla"

# ER_NO_PARTS_ERROR
source: "Number of %-.64s = 0 is not an allowed value"
spa: "El número de %-.64s = 0 no es un valor autorizado"

# ER_PARTITION_MGMT_ON_NONPARTITIONED
source: "Partition management on a not partitioned table is not possible"
spa: "La gestión de particiones en una tabla no particionada no es posible"

# ER_FEATURE_NOT_SUPPORTED_WITH_PARTITIONING
source: "Partitioned tables do not support %s"
spa: "Las tablas particionadas no soportan %s"

# ER_PARTITION_DOES_NOT_EXIST
source: "Wrong partition name or partition list"
spa: "Error en lista de particiones"

# ER_DROP_LAST_PARTITION
source: "Cannot remove all partitions, use DROP TABLE instead"
spa: "No puedo quitar todas las particiones, use DROP TABLE en su lugar"

# ER_COALESCE_ONLY_ON_HASH_PARTITION
source: "COALESCE PARTITION can only be used on HASH/KEY partitions"
spa: "COALESCE PARTITION sólo se puede usar en particiones HASH/KEY"

# ER_REORG_HASH_ONLY_ON_SAME_NO
source: "REORGANIZE PARTITION can only be used to reorganize partitions not to change their numbers"
spa: "REORGANIZE PARTITION sólo se puede usar para reorganizar particiones no para cambiar sus números"

# ER_REORG_NO_PARAM_ERROR
source: "REORGANIZE PARTITION without parameters can only be used on auto-partitioned tables using HASH PARTITIONs"
spa: "REORGANIZE PARTITION sin parámetros sólo se puede usar en tablas auto-particionadas usando HASH PARTITIONs"

# ER_ONLY_ON_RANGE_LIST_PARTITION
source: "%-.64s PARTITION can only be used on RANGE/LIST partitions"
spa: "%-.64s PARTITION sólo puede ser usada en particiones RANGE/LIST"

# ER_ADD_PARTITION_SUBPART_ERROR
source: "Trying to Add partition(s) with wrong number of subpartitions"
spa: "Intentando añadir particion(es) usando un número equivocado de subparticiones"

# ER_ADD_PARTITION_NO_NEW_PARTITION
source: "At least one partition must be added"
spa: "Se debe de añadir una partición, al menos"

# ER_COALESCE_PARTITION_NO_PARTITION
source: "At least one partition must be coalesced"
spa: "Se debe de fusionar una partición, al menos"

# ER_REORG_PARTITION_NOT_EXIST
source: "More partitions to reorganize than there are partitions"
spa: "Hay más particiones a reorganizar que las que existen"

# ER_SAME_NAME_PARTITION
source: "Duplicate partition name %-.192s"
spa: "Nombre de partición duplicado %-.192s"

# ER_NO_BINLOG_ERROR
source: "It is not allowed to shut off binlog on this command"
spa: "No se autoriza a apagar binlog con este comando"

# ER_CONSECUTIVE_REORG_PARTITIONS
source: "When reorganizing a set of partitions they must be in consecutive order"
spa: "Para reorganizar un conjunto de particiones, éstas deben de estar ordenadas consecutivamente"

# ER_REORG_OUTSIDE_RANGE
source: "Reorganize of range partitions cannot change total ranges except for last partition where it can extend the range"
spa: "El reorganizar un rango de particiones no puede cambiar los rangos totales excepto para la última partición donde se puede extender el rango"

# ER_PARTITION_FUNCTION_FAILURE
source: "Partition function not supported in this version for this handler"
spa: "Función de partición no soportada en esta versión para este manejador"

# ER_PART_STATE_ERROR
source: "Partition state cannot be defined from CREATE/ALTER TABLE"
spa: "El estado de una partición no se puede definir desde CREATE/ALTER TABLE"

# ER_LIMITED_PART_RANGE
source: "The %-.64s handler only supports 32 bit integers in VALUES"
spa: "El manejador %-.64s sólo soporta enteros de 32 bit en VALUES"

# ER_PLUGIN_IS_NOT_LOADED
source: "Plugin '%-.192s' is not loaded"
spa: "Enchufe (plugin) '%-.192s' no cargado"

# ER_WRONG_VALUE
source: "Incorrect %-.32s value: '%-.128T'"
spa: "Incorrecto %-.32s valor: '%-.128T'"

# ER_NO_PARTITION_FOR_GIVEN_VALUE
source: "Table has no partition for value %-.64s"
spa: "La tabla no tiene partición para valor %-.64s"

# ER_FILEGROUP_OPTION_ONLY_ONCE
source: "It is not allowed to specify %s more than once"
spa: "No se permite especificar %s más de unva vez"

# ER_CREATE_FILEGROUP_FAILED
source: "Failed to create %s"
spa: "No pude crear %s"

# ER_DROP_FILEGROUP_FAILED
source: "Failed to drop %s"
spa: "No pude eliminar %s"

# ER_TABLESPACE_AUTO_EXTEND_ERROR
source: "The handler doesn't support autoextend of tablespaces"
spa: "El manejador no soporta autoextensión de espacios de tabla"

# ER_WRONG_SIZE_NUMBER
source: "A size parameter was incorrectly specified, either number or on the form 10M"
spa: "Se ha especificado de forma incorrecta un parámetro de medida o el número o en la forma 10M"

# ER_SIZE_OVERFLOW_ERROR
source: "The size number was correct but we don't allow the digit part to be more than 2 billion"
spa: "El número de medida es correcto pero no permitimos que la parte del dígito tenga más de 2 billones"

# ER_ALTER_FILEGROUP_FAILED
source: "Failed to alter: %s"
spa: "No pude alterar: %s"

# ER_BINLOG_ROW_LOGGING_FAILED
source: "Writing one row to the row-based binary log failed"
spa: "Ha fallado el grabar una fila en historial (log) binario basado en fila"

# ER_BINLOG_ROW_WRONG_TABLE_DEF
source: "Table definition on master and slave does not match: %s"
spa: "La definición de tabla en maestro (master) y esclavo no coincide: %s"

# ER_BINLOG_ROW_RBR_TO_SBR
source: "Slave running with --log-slave-updates must use row-based binary logging to be able to replicate row-based binary log events"
spa: "La ejecución esclava con --log-slave-updates debe de usar un historial (log) binario basado en fila para que pueda replicar eventos de historial (log) binario basados en fila"

# ER_EVENT_ALREADY_EXISTS
source: "Event '%-.192s' already exists"
spa: "El evento '%-.192s' ya existe"

# ER_EVENT_STORE_FAILED
source: "Failed to store event %s. Error code %M from storage engine"
spa: "No pude almacenar evento %s. Código de error %M desde motor de almacenaje"

# ER_EVENT_DOES_NOT_EXIST
source: "Unknown event '%-.192s'"
spa: "Evento desconocido '%-.192s'"

# ER_EVENT_CANT_ALTER
source: "Failed to alter event '%-.192s'"
spa: "No pude alterar evento '%-.192s'"

# ER_EVENT_DROP_FAILED
source: "Failed to drop %s"
spa: "No pude eliminar %s"

# ER_EVENT_INTERVAL_NOT_POSITIVE_OR_TOO_BIG
source: "INTERVAL is either not positive or too big"
spa: "O INTERVAL no es positivo o es demasiado grande"

# ER_EVENT_ENDS_BEFORE_STARTS
source: "ENDS is either invalid or before STARTS"
spa: "O ENDS es inválido o anterior a STARTS"

# ER_EVENT_EXEC_TIME_IN_THE_PAST
source: "Event execution time is in the past. Event has been disabled"
spa: "El tiempo de ejecución de evento se encuentra en el pasado. El evento ha sido desactivado"

# ER_EVENT_OPEN_TABLE_FAILED
source: "Failed to open mysql.event"
spa: "No puede abrir mysql.event"

# ER_EVENT_NEITHER_M_EXPR_NOR_M_AT
source: "No datetime expression provided"
spa: "No se ha suministrado expresión datetime"

# ER_UNUSED_2
source: "You should never see it"
spa: "No lo debería vd de ver nunca"

# ER_UNUSED_3
source: "You should never see it"
spa: "No lo debería vd de ver nunca"

# ER_EVENT_CANNOT_DELETE
source: "Failed to delete the event from mysql.event"
spa: "No pude borrar el evento desde mysql.event"

# ER_EVENT_COMPILE_ERROR
source: "Error during compilation of event's body"
spa: "Error durante compilación de cuerpo de evento"

# ER_EVENT_SAME_NAME
source: "Same old and new event name"
spa: "Mismo nombre de evento viejo y nuevo"

# ER_EVENT_DATA_TOO_LONG
source: "Data for column '%s' too long"
spa: "Datos demasiado largos para la columna '%s'"

# ER_DROP_INDEX_FK
source: "Cannot drop index '%-.192s': needed in a foreign key constraint"
spa: "No puedo eliminar índice '%-.192s': necesario en una restricción de clave foránea"

# ER_WARN_DEPRECATED_SYNTAX_WITH_VER
source: "The syntax '%s' is deprecated and will be removed in MariaDB %s. Please use %s instead"
spa: "La sintaxis '%s' está obsoleta y será quitada en MariaDB %s. Por favor, use %s en su lugar"

# ER_CANT_WRITE_LOCK_LOG_TABLE
source: "You can't write-lock a log table. Only read access is possible"
spa: "No puede hacer bloqueo de escritura en una tabla de historial (log). Sólo es posible acceso de lectura"

# ER_CANT_LOCK_LOG_TABLE
source: "You can't use locks with log tables"
spa: "No puede usar bloqueos con tablas de historial (log)"

# ER_UNUSED_4
source: "You should never see it"
spa: "Nunca debería vd de ver esto"

# ER_COL_COUNT_DOESNT_MATCH_PLEASE_UPDATE
source: "Column count of mysql.%s is wrong. Expected %d, found %d. Created with MariaDB %d, now running %d. Please use mariadb-upgrade to fix this error"
spa: "El contador de columnas de mysql.%s está equivocado. Se esperaba %d, hallado %d. Creado con MariaDB %d, ahora ejecuando %d. Por favor, use mariadb-upgrade para solucionar este error"

# ER_TEMP_TABLE_PREVENTS_SWITCH_OUT_OF_RBR
source: "Cannot switch out of the row-based binary log format when the session has open temporary tables"
spa: "No puedo conmutar fuera del formato de historial (log) binario basado en fila cuando la sesión ha abierto tablas temporales"

# ER_STORED_FUNCTION_PREVENTS_SWITCH_BINLOG_FORMAT
source: "Cannot change the binary logging format inside a stored function or trigger"
spa: "No puedo cambiar el formato de historial (log) binario dentro de funciones almacenadas o disparadores"

# ER_UNUSED_13
source: "You should never see it"
spa: "Nunca debería vd de ver esto"

# ER_PARTITION_NO_TEMPORARY
source: "Cannot create temporary table with partitions"
spa: "No puedo crear tabla temporal con particiones"

# ER_PARTITION_CONST_DOMAIN_ERROR
source: "Partition constant is out of partition function domain"
spa: "La constante de partición está fuera del dominio de función de partición"

# ER_PARTITION_FUNCTION_IS_NOT_ALLOWED
source: "This partition function is not allowed"
spa: "Esta función de partición no está permitida"

# ER_DDL_LOG_ERROR
source: "Error in DDL log"
spa: "Error en historial (log) DDL"

# ER_NULL_IN_VALUES_LESS_THAN
source: "Not allowed to use NULL value in VALUES LESS THAN"
spa: "No autorizado a usar valor NULL en VALUES LESS THAN"

# ER_WRONG_PARTITION_NAME
source: "Incorrect partition name"
spa: "Nombre incorrecto de partición"

# ER_CANT_CHANGE_TX_CHARACTERISTICS 25001
source: "Transaction characteristics can't be changed while a transaction is in progress"
spa: "No se pueden cambiar las característias de transacción mientras que una transacción se ecuentre en proceso"

# ER_DUP_ENTRY_AUTOINCREMENT_CASE
source: "ALTER TABLE causes auto_increment resequencing, resulting in duplicate entry '%-.192T' for key '%-.192s'"
spa: "ALTER TABLE causa resecuenciado de auto_incremento resultando en entrada duplicada '%-.192T' para la clave '%-.192s'"

# ER_EVENT_MODIFY_QUEUE_ERROR
source: "Internal scheduler error %d"
spa: "Error en organizador interno %d"

# ER_EVENT_SET_VAR_ERROR
source: "Error during starting/stopping of the scheduler. Error code %M"
spa: "Error durante arranque/parada del organizador. Código de error %M"

# ER_PARTITION_MERGE_ERROR
source: "Engine cannot be used in partitioned tables"
spa: "No se puede usar el motor en tablas particionadas"

# ER_CANT_ACTIVATE_LOG
source: "Cannot activate '%-.64s' log"
spa: "No puedo activar historial (log) '%-.64s'"

# ER_RBR_NOT_AVAILABLE
source: "The server was not built with row-based replication"
spa: "El servidor no ha sido construido con réplica basada en fila"

# ER_BASE64_DECODE_ERROR
source: "Decoding of base64 string failed"
spa: "Ha fallado la decodificación de cadena base64"

# ER_EVENT_RECURSION_FORBIDDEN
source: "Recursion of EVENT DDL statements is forbidden when body is present"
spa: "Se prohiben sentencias de EVENT DDL cuando se encuentra presente el cuerpo"

# ER_EVENTS_DB_ERROR
source: "Cannot proceed, because event scheduler is disabled"
spa: "No puedo proceder porque el organizado de eventos está desactivado"
