Repository: vladbogo/test-translation
Catalog: swe.xlf
Languages: swe

# ER_REQUIRES_PRIMARY_KEY 42000
source: "This table type requires a primary key"
swe: "Denna tabelltyp kräver en PRIMARY KEY"

# ER_NO_RAID_COMPILED
source: "This version of MariaDB is not compiled with RAID support"
swe: "Denna version av MariaDB är inte kompilerad med RAID"

# ER_UPDATE_WITHOUT_KEY_IN_SAFE_MODE
source: "You are using safe update mode and you tried to update a table without a WHERE that uses a KEY column"
swe: "Du använder 'säker uppdateringsmod' och försökte uppdatera en tabell utan en WHERE-sats som använder sig av en nyckel"

# ER_KEY_DOES_NOT_EXISTS 42000 S1009
source: "Key '%-.192s' doesn't exist in table '%-.192s'"
swe: "Nyckel '%-.192s' finns inte in tabell '%-.192s'"

# ER_CHECK_NO_SUCH_TABLE 42000
source: "Can't open table"
swe: "Kan inte öppna tabellen"

# ER_CHECK_NOT_IMPLEMENTED 42000
source: "The storage engine for the table doesn't support %s"
swe: "Tabellhanteraren för denna tabell kan inte göra %s"

# ER_CANT_DO_THIS_DURING_AN_TRANSACTION 25000
source: "You are not allowed to execute this command in a transaction"
swe: "Du får inte utföra detta kommando i en transaktion"

# ER_ERROR_DURING_COMMIT
source: "Got error %M during COMMIT"
swe: "Fick fel %M vid COMMIT"

# ER_ERROR_DURING_ROLLBACK
source: "Got error %M during ROLLBACK"
swe: "Fick fel %M vid ROLLBACK"

# ER_ERROR_DURING_FLUSH_LOGS
source: "Got error %M during FLUSH_LOGS"
swe: "Fick fel %M vid FLUSH_LOGS"

# ER_ERROR_DURING_CHECKPOINT
source: "Got error %M during CHECKPOINT"
swe: "Fick fel %M vid CHECKPOINT"

# ER_NEW_ABORTING_CONNECTION 08S01
source: "Aborted connection %lld to db: '%-.192s' user: '%-.48s' host: '%-.64s' (%-.64s)"
swe: "Avbröt länken för tråd %lld till db '%-.192s', användare '%-.48s', host '%-.64s' (%-.64s)"

# ER_MASTER
source: "Error from master: '%-.64s'"
swe: "Fel från master: '%-.64s'"

# ER_MASTER_NET_READ 08S01
source: "Net error reading from master"
swe: "Fick nätverksfel vid läsning från master"

# ER_MASTER_NET_WRITE 08S01
source: "Net error writing to master"
swe: "Fick nätverksfel vid skrivning till master"

# ER_FT_MATCHING_KEY_NOT_FOUND
source: "Can't find FULLTEXT index matching the column list"
swe: "Hittar inte ett FULLTEXT-index i kolumnlistan"

# ER_LOCK_OR_ACTIVE_TRANSACTION
source: "Can't execute the given command because you have active locked tables or an active transaction"
swe: "Kan inte utföra kommandot emedan du har en låst tabell eller an aktiv transaktion"

# ER_UNKNOWN_SYSTEM_VARIABLE
source: "Unknown system variable '%-.*s'"
swe: "Okänd systemvariabel: '%-.*s'"

# ER_CRASHED_ON_USAGE
source: "Table '%-.192s' is marked as crashed and should be repaired"
swe: "Tabell '%-.192s' är trasig och bör repareras med REPAIR TABLE"

# ER_CRASHED_ON_REPAIR
source: "Table '%-.192s' is marked as crashed and last (automatic?) repair failed"
swe: "Tabell '%-.192s' är trasig och senast (automatiska?) reparation misslyckades"

# ER_WARNING_NOT_COMPLETE_ROLLBACK
source: "Some non-transactional changed tables couldn't be rolled back"
swe: "Warning: Några icke transaktionella tabeller kunde inte återställas vid ROLLBACK"

# ER_TRANS_CACHE_FULL
source: "Multi-statement transaction required more than 'max_binlog_cache_size' bytes of storage; increase this mariadbd variable and try again"
swe: "Transaktionen krävde mera än 'max_binlog_cache_size' minne. Öka denna mariadbd-variabel och försök på nytt"

# ER_SLAVE_MUST_STOP
source: "This operation cannot be performed as you have a running slave '%2$*1$s'; run STOP SLAVE '%2$*1$s' first"
swe: "Denna operation kan inte göras under replikering; Du har en aktiv förbindelse till '%2$*1$s'. Gör STOP SLAVE '%2$*1$s' först"

# ER_SLAVE_NOT_RUNNING
source: "This operation requires a running slave; configure slave and do START SLAVE"
swe: "Denna operation kan endast göras under replikering; Konfigurera slaven och gör START SLAVE"

# ER_BAD_SLAVE
source: "The server is not configured as slave; fix in config file or with CHANGE MASTER TO"
swe: "Servern är inte konfigurerade som en replikationsslav. Ändra konfigurationsfilen eller gör CHANGE MASTER TO"

# ER_MASTER_INFO
source: "Could not initialize master info structure for '%.*s'; more error messages can be found in the MariaDB error log"
swe: "Kunde inte initialisera replikationsstrukturerna för '%.*s'. See MariaDB fel fil för mera information"

# ER_SLAVE_THREAD
source: "Could not create slave thread; check system resources"
swe: "Kunde inte starta en tråd för replikering"

# ER_TOO_MANY_USER_CONNECTIONS 42000
source: "User %-.64s already has more than 'max_user_connections' active connections"
swe: "Användare '%-.64s' har redan 'max_user_connections' aktiva inloggningar"

# ER_SET_CONSTANTS_ONLY
source: "You may only use constant expressions in this statement"
swe: "Man kan endast använda konstantuttryck med SET"

# ER_LOCK_WAIT_TIMEOUT
source: "Lock wait timeout exceeded; try restarting transaction"
swe: "Fick inte ett lås i tid ; Försök att starta om transaktionen"

# ER_LOCK_TABLE_FULL
source: "The total number of locks exceeds the lock table size"
swe: "Antal lås överskrider antalet reserverade lås"

# ER_READ_ONLY_TRANSACTION 25000
source: "Update locks cannot be acquired during a READ UNCOMMITTED transaction"
swe: "Updateringslås kan inte göras när man använder READ UNCOMMITTED"

# ER_DROP_DB_WITH_READ_LOCK
source: "DROP DATABASE not allowed while thread is holding global read lock"
swe: "DROP DATABASE är inte tillåtet när man har ett globalt läslås"

# ER_CREATE_DB_WITH_READ_LOCK
source: "CREATE DATABASE not allowed while thread is holding global read lock"
swe: "CREATE DATABASE är inte tillåtet när man har ett globalt läslås"

# ER_WRONG_ARGUMENTS
source: "Incorrect arguments to %s"
swe: "Felaktiga argument till %s"

# ER_NO_PERMISSION_TO_CREATE_USER 42000
source: "'%s'@'%s' is not allowed to create new users"
swe: "'%s'@'%s' har inte rättighet att skapa nya användare"

# ER_UNION_TABLES_IN_DIFFERENT_DIR
source: "Incorrect table definition; all MERGE tables must be in the same database"
swe: "Felaktig tabelldefinition; alla tabeller i en MERGE-tabell måste vara i samma databas"

# ER_LOCK_DEADLOCK 40001
source: "Deadlock found when trying to get lock; try restarting transaction"
swe: "Fick 'DEADLOCK' vid låsförsök av block/rad. Försök att starta om transaktionen"

# ER_TABLE_CANT_HANDLE_FT
source: "The storage engine %s doesn't support FULLTEXT indexes"
swe: "Tabelltypen (%s) har inte hantering av FULLTEXT-index"

# ER_CANNOT_ADD_FOREIGN
source: "Cannot add foreign key constraint for `%s`"
swe: "Kan inte lägga till 'FOREIGN KEY constraint' för `%s`'"

# ER_NO_REFERENCED_ROW 23000
source: "Cannot add or update a child row: a foreign key constraint fails"
swe: "FOREIGN KEY-konflikt: Kan inte skriva barn"

# ER_ROW_IS_REFERENCED 23000
source: "Cannot delete or update a parent row: a foreign key constraint fails"
swe: "FOREIGN KEY-konflikt: Kan inte radera fader"

# ER_CONNECT_TO_MASTER 08S01
source: "Error connecting to master: %-.128s"
swe: "Fick fel vid anslutning till master: %-.128s"

# ER_QUERY_ON_MASTER
source: "Error running query on master: %-.128s"
swe: "Fick fel vid utförande av command på mastern: %-.128s"

# ER_ERROR_WHEN_EXECUTING_COMMAND
source: "Error when executing command %s: %-.128s"
swe: "Fick fel vid utförande av %s: %-.128s"

# ER_WRONG_USAGE
source: "Incorrect usage of %s and %s"
swe: "Felaktig använding av %s and %s"

# ER_WRONG_NUMBER_OF_COLUMNS_IN_SELECT 21000
source: "The used SELECT statements have a different number of columns"
swe: "SELECT-kommandona har olika antal kolumner"

# ER_CANT_UPDATE_WITH_READLOCK
source: "Can't execute the query because you have a conflicting read lock"
swe: "Kan inte utföra kommandot emedan du har ett READ-lås"

# ER_MIXING_NOT_ALLOWED
source: "Mixing of transactional and non-transactional tables is disabled"
swe: "Blandning av transaktionella och icke-transaktionella tabeller är inaktiverat"

# ER_DUP_ARGUMENT
source: "Option '%s' used twice in statement"
swe: "Option '%s' användes två gånger"

# ER_USER_LIMIT_REACHED 42000
source: "User '%-.64s' has exceeded the '%s' resource (current value: %ld)"
swe: "Användare '%-.64s' har överskridit '%s' (nuvarande värde: %ld)"

# ER_SPECIFIC_ACCESS_DENIED_ERROR 42000
source: "Access denied; you need (at least one of) the %-.128s privilege(s) for this operation"
swe: "Du har inte privlegiet '%-.128s' som behövs för denna operation"

# ER_LOCAL_VARIABLE
source: "Variable '%-.64s' is a SESSION variable and can't be used with SET GLOBAL"
swe: "Variabel '%-.64s' är en SESSION variabel och kan inte ändrad med SET GLOBAL"

# ER_GLOBAL_VARIABLE
source: "Variable '%-.64s' is a GLOBAL variable and should be set with SET GLOBAL"
swe: "Variabel '%-.64s' är en GLOBAL variabel och bör sättas med SET GLOBAL"

# ER_NO_DEFAULT 42000
source: "Variable '%-.64s' doesn't have a default value"
swe: "Variabel '%-.64s' har inte ett DEFAULT-värde"

# ER_WRONG_VALUE_FOR_VAR 42000
source: "Variable '%-.64s' can't be set to the value of '%-.200T'"
swe: "Variabel '%-.64s' kan inte sättas till '%-.200T'"

# ER_WRONG_TYPE_FOR_VAR 42000
source: "Incorrect argument type to variable '%-.64s'"
swe: "Fel typ av argument till variabel '%-.64s'"

# ER_VAR_CANT_BE_READ
source: "Variable '%-.64s' can only be set, not read"
swe: "Variabeln '%-.64s' kan endast sättas, inte läsas"

# ER_CANT_USE_OPTION_HERE 42000
source: "Incorrect usage/placement of '%s'"
swe: "Fel använding/placering av '%s'"

# ER_NOT_SUPPORTED_YET 42000
source: "This version of MariaDB doesn't yet support '%s'"
swe: "Denna version av MariaDB kan ännu inte utföra '%s'"

# ER_MASTER_FATAL_ERROR_READING_BINLOG
source: "Got fatal error %d from master when reading data from binary log: '%-.320s'"
swe: "Fick fatalt fel %d: '%-.320s' från master vid läsning av binärloggen"

# ER_SLAVE_IGNORED_TABLE
source: "Slave SQL thread ignored the query because of replicate-*-table rules"
swe: "Slav SQL tråden ignorerade frågan pga en replicate-*-table regel"

# ER_INCORRECT_GLOBAL_LOCAL_VAR
source: "Variable '%-.192s' is a %s variable"
swe: "Variabel '%-.192s' är av typ %s"

# ER_WRONG_FK_DEF 42000
source: "Incorrect foreign key definition for '%-.192s': %s"
swe: "Felaktig FOREIGN KEY-definition för '%-.192s': %s"

# ER_KEY_REF_DO_NOT_MATCH_TABLE_REF
source: "Key reference and table reference don't match"
swe: "Nyckelreferensen och tabellreferensen stämmer inte överens"

# ER_SUBQUERY_NO_1_ROW 21000
source: "Subquery returns more than 1 row"
swe: "Subquery returnerade mer än 1 rad"

# ER_UNKNOWN_STMT_HANDLER
source: "Unknown prepared statement handler (%.*s) given to %s"
swe: "Okänd PREPARED STATEMENT id (%.*s) var given till %s"

# ER_CORRUPT_HELP_DB
source: "Help database is corrupt or does not exist"
swe: "Hjälpdatabasen finns inte eller är skadad"

# ER_CYCLIC_REFERENCE
source: "Cyclic reference on subqueries"
swe: "Cyklisk referens i subqueries"

# ER_AUTO_CONVERT
source: "Converting column '%s' from %s to %s"
swe: "Konvertar kolumn '%s' från %s till %s"

# ER_ILLEGAL_REFERENCE 42S22
source: "Reference '%-.64s' not supported (%s)"
swe: "Referens '%-.64s' stöds inte (%s)"

# ER_DERIVED_MUST_HAVE_ALIAS 42000
source: "Every derived table must have its own alias"
swe: "Varje 'derived table' måste ha sitt eget alias"

# ER_SELECT_REDUCED 01000
source: "Select %u was reduced during optimization"
swe: "Select %u reducerades vid optimiering"

# ER_TABLENAME_NOT_ALLOWED_HERE 42000
source: "Table '%-.192s' from one of the SELECTs cannot be used in %-.32s"
swe: "Tabell '%-.192s' från en SELECT kan inte användas i %-.32s"

# ER_NOT_SUPPORTED_AUTH_MODE 08004
source: "Client does not support authentication protocol requested by server; consider upgrading MariaDB client"
swe: "Klienten stöder inte autentiseringsprotokollet som begärts av servern; överväg uppgradering av klientprogrammet"

# ER_SPATIAL_CANT_HAVE_NULL 42000
source: "All parts of a SPATIAL index must be NOT NULL"
swe: "Alla delar av en SPATIAL index måste vara NOT NULL"

# ER_COLLATION_CHARSET_MISMATCH 42000
source: "COLLATION '%s' is not valid for CHARACTER SET '%s'"
swe: "COLLATION '%s' är inte tillåtet för CHARACTER SET '%s'"

# ER_SLAVE_WAS_RUNNING
source: "Slave is already running"
swe: "Slaven har redan startat"

# ER_SLAVE_WAS_NOT_RUNNING
source: "Slave already has been stopped"
swe: "Slaven har redan stoppat"

# ER_WARN_USING_OTHER_HANDLER
source: "Using storage engine %s for table '%s'"
swe: "Använder handler %s för tabell '%s'"

# ER_WRONG_NAME_FOR_INDEX 42000
source: "Incorrect index name '%-.100s'"
swe: "Felaktigt index namn '%-.100s'"

# ER_WRONG_NAME_FOR_CATALOG 42000
source: "Incorrect catalog name '%-.100s'"
swe: "Felaktigt katalog namn '%-.100s'"

# ER_WARN_QC_RESIZE
source: "Query cache failed to set size %llu; new query cache size is %lu"
swe: "Storleken av "Query cache" kunde inte sättas till %llu, ny storlek är %lu"

# ER_BAD_FT_COLUMN
source: "Column '%-.192s' cannot be part of FULLTEXT index"
swe: "Kolumn '%-.192s' kan inte vara del av ett FULLTEXT index"

# ER_UNKNOWN_KEY_CACHE
source: "Unknown key cache '%-.100s'"
swe: "Okänd nyckel cache '%-.100s'"

# ER_NON_UPDATABLE_TABLE
source: "The target table %-.100s of the %s is not updatable"
swe: "Tabell %-.100s använd med '%s' är inte uppdateringsbar"

# ER_FEATURE_DISABLED
source: "The '%s' feature is disabled; you need MariaDB built with '%s' to have it working"
swe: "'%s' är inte aktiverad; För att aktivera detta måste du bygga om MariaDB med '%s' definierad"

# ER_OPTION_PREVENTS_STATEMENT
source: "The MariaDB server is running with the %s option so it cannot execute this statement"
swe: "MariaDB är startad med %s. Pga av detta kan du inte använda detta kommando"

# ER_PARTITION_REQUIRES_VALUES_ERROR
source: "Syntax error: %-.64s PARTITIONING requires definition of VALUES %-.64s for each partition"
swe: "Syntaxfel: %-.64s PARTITIONering kräver definition av VALUES %-.64s för varje partition"

# ER_PARTITION_WRONG_VALUES_ERROR
source: "Only %-.64s PARTITIONING can use VALUES %-.64s in partition definition"
swe: "Endast %-.64s partitionering kan använda VALUES %-.64s i definition av partitionen"

# ER_PARTITION_MAXVALUE_ERROR
source: "MAXVALUE can only be used in last partition definition"
swe: "MAXVALUE kan bara användas i definitionen av den sista partitionen"

# ER_PARTITION_SUBPARTITION_ERROR
source: "Subpartitions can only be hash partitions and by key"
swe: "Subpartitioner kan bara vara hash och key partitioner"

# ER_PARTITION_SUBPART_MIX_ERROR
source: "Must define subpartitions on all partitions if on one partition"
swe: "Subpartitioner måste definieras på alla partitioner om på en"

# ER_PARTITION_WRONG_NO_PART_ERROR
source: "Wrong number of partitions defined, mismatch with previous setting"
swe: "Antal partitioner definierade och antal partitioner är inte lika"

# ER_PARTITION_WRONG_NO_SUBPART_ERROR
source: "Wrong number of subpartitions defined, mismatch with previous setting"
swe: "Antal subpartitioner definierade och antal subpartitioner är inte lika"

# ER_WRONG_EXPR_IN_PARTITION_FUNC_ERROR
source: "Constant, random or timezone-dependent expressions in (sub)partitioning function are not allowed"
swe: "Konstanta uttryck eller slumpmässiga uttryck är inte tillåtna (sub)partitioneringsfunktioner"

# ER_NOT_CONSTANT_EXPRESSION
source: "Expression in %s must be constant"
swe: "Uttryck i %s måste vara ett konstant uttryck"

# ER_FIELD_NOT_FOUND_PART_ERROR
source: "Field in list of fields for partition function not found in table"
swe: "Fält i listan av fält för partitionering med key inte funnen i tabellen"

# ER_LIST_OF_FIELDS_ONLY_IN_HASH_ERROR
source: "List of fields is only allowed in KEY partitions"
swe: "En lista av fält är endast tillåtet för KEY partitioner"

# ER_INCONSISTENT_PARTITION_INFO_ERROR
source: "The partition info in the frm file is not consistent with what can be written into the frm file"
swe: "Partitioneringsinformationen i frm-filen är inte konsistent med vad som kan skrivas i frm-filen"

# ER_PARTITION_FUNC_NOT_ALLOWED_ERROR
source: "The %-.192s function returns the wrong type"
swe: "%-.192s-funktionen returnerar felaktig typ"

# ER_PARTITIONS_MUST_BE_DEFINED_ERROR
source: "For %-.64s partitions each partition must be defined"
swe: "För %-.64s partitionering så måste varje partition definieras"

# ER_RANGE_NOT_INCREASING_ERROR
source: "VALUES LESS THAN value must be strictly increasing for each partition"
swe: "Värden i VALUES LESS THAN måste vara strikt växande för varje partition"

# ER_INCONSISTENT_TYPE_OF_FUNCTIONS_ERROR
source: "VALUES value must be of same type as partition function"
swe: "Värden i VALUES måste vara av samma typ som partitioneringsfunktionen"

# ER_MULTIPLE_DEF_CONST_IN_LIST_PART_ERROR
source: "Multiple definition of same constant in list partitioning"
swe: "Multipel definition av samma konstant i list partitionering"

# ER_PARTITION_ENTRY_ERROR
source: "Partitioning can not be used stand-alone in query"
swe: "Partitioneringssyntax kan inte användas på egen hand i en SQL-fråga"

# ER_MIX_HANDLER_ERROR
source: "The mix of handlers in the partitions is not allowed in this version of MariaDB"
swe: "Denna mix av lagringsmotorer är inte tillåten i denna version av MariaDB"

# ER_PARTITION_NOT_DEFINED_ERROR
source: "For the partitioned engine it is necessary to define all %-.64s"
swe: "För partitioneringsmotorn så är det nödvändigt att definiera alla %-.64s"

# ER_TOO_MANY_PARTITIONS_ERROR
source: "Too many partitions (including subpartitions) were defined"
swe: "För många partitioner (inkluderande subpartitioner) definierades"

# ER_SUBPARTITION_ERROR
source: "It is only possible to mix RANGE/LIST partitioning with HASH/KEY partitioning for subpartitioning"
swe: "Det är endast möjligt att blanda RANGE/LIST partitionering med HASH/KEY partitionering för subpartitionering"

# ER_CANT_CREATE_HANDLER_FILE
source: "Failed to create specific handler file"
swe: "Misslyckades med att skapa specifik fil i lagringsmotor"

# ER_BLOB_FIELD_IN_PART_FUNC_ERROR
source: "A BLOB field is not allowed in partition function"
swe: "Ett BLOB-fält är inte tillåtet i partitioneringsfunktioner"

# ER_NO_PARTS_ERROR
source: "Number of %-.64s = 0 is not an allowed value"
swe: "Antal %-.64s = 0 är inte ett tillåten värde"

# ER_PARTITION_MGMT_ON_NONPARTITIONED
source: "Partition management on a not partitioned table is not possible"
swe: "Partitioneringskommando på en opartitionerad tabell är inte möjligt"

# ER_PARTITION_DOES_NOT_EXIST
source: "Wrong partition name or partition list"
swe: "Fel namn av en partition eller fel i listan av partitioner"

# ER_DROP_LAST_PARTITION
source: "Cannot remove all partitions, use DROP TABLE instead"
swe: "Det är inte tillåtet att ta bort alla partitioner, använd DROP TABLE istället"

# ER_COALESCE_ONLY_ON_HASH_PARTITION
source: "COALESCE PARTITION can only be used on HASH/KEY partitions"
swe: "COALESCE PARTITION kan bara användas på HASH/KEY partitioner"

# ER_REORG_HASH_ONLY_ON_SAME_NO
source: "REORGANIZE PARTITION can only be used to reorganize partitions not to change their numbers"
swe: "REORGANIZE PARTITION kan bara användas för att omorganisera partitioner, inte för att ändra deras antal"

# ER_REORG_NO_PARAM_ERROR
source: "REORGANIZE PARTITION without parameters can only be used on auto-partitioned tables using HASH PARTITIONs"
swe: "REORGANIZE PARTITION utan parametrar kan bara användas på auto-partitionerade tabeller som använder HASH partitionering"

# ER_ONLY_ON_RANGE_LIST_PARTITION
source: "%-.64s PARTITION can only be used on RANGE/LIST partitions"
swe: "%-.64s PARTITION kan bara användas på RANGE/LIST-partitioner"

# ER_ADD_PARTITION_SUBPART_ERROR
source: "Trying to Add partition(s) with wrong number of subpartitions"
swe: "ADD PARTITION med fel antal subpartitioner"

# ER_ADD_PARTITION_NO_NEW_PARTITION
source: "At least one partition must be added"
swe: "Åtminstone en partition måste läggas till vid ADD PARTITION"

# ER_COALESCE_PARTITION_NO_PARTITION
source: "At least one partition must be coalesced"
swe: "Åtminstone en partition måste slås ihop vid COALESCE PARTITION"

# ER_REORG_PARTITION_NOT_EXIST
source: "More partitions to reorganize than there are partitions"
swe: "Fler partitioner att reorganisera än det finns partitioner"

# ER_SAME_NAME_PARTITION
source: "Duplicate partition name %-.192s"
swe: "Duplicerat partitionsnamn %-.192s"

# ER_NO_BINLOG_ERROR
source: "It is not allowed to shut off binlog on this command"
swe: "Det är inte tillåtet att stänga av binlog på detta kommando"

# ER_CONSECUTIVE_REORG_PARTITIONS
source: "When reorganizing a set of partitions they must be in consecutive order"
swe: "När ett antal partitioner omorganiseras måste de vara i konsekutiv ordning"

# ER_REORG_OUTSIDE_RANGE
source: "Reorganize of range partitions cannot change total ranges except for last partition where it can extend the range"
swe: "Reorganisering av rangepartitioner kan inte ändra den totala intervallet utom för den sista partitionen där intervallet kan utökas"

# ER_PART_STATE_ERROR
source: "Partition state cannot be defined from CREATE/ALTER TABLE"
swe: "Partition state kan inte definieras från CREATE/ALTER TABLE"

# ER_LIMITED_PART_RANGE
source: "The %-.64s handler only supports 32 bit integers in VALUES"
swe: "%-.64s stödjer endast 32 bitar i integers i VALUES"

# ER_PARTITION_CONST_DOMAIN_ERROR
source: "Partition constant is out of partition function domain"
swe: "Partitionskonstanten är utanför partitioneringsfunktionens domän"

# ER_PARTITION_FUNCTION_IS_NOT_ALLOWED
source: "This partition function is not allowed"
swe: "Denna partitioneringsfunktion är inte tillåten"

# ER_NULL_IN_VALUES_LESS_THAN
source: "Not allowed to use NULL value in VALUES LESS THAN"
swe: "Det är inte tillåtet att använda NULL-värden i VALUES LESS THAN"

# ER_WRONG_PARTITION_NAME
source: "Incorrect partition name"
swe: "Felaktigt partitionsnamn"

# ER_PARTITION_MERGE_ERROR
source: "Engine cannot be used in partitioned tables"
swe: "Engine inte användas i en partitionerad tabell"

# ER_BASE64_DECODE_ERROR
source: "Decoding of base64 string failed"
swe: "Avkodning av base64 sträng misslyckades"

# ER_DUP_ENTRY_WITH_KEY_NAME 23000 S1009
source: "Duplicate entry '%-.64T' for key '%-.192s'"
swe: "Dublett '%-.64T' för nyckel '%-.192s'"

# ER_BINLOG_UNSAFE_STATEMENT
source: "Unsafe statement written to the binary log using statement format since BINLOG_FORMAT = STATEMENT. %s"
swe: "Detta är inte säkert att logga i statement-format, för BINLOG_FORMAT = STATEMENT. %s"

# ER_DATABASE_NAME
source: "Database"
swe: "Databas"

# ER_TABLE_NAME
source: "Table"
swe: "Tabell"

# ER_TEMPORARY_NAME
source: "Temporary"
swe: "Temporär"

# ER_RENAMED_NAME
source: "Renamed"
swe: "Namnändrad"

# ER_FAILED_READ_FROM_PAR_FILE
source: "Failed to read from the .par file"
swe: "Misslyckades läsa från .par filen"

# ER_VALUES_IS_NOT_INT_TYPE_ERROR
source: "VALUES value for partition '%-.64s' must have type INT"
swe: "Värden i VALUES för partition '%-.64s' måste ha typen INT"

# ER_ACCESS_DENIED_NO_PASSWORD_ERROR 28000
source: "Access denied for user '%s'@'%s'"
swe: "Användare '%s'@'%s' är ej berättigad att logga in"

# ER_PARTITION_EXCHANGE_DIFFERENT_OPTION
source: "Non matching attribute '%-.64s' between partition and table"
swe: "Attributet '%-.64s' är olika mellan partition och tabell"

# ER_PARTITION_EXCHANGE_PART_TABLE
source: "Table to exchange with partition is partitioned: '%-.64s'"
swe: "Tabellen att byta ut mot partition är partitionerad: '%-.64s'"

# ER_PARTITION_EXCHANGE_TEMP_TABLE
source: "Table to exchange with partition is temporary: '%-.64s'"
swe: "Tabellen att byta ut mot partition är temporär: '%-.64s'"

# ER_PARTITION_INSTEAD_OF_SUBPARTITION
source: "Subpartitioned table, use subpartition instead of partition"
swe: "Subpartitionerad tabell, använd subpartition istället för partition"
