Repository: vladbogo/test-translation
Catalog: swe.xlf
Languages: swe

# ER_CANT_CREATE_FILE
source: "Can't create file '%-.200s' (errno: %M)"
swe: "Kan inte skapa filen '%-.200s' (Felkod: %M)"

# ER_CANT_CREATE_TABLE
source: "Can't create table %`s.%`s (errno: %M)"
swe: "Kan inte skapa tabellen %`s.%`s (Felkod: %M)"

# ER_CANT_CREATE_DB
source: "Can't create database '%-.192s' (errno: %M)"
swe: "Kan inte skapa databasen '%-.192s' (Felkod: %M)"

# ER_DB_CREATE_EXISTS
source: "Can't create database '%-.192s'; database exists"
swe: "Databasen '%-.192s' existerar redan"

# ER_DB_DROP_EXISTS
source: "Can't drop database '%-.192s'; database doesn't exist"
swe: "Kan inte radera databasen '%-.192s'; databasen finns inte"

# ER_DB_DROP_DELETE
source: "Error dropping database (can't delete '%-.192s', errno: %M)"
swe: "Fel vid radering av databasen (Kan inte radera '%-.192s'. Felkod: %M)"

# ER_DB_DROP_RMDIR
source: "Error dropping database (can't rmdir '%-.192s', errno: %M)"
swe: "Fel vid radering av databasen (Kan inte radera biblioteket '%-.192s'. Felkod: %M)"

# ER_CANT_DELETE_FILE
source: "Error on delete of '%-.192s' (errno: %M)"
swe: "Kan inte radera filen '%-.192s' (Felkod: %M)"

# ER_CANT_FIND_SYSTEM_REC
source: "Can't read record in system table"
swe: "Hittar inte posten i systemregistret"

# ER_CANT_GET_STAT
source: "Can't get status of '%-.200s' (errno: %M)"
swe: "Kan inte läsa filinformationen (stat) från '%-.200s' (Felkod: %M)"

# ER_CANT_GET_WD
source: "Can't get working directory (errno: %M)"
swe: "Kan inte inte läsa aktivt bibliotek. (Felkod: %M)"

# ER_CANT_LOCK
source: "Can't lock file (errno: %M)"
swe: "Kan inte låsa filen. (Felkod: %M)"

# ER_CANT_OPEN_FILE
source: "Can't open file: '%-.200s' (errno: %M)"
swe: "Kan inte använda '%-.200s' (Felkod: %M)"

# ER_FILE_NOT_FOUND
source: "Can't find file: '%-.200s' (errno: %M)"
swe: "Hittar inte filen '%-.200s' (Felkod: %M)"

# ER_CANT_READ_DIR
source: "Can't read dir of '%-.192s' (errno: %M)"
swe: "Kan inte läsa från bibliotek '%-.192s' (Felkod: %M)"

# ER_CANT_SET_WD
source: "Can't change dir to '%-.192s' (errno: %M)"
swe: "Kan inte byta till '%-.192s' (Felkod: %M)"

# ER_CHECKREAD
source: "Record has changed since last read in table '%-.192s'"
swe: "Posten har förändrats sedan den lästes i register '%-.192s'"

# ER_DISK_FULL
source: "Disk full (%s); waiting for someone to free some space... (errno: %M)"
swe: "Disken är full (%s). Väntar tills det finns ledigt utrymme... (Felkod: %M)"

# ER_DUP_KEY 23000
source: "Can't write; duplicate key in table '%-.192s'"
swe: "Kan inte skriva, dubbel söknyckel i register '%-.192s'"

# ER_ERROR_ON_CLOSE
source: "Error on close of '%-.192s' (errno: %M)"
swe: "Fick fel vid stängning av '%-.192s' (Felkod: %M)"

# ER_ERROR_ON_READ
source: "Error reading file '%-.200s' (errno: %M)"
swe: "Fick fel vid läsning av '%-.200s' (Felkod %M)"

# ER_ERROR_ON_RENAME
source: "Error on rename of '%-.210s' to '%-.210s' (errno: %M)"
swe: "Kan inte byta namn från '%-.210s' till '%-.210s' (Felkod: %M)"

# ER_ERROR_ON_WRITE
source: "Error writing file '%-.200s' (errno: %M)"
swe: "Fick fel vid skrivning till '%-.200s' (Felkod %M)"

# ER_FILE_USED
source: "'%-.192s' is locked against change"
swe: "'%-.192s' är låst mot användning"

# ER_FILSORT_ABORT
source: "Sort aborted"
swe: "Sorteringen avbruten"

# ER_FORM_NOT_FOUND
source: "View '%-.192s' doesn't exist for '%-.192s'"
swe: "Formulär '%-.192s' finns inte i '%-.192s'"

# ER_GET_ERRNO
source: "Got error %M from storage engine %s"
swe: "Fick felkod %M från databashanteraren %s"

# ER_KEY_NOT_FOUND
source: "Can't find record in '%-.192s'"
swe: "Hittar inte posten '%-.192s'"

# ER_NOT_FORM_FILE
source: "Incorrect information in file: '%-.200s'"
swe: "Felaktig fil: '%-.200s'"

# ER_NOT_KEYFILE
source: "Index for table '%-.200s' is corrupt; try to repair it"
swe: "Fatalt fel vid hantering av register '%-.200s'; kör en reparation"

# ER_OLD_KEYFILE
source: "Old key file for table '%-.192s'; repair it!"
swe: "Gammal nyckelfil '%-.192s'; reparera registret"

# ER_OPEN_AS_READONLY
source: "Table '%-.192s' is read only"
swe: "'%-.192s' är skyddad mot förändring"

# ER_OUTOFMEMORY HY001 S1001
source: "Out of memory; restart server and try again (needed %d bytes)"
swe: "Oväntat slut på minnet, starta om programmet och försök på nytt (Behövde %d bytes)"

# ER_OUT_OF_SORTMEMORY HY001 S1001
source: "Out of sort memory, consider increasing server sort buffer size"
swe: "Sorteringsbufferten räcker inte till. Kontrollera startparametrarna"

# ER_UNEXPECTED_EOF
source: "Unexpected EOF found when reading file '%-.192s' (errno: %M)"
swe: "Oväntat filslut vid läsning från '%-.192s' (Felkod: %M)"

# ER_CON_COUNT_ERROR 08004
source: "Too many connections"
swe: "För många anslutningar"

# ER_OUT_OF_RESOURCES
source: "Out of memory."
swe: "Fick slut på minnet."

# ER_BAD_HOST_ERROR 08S01
source: "Can't get hostname for your address"
swe: "Kan inte hitta 'hostname' för din adress"

# ER_HANDSHAKE_ERROR 08S01
source: "Bad handshake"
swe: "Fel vid initiering av kommunikationen med klienten"

# ER_DBACCESS_DENIED_ERROR 42000
source: "Access denied for user '%s'@'%s' to database '%-.192s'"
swe: "Användare '%s'@'%s' är ej berättigad att använda databasen %-.192s"

# ER_ACCESS_DENIED_ERROR 28000
source: "Access denied for user '%s'@'%s' (using password: %s)"
swe: "Användare '%s'@'%s' är ej berättigad att logga in (Använder lösen: %s)"

# ER_NO_DB_ERROR 3D000
source: "No database selected"
swe: "Ingen databas i användning"

# ER_UNKNOWN_COM_ERROR 08S01
source: "Unknown command"
swe: "Okänt kommando"

# ER_BAD_NULL_ERROR 23000
source: "Column '%-.192s' cannot be null"
swe: "Kolumn '%-.192s' får inte vara NULL"

# ER_BAD_DB_ERROR 42000
source: "Unknown database '%-.192s'"
swe: "Okänd databas: '%-.192s'"

# ER_TABLE_EXISTS_ERROR 42S01
source: "Table '%-.192s' already exists"
swe: "Tabellen '%-.192s' finns redan"

# ER_BAD_TABLE_ERROR 42S02
source: "Unknown table '%-.100T'"
swe: "Okänd tabell '%-.100T'"

# ER_NON_UNIQ_ERROR 23000
source: "Column '%-.192s' in %-.192s is ambiguous"
swe: "Kolumn '%-.192s' i %-.192s är inte unik"

# ER_SERVER_SHUTDOWN 08S01
source: "Server shutdown in progress"
swe: "Servern går nu ned"

# ER_BAD_FIELD_ERROR 42S22 S0022
source: "Unknown column '%-.192s' in '%-.192s'"
swe: "Okänd kolumn '%-.192s' i %-.192s"

# ER_WRONG_FIELD_WITH_GROUP 42000 S1009
source: "'%-.192s' isn't in GROUP BY"
swe: "'%-.192s' finns inte i GROUP BY"

# ER_WRONG_GROUP_FIELD 42000 S1009
source: "Can't group on '%-.192s'"
swe: "Kan inte använda GROUP BY med '%-.192s'"

# ER_WRONG_SUM_SELECT 42000 S1009
source: "Statement has sum functions and columns in same statement"
swe: "Kommandot har både sum functions och enkla funktioner"

# ER_WRONG_VALUE_COUNT 21S01
source: "Column count doesn't match value count"
swe: "Antalet kolumner motsvarar inte antalet värden"

# ER_TOO_LONG_IDENT 42000 S1009
source: "Identifier name '%-.100T' is too long"
swe: "Kolumnnamn '%-.100T' är för långt"

# ER_DUP_FIELDNAME 42S21 S1009
source: "Duplicate column name '%-.192s'"
swe: "Kolumnnamn '%-.192s finns flera gånger"

# ER_DUP_KEYNAME 42000 S1009
source: "Duplicate key name '%-.192s'"
swe: "Nyckelnamn '%-.192s' finns flera gånger"

# ER_DUP_ENTRY 23000 S1009
source: "Duplicate entry '%-.192T' for key %d"
swe: "Dublett '%-.192T' för nyckel %d"

# ER_WRONG_FIELD_SPEC 42000 S1009
source: "Incorrect column specifier for column '%-.192s'"
swe: "Felaktigt kolumntyp för kolumn '%-.192s'"

# ER_PARSE_ERROR 42000 s1009
source: "%s near '%-.80T' at line %d"
swe: "%s nära '%-.80T' på rad %d"

# ER_EMPTY_QUERY 42000
source: "Query was empty"
swe: "Frågan var tom"

# ER_NONUNIQ_TABLE 42000 S1009
source: "Not unique table/alias: '%-.192s'"
swe: "Icke unikt tabell/alias: '%-.192s'"

# ER_INVALID_DEFAULT 42000 S1009
source: "Invalid default value for '%-.192s'"
swe: "Ogiltigt DEFAULT värde för '%-.192s'"

# ER_MULTIPLE_PRI_KEY 42000 S1009
source: "Multiple primary key defined"
swe: "Flera PRIMARY KEY använda"

# ER_TOO_MANY_KEYS 42000 S1009
source: "Too many keys specified; max %d keys allowed"
swe: "För många nycklar använda. Man får ha högst %d nycklar"

# ER_TOO_MANY_KEY_PARTS 42000 S1009
source: "Too many key parts specified; max %d parts allowed"
swe: "För många nyckeldelar använda. Man får ha högst %d nyckeldelar"

# ER_TOO_LONG_KEY 42000 S1009
source: "Specified key was too long; max key length is %d bytes"
swe: "För lång nyckel. Högsta tillåtna nyckellängd är %d"

# ER_KEY_COLUMN_DOES_NOT_EXIST 42000 S1009
source: "Key column '%-.192s' doesn't exist in table"
swe: "Nyckelkolumn '%-.192s' finns inte"

# ER_TOO_BIG_FIELDLENGTH 42000 S1009
source: "Column length too big for column '%-.192s' (max = %lu); use BLOB or TEXT instead"
swe: "För stor kolumnlängd angiven för '%-.192s' (max= %lu). Använd en BLOB instället"

# ER_WRONG_AUTO_KEY 42000 S1009
source: "Incorrect table definition; there can be only one auto column and it must be defined as a key"
swe: "Det får finnas endast ett AUTO_INCREMENT-fält och detta måste vara en nyckel"

# ER_NORMAL_SHUTDOWN
source: "%s (initiated by: %s): Normal shutdown"
swe: "%s (%s): Normal avslutning"

# ER_GOT_SIGNAL
source: "%s: Got signal %d. Aborting!\n"
swe: "%s: Fick signal %d. Avslutar!\n"

# ER_SHUTDOWN_COMPLETE
source: "%s: Shutdown complete\n"
swe: "%s: Avslutning klar\n"

# ER_FORCING_CLOSE 08S01
source: "%s: Forcing close of thread %ld user: '%-.48s'\n"
swe: "%s: Stänger av tråd %ld; användare: '%-.48s'\n"

# ER_IPSOCK_ERROR 08S01
source: "Can't create IP socket"
swe: "Kan inte skapa IP-socket"

# ER_NO_SUCH_INDEX 42S12 S1009
source: "Table '%-.192s' has no index like the one used in CREATE INDEX; recreate the table"
swe: "Tabellen '%-.192s' har inget index som motsvarar det angivna i CREATE INDEX. Skapa om tabellen"

# ER_WRONG_FIELD_TERMINATORS 42000 S1009
source: "Field separator argument is not what is expected; check the manual"
swe: "Fältseparatorerna är vad som förväntades. Kontrollera mot manualen"

# ER_BLOBS_AND_NO_TERMINATED 42000 S1009
source: "You can't use fixed rowlength with BLOBs; please use 'fields terminated by'"
swe: "Man kan inte använda fast radlängd med blobs. Använd 'fields terminated by'"

# ER_TEXTFILE_NOT_READABLE
source: "The file '%-.128s' must be in the database directory or be readable by all"
swe: "Textfilen '%-.128s' måste finnas i databasbiblioteket eller vara läsbar för alla"

# ER_FILE_EXISTS_ERROR
source: "File '%-.200s' already exists"
swe: "Filen '%-.200s' existerar redan"

# ER_LOAD_INFO
source: "Records: %ld Deleted: %ld Skipped: %ld Warnings: %ld"
swe: "Rader: %ld Bortagna: %ld Dubletter: %ld Varningar: %ld"

# ER_ALTER_INFO
source: "Records: %ld Duplicates: %ld"
swe: "Rader: %ld Dubletter: %ld"

# ER_WRONG_SUB_KEY
source: "Incorrect prefix key; the used key part isn't a string, the used length is longer than the key part, or the storage engine doesn't support unique prefix keys"
swe: "Felaktig delnyckel. Nyckeldelen är inte en sträng eller den angivna längden är längre än kolumnlängden"

# ER_CANT_REMOVE_ALL_FIELDS 42000
source: "You can't delete all columns with ALTER TABLE; use DROP TABLE instead"
swe: "Man kan inte radera alla fält med ALTER TABLE. Använd DROP TABLE istället"

# ER_CANT_DROP_FIELD_OR_KEY 42000
source: "Can't DROP %s %`-.192s; check that it exists"
swe: "Kan inte ta bort (DROP %s) %`-.192s. Kontrollera att begränsningen/fältet/nyckel finns"

# ER_INSERT_INFO
source: "Records: %ld Duplicates: %ld Warnings: %ld"
swe: "Rader: %ld Dubletter: %ld Varningar: %ld"

# ER_UPDATE_TABLE_USED
source: "Table '%-.192s' is specified twice, both as a target for '%s' and as a separate source for data"
swe: "Table '%-.192s' är använd två gånger. Både för '%s' och för att hämta data"

# ER_NO_SUCH_THREAD
source: "Unknown thread id: %lu"
swe: "Finns ingen tråd med id %lu"

# ER_KILL_DENIED_ERROR
source: "You are not owner of thread %lld"
swe: "Du är inte ägare till tråd %lld"

# ER_NO_TABLES_USED
source: "No tables used"
swe: "Inga tabeller angivna"

# ER_TOO_BIG_SET
source: "Too many strings for column %-.192s and SET"
swe: "För många alternativ till kolumn %-.192s för SET"

# ER_NO_UNIQUE_LOGFILE
source: "Can't generate a unique log-filename %-.200s.(1-999)\n"
swe: "Kan inte generera ett unikt filnamn %-.200s.(1-999)\n"

# ER_TABLE_NOT_LOCKED_FOR_WRITE
source: "Table '%-.192s' was locked with a READ lock and can't be updated"
swe: "Tabell '%-.192s' kan inte uppdateras emedan den är låst för läsning"

# ER_TABLE_NOT_LOCKED
source: "Table '%-.192s' was not locked with LOCK TABLES"
swe: "Tabell '%-.192s' är inte låst med LOCK TABLES"

# ER_WRONG_DB_NAME 42000
source: "Incorrect database name '%-.100T'"
swe: "Felaktigt databasnamn '%-.100T'"

# ER_WRONG_TABLE_NAME 42000
source: "Incorrect table name '%-.100s'"
swe: "Felaktigt tabellnamn '%-.100s'"

# ER_TOO_BIG_SELECT 42000
source: "The SELECT would examine more than MAX_JOIN_SIZE rows; check your WHERE and use SET SQL_BIG_SELECTS=1 or SET MAX_JOIN_SIZE=# if the SELECT is okay"
swe: "Den angivna frågan skulle läsa mer än MAX_JOIN_SIZE rader. Kontrollera din WHERE och använd SET SQL_BIG_SELECTS=1 eller SET MAX_JOIN_SIZE=# ifall du vill hantera stora joins"

# ER_UNKNOWN_ERROR
source: "Unknown error"
swe: "Okänt fel"

# ER_UNKNOWN_PROCEDURE 42000
source: "Unknown procedure '%-.192s'"
swe: "Okänd procedur: %-.192s"

# ER_WRONG_PARAMCOUNT_TO_PROCEDURE 42000
source: "Incorrect parameter count to procedure '%-.192s'"
swe: "Felaktigt antal parametrar till procedur %-.192s"

# ER_WRONG_PARAMETERS_TO_PROCEDURE
source: "Incorrect parameters to procedure '%-.192s'"
swe: "Felaktiga parametrar till procedur %-.192s"

# ER_UNKNOWN_TABLE 42S02
source: "Unknown table '%-.192s' in %-.32s"
swe: "Okänd tabell '%-.192s' i '%-.32s'"

# ER_FIELD_SPECIFIED_TWICE 42000
source: "Column '%-.192s' specified twice"
swe: "Fält '%-.192s' är redan använt"

# ER_INVALID_GROUP_FUNC_USE
source: "Invalid use of group function"
swe: "Felaktig användning av SQL grupp function"

# ER_UNSUPPORTED_EXTENSION 42000
source: "Table '%-.192s' uses an extension that doesn't exist in this MariaDB version"
swe: "Tabell '%-.192s' har en extension som inte finns i denna version av MariaDB"

# ER_TABLE_MUST_HAVE_COLUMNS 42000
source: "A table must have at least 1 column"
swe: "Tabeller måste ha minst 1 kolumn"

# ER_RECORD_FILE_FULL
source: "The table '%-.192s' is full"
swe: "Tabellen '%-.192s' är full"

# ER_UNKNOWN_CHARACTER_SET 42000
source: "Unknown character set: '%-.64s'"
swe: "Okänd teckenuppsättning: '%-.64s'"

# ER_TOO_MANY_TABLES
source: "Too many tables; MariaDB can only use %d tables in a join"
swe: "För många tabeller. MariaDB can ha högst %d tabeller i en och samma join"

# ER_TOO_MANY_FIELDS
source: "Too many columns"
swe: "För många fält"

# ER_TOO_BIG_ROWSIZE 42000
source: "Row size too large. The maximum row size for the used table type, not counting BLOBs, is %ld. This includes storage overhead, check the manual. You have to change some columns to TEXT or BLOBs"
swe: "För stor total radlängd. Den högst tillåtna radlängden, förutom BLOBs, är %ld. Ändra några av dina fält till BLOB"

# ER_STACK_OVERRUN
source: "Thread stack overrun: Used: %ld of a %ld stack. Use 'mariadbd --thread_stack=#' to specify a bigger stack if needed"
swe: "Trådstacken tog slut: Har använt %ld av %ld bytes. Använd 'mariadbd --thread_stack=#' ifall du behöver en större stack"

# ER_WRONG_OUTER_JOIN 42000
source: "Cross dependency found in OUTER JOIN; examine your ON conditions"
swe: "Felaktigt referens i OUTER JOIN. Kontrollera ON-uttrycket"

# ER_NULL_COLUMN_IN_INDEX 42000
source: "Table handler doesn't support NULL in given index. Please change column '%-.192s' to be NOT NULL or use another handler"
swe: "Tabell hanteraren kan inte indexera NULL kolumner för den givna index typen. Ändra '%-.192s' till NOT NULL eller använd en annan hanterare"

# ER_CANT_FIND_UDF
source: "Can't load function '%-.192s'"
swe: "Kan inte ladda funktionen '%-.192s'"

# ER_CANT_INITIALIZE_UDF
source: "Can't initialize function '%-.192s'; %-.80s"
swe: "Kan inte initialisera funktionen '%-.192s'; '%-.80s'"

# ER_UDF_NO_PATHS
source: "No paths allowed for shared library"
swe: "Man får inte ange sökväg för dynamiska bibliotek"

# ER_UDF_EXISTS
source: "Function '%-.192s' already exists"
swe: "Funktionen '%-.192s' finns redan"

# ER_CANT_OPEN_LIBRARY
source: "Can't open shared library '%-.192s' (errno: %d, %-.128s)"
swe: "Kan inte öppna det dynamiska biblioteket '%-.192s' (Felkod: %d, %-.128s)"

# ER_CANT_FIND_DL_ENTRY
source: "Can't find symbol '%-.128s' in library"
swe: "Hittar inte funktionen '%-.128s' in det dynamiska biblioteket"

# ER_FUNCTION_NOT_DEFINED
source: "Function '%-.192s' is not defined"
swe: "Funktionen '%-.192s' är inte definierad"

# ER_HOST_IS_BLOCKED
source: "Host '%-.64s' is blocked because of many connection errors; unblock with 'mariadb-admin flush-hosts'"
swe: "Denna dator, '%-.64s', är blockerad pga många felaktig paket. Gör 'mariadb-admin flush-hosts' för att ta bort alla blockeringarna"

# ER_HOST_NOT_PRIVILEGED
source: "Host '%-.64s' is not allowed to connect to this MariaDB server"
swe: "Denna dator, '%-.64s', har inte privileger att använda denna MariaDB server"

# ER_PASSWORD_ANONYMOUS_USER 42000
source: "You are using MariaDB as an anonymous user and anonymous users are not allowed to modify user settings"
swe: "Du använder MariaDB som en anonym användare och som sådan får du inte ändra ditt lösenord"

# ER_PASSWORD_NOT_ALLOWED 42000
source: "You must have privileges to update tables in the mysql database to be able to change passwords for others"
swe: "För att ändra lösenord för andra måste du ha rättigheter att uppdatera mysql-databasen"

# ER_PASSWORD_NO_MATCH 28000
source: "Can't find any matching row in the user table"
swe: "Hittade inte användaren i 'user'-tabellen"

# ER_UPDATE_INFO
source: "Rows matched: %ld Changed: %ld Warnings: %ld"
swe: "Rader: %ld Uppdaterade: %ld Varningar: %ld"

# ER_CANT_CREATE_THREAD
source: "Can't create a new thread (errno %M); if you are not out of available memory, you can consult the manual for a possible OS-dependent bug"
swe: "Kan inte skapa en ny tråd (errno %M)"

# ER_WRONG_VALUE_COUNT_ON_ROW 21S01
source: "Column count doesn't match value count at row %lu"
swe: "Antalet kolumner motsvarar inte antalet värden på rad: %lu"

# ER_CANT_REOPEN_TABLE
source: "Can't reopen table: '%-.192s'"
swe: "Kunde inte stänga och öppna tabell '%-.192s"

# ER_INVALID_USE_OF_NULL 22004
source: "Invalid use of NULL value"
swe: "Felaktig använding av NULL"

# ER_REGEXP_ERROR 42000
source: "Regex error '%s'"
swe: "Fick fel '%s' från REGEXP"

# ER_MIX_OF_GROUP_FUNC_AND_FIELDS 42000
source: "Mixing of GROUP columns (MIN(),MAX(),COUNT(),...) with no GROUP columns is illegal if there is no GROUP BY clause"
swe: "Man får ha både GROUP-kolumner (MIN(),MAX(),COUNT()...) och fält i en fråga om man inte har en GROUP BY-del"

# ER_NONEXISTING_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s'"
swe: "Det finns inget privilegium definierat för användare '%-.48s' på '%-.64s'"

# ER_TABLEACCESS_DENIED_ERROR 42000
source: "%-.100T command denied to user '%s'@'%s' for table '%-.192s'"
swe: "%-.100T ej tillåtet för '%s'@'%s' för tabell '%-.192s'"

# ER_COLUMNACCESS_DENIED_ERROR 42000
source: "%-.32s command denied to user '%s'@'%s' for column '%-.192s' in table '%-.192s'"
swe: "%-.32s ej tillåtet för '%s'@'%s' för kolumn '%-.192s' i tabell '%-.192s'"

# ER_ILLEGAL_GRANT_FOR_TABLE 42000
source: "Illegal GRANT/REVOKE command; please consult the manual to see which privileges can be used"
swe: "Felaktigt GRANT-privilegium använt"

# ER_GRANT_WRONG_HOST_OR_USER 42000
source: "The host or user argument to GRANT is too long"
swe: "Felaktigt maskinnamn eller användarnamn använt med GRANT"

# ER_NO_SUCH_TABLE 42S02
source: "Table '%-.192s.%-.192s' doesn't exist"
swe: "Det finns ingen tabell som heter '%-.192s.%-.192s'"

# ER_NONEXISTING_TABLE_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s' on table '%-.192s'"
swe: "Det finns inget privilegium definierat för användare '%-.48s' på '%-.64s' för tabell '%-.192s'"

# ER_NOT_ALLOWED_COMMAND 42000
source: "The used command is not allowed with this MariaDB version"
swe: "Du kan inte använda detta kommando med denna MariaDB version"

# ER_SYNTAX_ERROR 42000
source: "You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use"
swe: "Du har något fel i din syntax"

# ER_DELAYED_CANT_CHANGE_LOCK
source: "Delayed insert thread couldn't get requested lock for table %-.192s"
swe: "DELAYED INSERT-tråden kunde inte låsa tabell '%-.192s'"

# ER_TOO_MANY_DELAYED_THREADS
source: "Too many delayed threads in use"
swe: "Det finns redan 'max_delayed_threads' trådar i använding"

# ER_ABORTING_CONNECTION 08S01
source: "Aborted connection %ld to db: '%-.192s' user: '%-.48s' (%-.64s)"
swe: "Avbröt länken för tråd %ld till db '%-.192s', användare '%-.48s' (%-.64s)"

# ER_NET_PACKET_TOO_LARGE 08S01
source: "Got a packet bigger than 'max_allowed_packet' bytes"
swe: "Kommunkationspaketet är större än 'max_allowed_packet'"

# ER_NET_READ_ERROR_FROM_PIPE 08S01
source: "Got a read error from the connection pipe"
swe: "Fick läsfel från klienten vid läsning från 'PIPE'"

# ER_NET_FCNTL_ERROR 08S01
source: "Got an error from fcntl()"
swe: "Fick fatalt fel från 'fcntl()'"

# ER_NET_PACKETS_OUT_OF_ORDER 08S01
source: "Got packets out of order"
swe: "Kommunikationspaketen kom i fel ordning"

# ER_NET_UNCOMPRESS_ERROR 08S01
source: "Couldn't uncompress communication packet"
swe: "Kunde inte packa up kommunikationspaketet"

# ER_NET_READ_ERROR 08S01
source: "Got an error reading communication packets"
swe: "Fick ett fel vid läsning från klienten"

# ER_NET_READ_INTERRUPTED 08S01
source: "Got timeout reading communication packets"
swe: "Fick 'timeout' vid läsning från klienten"

# ER_NET_ERROR_ON_WRITE 08S01
source: "Got an error writing communication packets"
swe: "Fick ett fel vid skrivning till klienten"

# ER_NET_WRITE_INTERRUPTED 08S01
source: "Got timeout writing communication packets"
swe: "Fick 'timeout' vid skrivning till klienten"

# ER_TOO_LONG_STRING 42000
source: "Result string is longer than 'max_allowed_packet' bytes"
swe: "Resultatsträngen är längre än max_allowed_packet"

# ER_TABLE_CANT_HANDLE_BLOB 42000
source: "Storage engine %s doesn't support BLOB/TEXT columns"
swe: "Den använda tabelltypen (%s) kan inte hantera BLOB/TEXT-kolumner"

# ER_TABLE_CANT_HANDLE_AUTO_INCREMENT 42000
source: "Storage engine %s doesn't support AUTO_INCREMENT columns"
swe: "Den använda tabelltypen (%s) kan inte hantera AUTO_INCREMENT-kolumner"

# ER_DELAYED_INSERT_TABLE_LOCKED
source: "INSERT DELAYED can't be used with table '%-.192s' because it is locked with LOCK TABLES"
swe: "INSERT DELAYED kan inte användas med tabell '%-.192s', emedan den är låst med LOCK TABLES"

# ER_WRONG_COLUMN_NAME 42000
source: "Incorrect column name '%-.100s'"
swe: "Felaktigt kolumnnamn '%-.100s'"

# ER_WRONG_MRG_TABLE
source: "Unable to open underlying table which is differently defined or of non-MyISAM type or doesn't exist"
swe: "Tabellerna i MERGE-tabellen är inte identiskt definierade"

# ER_DUP_UNIQUE 23000
source: "Can't write, because of unique constraint, to table '%-.192s'"
swe: "Kan inte skriva till tabell '%-.192s'; UNIQUE-test"

# ER_BLOB_KEY_WITHOUT_LENGTH 42000
source: "BLOB/TEXT column '%-.192s' used in key specification without a key length"
swe: "Du har inte angett någon nyckellängd för BLOB '%-.192s'"

# ER_PRIMARY_CANT_HAVE_NULL 42000
source: "All parts of a PRIMARY KEY must be NOT NULL; if you need NULL in a key, use UNIQUE instead"
swe: "Alla delar av en PRIMARY KEY måste vara NOT NULL; Om du vill ha en nyckel med NULL, använd UNIQUE istället"

# ER_TOO_MANY_ROWS 42000
source: "Result consisted of more than one row"
swe: "Resultet bestod av mera än en rad"
