Repository: vladbogo/test-translation
Catalog: swe.xlf
Languages: swe

# ER_UNKNOWN_PARTITION
source: "Unknown partition '%-.64s' in table '%-.64s'"
swe: "Okänd partition '%-.64s' i tabell '%-.64s'"

# ER_TABLES_DIFFERENT_METADATA
source: "Tables have different definitions"
swe: "Tabellerna har olika definitioner"

# ER_ROW_DOES_NOT_MATCH_PARTITION
source: "Found a row that does not match the partition"
swe: "Hittade en rad som inte passar i partitionen"

# ER_PARTITION_EXCHANGE_FOREIGN_KEY
source: "Table to exchange with partition has foreign key references: '%-.64s'"
swe: "Tabellen att byta ut mot partition har foreign key referenser: '%-.64s'"

# ER_PARTITION_CLAUSE_ON_NONPARTITIONED
source: "PARTITION () clause on non partitioned table"
swe: "PARTITION () klausul för en icke partitionerad tabell"

# ER_ROW_DOES_NOT_MATCH_GIVEN_PARTITION_SET
source: "Found a row not matching the given partition set"
swe: "Hittade en rad som inte passar i någon given partition"

# ER_FULLTEXT_NOT_SUPPORTED_WITH_PARTITIONING
source: "FULLTEXT index is not supported for partitioned tables"
swe: "FULLTEXT index stöds ej för partitionerade tabeller"

# ER_FOREIGN_DUPLICATE_KEY_WITH_CHILD_INFO 23000 S1009
source: "Foreign key constraint for table '%.192s', record '%-.192s' would lead to a duplicate entry in table '%.192s', key '%.192s'"
swe: "FOREIGN KEY constraint för tabell '%.192s', posten '%-.192s' kan inte uppdatera barntabell '%.192s' på grund av nyckel '%.192s'"

# ER_FOREIGN_DUPLICATE_KEY_WITHOUT_CHILD_INFO 23000 S1009
source: "Foreign key constraint for table '%.192s', record '%-.192s' would lead to a duplicate entry in a child table"
swe: "FOREIGN KEY constraint för tabell '%.192s', posten '%-.192s' kan inte uppdatera en barntabell på grund av UNIQUE-test"

# ER_DUP_UNKNOWN_IN_INDEX 23000
source: "Duplicate entry for key '%-.192s'"
swe: "Dublett för nyckel '%-.192s'"

# ER_ROW_IN_WRONG_PARTITION
source: "Found a row in wrong partition %s"
swe: "Hittade en rad i fel partition %s"

# ER_NO_SUCH_TABLE_IN_ENGINE 42S02
source: "Table '%-.192s.%-.192s' doesn't exist in engine"
swe: "Det finns ingen tabell som heter '%-.192s.%-.192s' i handlern"

# ER_SLAVE_IGNORED_SHARED_TABLE
source: "Slave SQL thread ignored the '%s' because table is shared"
swe: "Slav SQL tråden ignorerade '%s' pga tabellen är delad"
