Repository: vladbogo/test-translation
Catalog: ukr.xlf
Languages: ukr

# ER_WRONG_COLUMN_NAME 42000
source: "Incorrect column name '%-.100s'"
ukr: "Невірне ім'я стовбця '%-.100s'"

# ER_WRONG_KEY_COLUMN 42000
source: "The storage engine %s can't index column %`s"
ukr: "Вказівник таблиц %s не може індексувати стовбець %`s"

# ER_WRONG_MRG_TABLE
source: "Unable to open underlying table which is differently defined or of non-MyISAM type or doesn't exist"
ukr: "Таблиці у MERGE TABLE мають різну структуру"

# ER_DUP_UNIQUE 23000
source: "Can't write, because of unique constraint, to table '%-.192s'"
ukr: "Не можу записати до таблиці '%-.192s', з причини вимог унікальності"

# ER_BLOB_KEY_WITHOUT_LENGTH 42000
source: "BLOB/TEXT column '%-.192s' used in key specification without a key length"
ukr: "Стовбець BLOB '%-.192s' використано у визначенні ключа без вказання довжини ключа"

# ER_PRIMARY_CANT_HAVE_NULL 42000
source: "All parts of a PRIMARY KEY must be NOT NULL; if you need NULL in a key, use UNIQUE instead"
ukr: "Усі частини PRIMARY KEY повинні бути NOT NULL; Якщо ви потребуєте NULL у ключі, скористайтеся UNIQUE"

# ER_TOO_MANY_ROWS 42000
source: "Result consisted of more than one row"
ukr: "Результат знаходиться у більше ніж одній строці"

# ER_REQUIRES_PRIMARY_KEY 42000
source: "This table type requires a primary key"
ukr: "Цей тип таблиці потребує первинного ключа"

# ER_NO_RAID_COMPILED
source: "This version of MariaDB is not compiled with RAID support"
ukr: "Ця версія MariaDB не зкомпільована з підтримкою RAID"

# ER_UPDATE_WITHOUT_KEY_IN_SAFE_MODE
source: "You are using safe update mode and you tried to update a table without a WHERE that uses a KEY column"
ukr: "Ви у режимі безпечного оновлення та намагаєтесь оновити таблицю без оператора WHERE, що використовує KEY стовбець"

# ER_KEY_DOES_NOT_EXISTS 42000 S1009
source: "Key '%-.192s' doesn't exist in table '%-.192s'"
ukr: "Ключ '%-.192s' не існує в таблиці '%-.192s'"

# ER_CHECK_NO_SUCH_TABLE 42000
source: "Can't open table"
ukr: "Не можу відкрити таблицю"

# ER_CHECK_NOT_IMPLEMENTED 42000
source: "The storage engine for the table doesn't support %s"
ukr: "Вказівник таблиці не підтримуе %s"

# ER_CANT_DO_THIS_DURING_AN_TRANSACTION 25000
source: "You are not allowed to execute this command in a transaction"
ukr: "Вам не дозволено виконувати цю команду в транзакції"

# ER_ERROR_DURING_COMMIT
source: "Got error %M during COMMIT"
ukr: "Отримано помилку %M під час COMMIT"

# ER_ERROR_DURING_ROLLBACK
source: "Got error %M during ROLLBACK"
ukr: "Отримано помилку %M під час ROLLBACK"

# ER_ERROR_DURING_FLUSH_LOGS
source: "Got error %M during FLUSH_LOGS"
ukr: "Отримано помилку %M під час FLUSH_LOGS"

# ER_ERROR_DURING_CHECKPOINT
source: "Got error %M during CHECKPOINT"
ukr: "Отримано помилку %M під час CHECKPOINT"

# ER_NEW_ABORTING_CONNECTION 08S01
source: "Aborted connection %lld to db: '%-.192s' user: '%-.48s' host: '%-.64s' (%-.64s)"
ukr: "Перервано з'єднання %lld до бази данних: '%-.192s' користувач: '%-.48s' хост: '%-.64s' (%-.64s)"

# ER_FLUSH_MASTER_BINLOG_CLOSED
source: "Binlog closed, cannot RESET MASTER"
ukr: "Реплікаційний лог закрито, не можу виконати RESET MASTER"

# ER_INDEX_REBUILD
source: "Failed rebuilding the index of dumped table '%-.192s'"
ukr: "Невдале відновлення індекса переданої таблиці '%-.192s'"

# ER_MASTER
source: "Error from master: '%-.64s'"
ukr: "Помилка від головного: '%-.64s'"

# ER_MASTER_NET_READ 08S01
source: "Net error reading from master"
ukr: "Мережева помилка читання від головного"

# ER_MASTER_NET_WRITE 08S01
source: "Net error writing to master"
ukr: "Мережева помилка запису до головного"

# ER_FT_MATCHING_KEY_NOT_FOUND
source: "Can't find FULLTEXT index matching the column list"
ukr: "Не можу знайти FULLTEXT індекс, що відповідає переліку стовбців"

# ER_LOCK_OR_ACTIVE_TRANSACTION
source: "Can't execute the given command because you have active locked tables or an active transaction"
ukr: "Не можу виконати подану команду тому, що таблиця заблокована або виконується транзакція"

# ER_UNKNOWN_SYSTEM_VARIABLE
source: "Unknown system variable '%-.*s'"
ukr: "Невідома системна змінна '%-.*s'"

# ER_CRASHED_ON_USAGE
source: "Table '%-.192s' is marked as crashed and should be repaired"
ukr: "Таблицю '%-.192s' марковано як зіпсовану та її потрібно відновити"

# ER_CRASHED_ON_REPAIR
source: "Table '%-.192s' is marked as crashed and last (automatic?) repair failed"
ukr: "Таблицю '%-.192s' марковано як зіпсовану та останнє (автоматичне?) відновлення не вдалося"

# ER_WARNING_NOT_COMPLETE_ROLLBACK
source: "Some non-transactional changed tables couldn't be rolled back"
ukr: "Застереження: Деякі нетранзакційні зміни таблиць не можна буде повернути"

# ER_TRANS_CACHE_FULL
source: "Multi-statement transaction required more than 'max_binlog_cache_size' bytes of storage; increase this mariadbd variable and try again"
ukr: "Транзакція з багатьма виразами вимагає більше ніж 'max_binlog_cache_size' байтів для зберігання. Збільште цю змінну mariadbd та спробуйте знову"

# ER_SLAVE_MUST_STOP
source: "This operation cannot be performed as you have a running slave '%2$*1$s'; run STOP SLAVE '%2$*1$s' first"
ukr: "Операція не може бути виконана з запущеним підлеглим '%2$*1$s', спочатку виконайте STOP SLAVE '%2$*1$s'"

# ER_SLAVE_NOT_RUNNING
source: "This operation requires a running slave; configure slave and do START SLAVE"
ukr: "Операція вимагає запущеного підлеглого, зконфігуруйте підлеглого та виконайте START SLAVE"

# ER_BAD_SLAVE
source: "The server is not configured as slave; fix in config file or with CHANGE MASTER TO"
ukr: "Сервер не зконфігуровано як підлеглий, виправте це у файлі конфігурації або з CHANGE MASTER TO"

# ER_MASTER_INFO
source: "Could not initialize master info structure for '%.*s'; more error messages can be found in the MariaDB error log"
ukr: "Інформаційна структура з'єднання головного і підлеглого (master.info) для '%.*s' не може бути ініціалізована"

# ER_SLAVE_THREAD
source: "Could not create slave thread; check system resources"
ukr: "Не можу створити підлеглу гілку, перевірте системні ресурси"

# ER_TOO_MANY_USER_CONNECTIONS 42000
source: "User %-.64s already has more than 'max_user_connections' active connections"
ukr: "Користувач %-.64s вже має більше ніж 'max_user_connections' активних з'єднань"

# ER_SET_CONSTANTS_ONLY
source: "You may only use constant expressions in this statement"
ukr: "Можна використовувати лише вирази зі сталими у SET"

# ER_LOCK_WAIT_TIMEOUT
source: "Lock wait timeout exceeded; try restarting transaction"
ukr: "Затримку очікування блокування вичерпано"

# ER_LOCK_TABLE_FULL
source: "The total number of locks exceeds the lock table size"
ukr: "Загальна кількість блокувань перевищила розмір блокувань для таблиці"

# ER_READ_ONLY_TRANSACTION 25000
source: "Update locks cannot be acquired during a READ UNCOMMITTED transaction"
ukr: "Оновити блокування не можливо на протязі транзакції READ UNCOMMITTED"

# ER_DROP_DB_WITH_READ_LOCK
source: "DROP DATABASE not allowed while thread is holding global read lock"
ukr: "DROP DATABASE не дозволено доки гілка перебуває під загальним блокуванням читання"

# ER_CREATE_DB_WITH_READ_LOCK
source: "CREATE DATABASE not allowed while thread is holding global read lock"
ukr: "CREATE DATABASE не дозволено доки гілка перебуває під загальним блокуванням читання"

# ER_WRONG_ARGUMENTS
source: "Incorrect arguments to %s"
ukr: "Хибний аргумент для %s"

# ER_NO_PERMISSION_TO_CREATE_USER 42000
source: "'%s'@'%s' is not allowed to create new users"
ukr: "Користувачу '%s'@'%s' не дозволено створювати нових користувачів"

# ER_UNION_TABLES_IN_DIFFERENT_DIR
source: "Incorrect table definition; all MERGE tables must be in the same database"
ukr: "Хибне визначення таблиці; всі MERGE-таблиці повинні належити до однієї бази ланних."

# ER_LOCK_DEADLOCK 40001
source: "Deadlock found when trying to get lock; try restarting transaction"
ukr: "Взаємне блокування знайдено під час спроби отримати блокування; спробуйте перезапустити транзакцію."

# ER_TABLE_CANT_HANDLE_FT
source: "The storage engine %s doesn't support FULLTEXT indexes"
ukr: "Використаний тип таблиці (%s) не підтримує FULLTEXT індексів"

# ER_CANNOT_ADD_FOREIGN
source: "Cannot add foreign key constraint for `%s`"
ukr: "Не можу додати обмеження зовнішнього ключа Ha `%s`"

# ER_NO_REFERENCED_ROW 23000
source: "Cannot add or update a child row: a foreign key constraint fails"
ukr: "Не вдається додати або оновити дочірній рядок: невдала перевірка обмеження зовнішнього ключа"

# ER_WRONG_USAGE
source: "Incorrect usage of %s and %s"
ukr: "Wrong usage of %s and %s"

# ER_SPECIFIC_ACCESS_DENIED_ERROR 42000
source: "Access denied; you need (at least one of) the %-.128s privilege(s) for this operation"
ukr: "Access denied. You need the %-.128s privilege for this operation"

# ER_OPERAND_COLUMNS 21000
source: "Operand should contain %d column(s)"
ukr: "Операнд має складатися з %d стовбців"

# ER_SUBQUERY_NO_1_ROW 21000
source: "Subquery returns more than 1 row"
ukr: "Підзапит повертає більш нiж 1 запис"

# ER_CYCLIC_REFERENCE
source: "Cyclic reference on subqueries"
ukr: "Циклічне посилання на підзапит"

# ER_AUTO_CONVERT
source: "Converting column '%s' from %s to %s"
ukr: "Перетворення стовбца '%s' з %s у %s"

# ER_ILLEGAL_REFERENCE 42S22
source: "Reference '%-.64s' not supported (%s)"
ukr: "Посилання '%-.64s' не пiдтримуется (%s)"

# ER_SELECT_REDUCED 01000
source: "Select %u was reduced during optimization"
ukr: "Select %u was скасовано при оптимiзацii"

# ER_WARN_FIELD_RESOLVED
source: "Field or reference '%-.192s%s%-.192s%s%-.192s' of SELECT #%d was resolved in SELECT #%d"
ukr: "Стовбець або посилання '%-.192s%s%-.192s%s%-.192s' із SELECTу #%d було знайдене у SELECTі #%d"

# ER_WARN_QC_RESIZE
source: "Query cache failed to set size %llu; new query cache size is %lu"
ukr: "Кеш запитів неспроможен встановити розмір %llu, новий розмір кеша запитів - %lu"

# ER_NON_UPDATABLE_TABLE
source: "The target table %-.100s of the %s is not updatable"
ukr: "Таблиця %-.100s у %s не може оновлюватись"

# ER_FPARSER_TOO_BIG_FILE
source: "Configuration file '%-.192s' is too big"
ukr: "Занадто великий конфігураційний файл '%-.192s'"

# ER_FPARSER_BAD_HEADER
source: "Malformed file type header in file '%-.192s'"
ukr: "Невірний заголовок типу у файлі '%-.192s'"

# ER_FPARSER_EOF_IN_COMMENT
source: "Unexpected end of file while parsing comment '%-.200s'"
ukr: "Несподіванний кінець файлу у коментарі '%-.200s'"

# ER_FPARSER_ERROR_IN_PARAMETER
source: "Error while parsing parameter '%-.192s' (line: '%-.192s')"
ukr: "Помилка в роспізнаванні параметру '%-.192s' (рядок: '%-.192s')"

# ER_FPARSER_EOF_IN_UNKNOWN_PARAMETER
source: "Unexpected end of file while skipping unknown parameter '%-.192s'"
ukr: "Несподіванний кінець файлу у спробі проминути невідомий параметр '%-.192s'"

# ER_VIEW_NO_EXPLAIN
source: "ANALYZE/EXPLAIN/SHOW can not be issued; lacking privileges for underlying table"
ukr: "ANALYZE/EXPLAIN/SHOW не може бути виконано; немає прав на таблиці запиту"

# ER_FRM_UNKNOWN_TYPE
source: "File '%-.192s' has unknown type '%-.64s' in its header"
ukr: "Файл '%-.192s' має невідомий тип '%-.64s' у заголовку"

# ER_WRONG_OBJECT
source: "'%-.192s.%-.192s' is not of type '%s'"
ukr: "'%-.192s.%-.192s' не є %s"

# ER_NONUPDATEABLE_COLUMN
source: "Column '%-.192s' is not updatable"
ukr: "Стовбець '%-.192s' не може бути зминений"

# ER_VIEW_SELECT_DERIVED
source: "View's SELECT contains a subquery in the FROM clause"
ukr: "View SELECT має підзапит у конструкції FROM"

# ER_VIEW_SELECT_CLAUSE
source: "View's SELECT contains a '%s' clause"
ukr: "View SELECT має конструкцію '%s'"

# ER_VIEW_SELECT_VARIABLE
source: "View's SELECT contains a variable or parameter"
ukr: "View SELECT має зминну або параметер"

# ER_VIEW_SELECT_TMPTABLE
source: "View's SELECT refers to a temporary table '%-.192s'"
ukr: "View SELECT використовує тимчасову таблицю '%-.192s'"

# ER_VIEW_WRONG_LIST
source: "View's SELECT and view's field list have different column counts"
ukr: "View SELECT і перелік стовбців view мають різну кількість сковбців"

# ER_WARN_VIEW_MERGE
source: "View merge algorithm can't be used here for now (assumed undefined algorithm)"
ukr: "Алгоритм зливання view не може бути використаний зараз (алгоритм буде невизначений)"

# ER_WARN_VIEW_WITHOUT_KEY
source: "View being updated does not have complete key of underlying table in it"
ukr: "View, що оновлюеться, не містить повного ключа таблиці(ь), що викорістана в ньюому"

# ER_VIEW_NONUPD_CHECK
source: "CHECK OPTION on non-updatable view %`-.192s.%`-.192s"
ukr: "CHECK OPTION для VIEW %`-.192s.%`-.192s що не може бути оновленним"

# ER_VIEW_CHECK_FAILED 44000
source: "CHECK OPTION failed %`-.192s.%`-.192s"
ukr: "Перевірка CHECK OPTION для VIEW %`-.192s.%`-.192s не пройшла"

# ER_VIEW_CHECKSUM
source: "View text checksum failed"
ukr: "Перевірка контрольної суми тексту VIEW не пройшла"

# ER_VIEW_MULTIUPDATE
source: "Can not modify more than one base table through a join view '%-.192s.%-.192s'"
ukr: "Неможливо оновити більш ниж одну базову таблицю выкористовуючи VIEW '%-.192s.%-.192s', що містіть декілька таблиць"

# ER_VIEW_NO_INSERT_FIELD_LIST
source: "Can not insert into join view '%-.192s.%-.192s' without fields list"
ukr: "Неможливо уставити рядки у VIEW '%-.192s.%-.192s', що містить декілька таблиць, без списку стовбців"

# ER_VIEW_DELETE_MERGE_VIEW
source: "Can not delete from join view '%-.192s.%-.192s'"
ukr: "Неможливо видалити рядки у VIEW '%-.192s.%-.192s', що містить декілька таблиць"

# ER_SP_PROC_TABLE_CORRUPT
source: "Failed to load routine %-.192s (internal code %d). For more details, run SHOW WARNINGS"
ukr: "Невдала спроба завантажити процедуру %-.192s (внутрішний код %d). Для отримання детальної інформації використовуйте SHOW WARNINGS"

# ER_DUP_ENTRY_WITH_KEY_NAME 23000 S1009
source: "Duplicate entry '%-.64T' for key '%-.192s'"
ukr: "Дублюючий запис '%-.64T' для ключа '%-.192s'"

# ER_ACCESS_DENIED_NO_PASSWORD_ERROR 28000
source: "Access denied for user '%s'@'%s'"
ukr: "Доступ заборонено для користувача: '%s'@'%s'"

# ER_DUP_UNKNOWN_IN_INDEX 23000
source: "Duplicate entry for key '%-.192s'"
ukr: "Дублюючий запис для ключа '%-.192s'"

# ER_NO_EIS_FOR_FIELD
source: "Engine-independent statistics are not collected for column '%s'"
ukr: "Незалежна від типу таблиці статистика не збирається для стовбця '%s'"

# ER_WARN_AGGFUNC_DEPENDENCE
source: "Aggregate function '%-.192s)' of SELECT #%d belongs to SELECT #%d"
ukr: "Агрегатна функція '%-.192s)' з SELECTу #%d належить до SELECTу #%d"

# ER_CONSTRAINT_FAILED 23000
source: "CONSTRAINT %`s failed for %`-.192s.%`-.192s"
ukr: "Перевірка CONSTRAINT %`s для %`-.192s.%`-.192s не пройшла"

# ER_PARTITION_DEFAULT_ERROR
source: "Only one DEFAULT partition allowed"
ukr: "Припустимо мати тільки один DEFAULT розділ"

# ER_INVALID_DEFAULT_PARAM
source: "Default/ignore value is not supported for such parameter usage"
ukr: "Значення за замовчуванням або ігнороване значення не підтримано для цього випадку використання параьетра"
