Repository: vladbogo/test-translation
Catalog: ukr.xlf
Languages: ukr

# ER_NO
source: "NO"
ukr: "НІ"

# ER_YES
source: "YES"
ukr: "ТАК"

# ER_CANT_CREATE_FILE
source: "Can't create file '%-.200s' (errno: %M)"
ukr: "Не можу створити файл '%-.200s' (помилка: %M)"

# ER_CANT_CREATE_TABLE
source: "Can't create table %`s.%`s (errno: %M)"
ukr: "Не можу створити таблицю %`s.%`s (помилка: %M)"

# ER_CANT_CREATE_DB
source: "Can't create database '%-.192s' (errno: %M)"
ukr: "Не можу створити базу данних '%-.192s' (помилка: %M)"

# ER_DB_CREATE_EXISTS
source: "Can't create database '%-.192s'; database exists"
ukr: "Не можу створити базу данних '%-.192s'. База данних існує"

# ER_DB_DROP_EXISTS
source: "Can't drop database '%-.192s'; database doesn't exist"
ukr: "Не можу видалити базу данних '%-.192s'. База данних не існує"

# ER_DB_DROP_DELETE
source: "Error dropping database (can't delete '%-.192s', errno: %M)"
ukr: "Не можу видалити базу данних (Не можу видалити '%-.192s', помилка: %M)"

# ER_DB_DROP_RMDIR
source: "Error dropping database (can't rmdir '%-.192s', errno: %M)"
ukr: "Не можу видалити базу данних (Не можу видалити теку '%-.192s', помилка: %M)"

# ER_CANT_DELETE_FILE
source: "Error on delete of '%-.192s' (errno: %M)"
ukr: "Не можу видалити '%-.192s' (помилка: %M)"

# ER_CANT_FIND_SYSTEM_REC
source: "Can't read record in system table"
ukr: "Не можу зчитати запис з системної таблиці"

# ER_CANT_GET_STAT
source: "Can't get status of '%-.200s' (errno: %M)"
ukr: "Не можу отримати статус '%-.200s' (помилка: %M)"

# ER_CANT_GET_WD
source: "Can't get working directory (errno: %M)"
ukr: "Не можу визначити робочу теку (помилка: %M)"

# ER_CANT_LOCK
source: "Can't lock file (errno: %M)"
ukr: "Не можу заблокувати файл (помилка: %M)"

# ER_CANT_OPEN_FILE
source: "Can't open file: '%-.200s' (errno: %M)"
ukr: "Не можу відкрити файл: '%-.200s' (помилка: %M)"

# ER_FILE_NOT_FOUND
source: "Can't find file: '%-.200s' (errno: %M)"
ukr: "Не можу знайти файл: '%-.200s' (помилка: %M)"

# ER_CANT_READ_DIR
source: "Can't read dir of '%-.192s' (errno: %M)"
ukr: "Не можу прочитати теку '%-.192s' (помилка: %M)"

# ER_CANT_SET_WD
source: "Can't change dir to '%-.192s' (errno: %M)"
ukr: "Не можу перейти у теку '%-.192s' (помилка: %M)"

# ER_CHECKREAD
source: "Record has changed since last read in table '%-.192s'"
ukr: "Запис було змінено з часу останнього читання з таблиці '%-.192s'"

# ER_DISK_FULL
source: "Disk full (%s); waiting for someone to free some space... (errno: %M)"
ukr: "Диск заповнений (%s). Вичикую, доки звільниться трохи місця... (помилка: %M)"

# ER_DUP_KEY 23000
source: "Can't write; duplicate key in table '%-.192s'"
ukr: "Не можу записати, дублюючийся ключ в таблиці '%-.192s'"

# ER_ERROR_ON_CLOSE
source: "Error on close of '%-.192s' (errno: %M)"
ukr: "Не можу закрити '%-.192s' (помилка: %M)"

# ER_ERROR_ON_READ
source: "Error reading file '%-.200s' (errno: %M)"
ukr: "Не можу прочитати файл '%-.200s' (помилка: %M)"

# ER_ERROR_ON_RENAME
source: "Error on rename of '%-.210s' to '%-.210s' (errno: %M)"
ukr: "Не можу перейменувати '%-.210s' у '%-.210s' (помилка: %M)"

# ER_ERROR_ON_WRITE
source: "Error writing file '%-.200s' (errno: %M)"
ukr: "Не можу записати файл '%-.200s' (помилка: %M)"

# ER_FILE_USED
source: "'%-.192s' is locked against change"
ukr: "'%-.192s' заблокований на внесення змін"

# ER_FILSORT_ABORT
source: "Sort aborted"
ukr: "Сортування перервано"

# ER_FORM_NOT_FOUND
source: "View '%-.192s' doesn't exist for '%-.192s'"
ukr: "Вигляд '%-.192s' не існує для '%-.192s'"

# ER_GET_ERRNO
source: "Got error %M from storage engine %s"
ukr: "Отримано помилку %M від дескриптора таблиці %s"

# ER_ILLEGAL_HA
source: "Storage engine %s of the table %`s.%`s doesn't have this option"
ukr: "Дескриптор %s таблиці %`s.%`s не має цієї властивості"

# ER_KEY_NOT_FOUND
source: "Can't find record in '%-.192s'"
ukr: "Не можу записати у '%-.192s'"

# ER_NOT_FORM_FILE
source: "Incorrect information in file: '%-.200s'"
ukr: "Хибна інформація у файлі: '%-.200s'"

# ER_NOT_KEYFILE
source: "Index for table '%-.200s' is corrupt; try to repair it"
ukr: "Хибний файл ключей для таблиці: '%-.200s'; Спробуйте його відновити"

# ER_OLD_KEYFILE
source: "Old key file for table '%-.192s'; repair it!"
ukr: "Старий файл ключей для таблиці '%-.192s'; Відновіть його!"

# ER_OPEN_AS_READONLY
source: "Table '%-.192s' is read only"
ukr: "Таблиця '%-.192s' тільки для читання"

# ER_OUTOFMEMORY HY001 S1001
source: "Out of memory; restart server and try again (needed %d bytes)"
ukr: "Брак пам'яті. Рестартуйте сервер та спробуйте знову (потрібно %d байтів)"

# ER_OUT_OF_SORTMEMORY HY001 S1001
source: "Out of sort memory, consider increasing server sort buffer size"
ukr: "Брак пам'яті для сортування. Треба збільшити розмір буфера сортування у сервера"

# ER_UNEXPECTED_EOF
source: "Unexpected EOF found when reading file '%-.192s' (errno: %M)"
ukr: "Хибний кінець файлу '%-.192s' (помилка: %M)"

# ER_CON_COUNT_ERROR 08004
source: "Too many connections"
ukr: "Забагато з'єднань"

# ER_OUT_OF_RESOURCES
source: "Out of memory."
ukr: "Брак пам'яті."

# ER_BAD_HOST_ERROR 08S01
source: "Can't get hostname for your address"
ukr: "Не можу визначити ім'я хосту для вашої адреси"

# ER_HANDSHAKE_ERROR 08S01
source: "Bad handshake"
ukr: "Невірна установка зв'язку"

# ER_DBACCESS_DENIED_ERROR 42000
source: "Access denied for user '%s'@'%s' to database '%-.192s'"
ukr: "Доступ заборонено для користувача: '%s'@'%s' до бази данних '%-.192s'"

# ER_ACCESS_DENIED_ERROR 28000
source: "Access denied for user '%s'@'%s' (using password: %s)"
ukr: "Доступ заборонено для користувача: '%s'@'%s' (Використано пароль: %s)"

# ER_NO_DB_ERROR 3D000
source: "No database selected"
ukr: "Базу данних не вибрано"

# ER_UNKNOWN_COM_ERROR 08S01
source: "Unknown command"
ukr: "Невідома команда"

# ER_BAD_NULL_ERROR 23000
source: "Column '%-.192s' cannot be null"
ukr: "Стовбець '%-.192s' не може бути нульовим"

# ER_BAD_DB_ERROR 42000
source: "Unknown database '%-.192s'"
ukr: "Невідома база данних '%-.192s'"

# ER_TABLE_EXISTS_ERROR 42S01
source: "Table '%-.192s' already exists"
ukr: "Таблиця '%-.192s' вже існує"

# ER_BAD_TABLE_ERROR 42S02
source: "Unknown table '%-.100T'"
ukr: "Невідома таблиця '%-.100T'"

# ER_NON_UNIQ_ERROR 23000
source: "Column '%-.192s' in %-.192s is ambiguous"
ukr: "Стовбець '%-.192s' у %-.192s визначений неоднозначно"

# ER_SERVER_SHUTDOWN 08S01
source: "Server shutdown in progress"
ukr: "Завершується работа сервера"

# ER_BAD_FIELD_ERROR 42S22 S0022
source: "Unknown column '%-.192s' in '%-.192s'"
ukr: "Невідомий стовбець '%-.192s' у '%-.192s'"

# ER_WRONG_FIELD_WITH_GROUP 42000 S1009
source: "'%-.192s' isn't in GROUP BY"
ukr: "'%-.192s' не є у GROUP BY"

# ER_WRONG_GROUP_FIELD 42000 S1009
source: "Can't group on '%-.192s'"
ukr: "Не можу групувати по '%-.192s'"

# ER_WRONG_SUM_SELECT 42000 S1009
source: "Statement has sum functions and columns in same statement"
ukr: "У виразі використано підсумовуючі функції поряд з іменами стовбців"

# ER_WRONG_VALUE_COUNT 21S01
source: "Column count doesn't match value count"
ukr: "Кількість стовбців не співпадає з кількістю значень"

# ER_TOO_LONG_IDENT 42000 S1009
source: "Identifier name '%-.100T' is too long"
ukr: "Ім'я ідентифікатора '%-.100T' задовге"

# ER_DUP_FIELDNAME 42S21 S1009
source: "Duplicate column name '%-.192s'"
ukr: "Дублююче ім'я стовбця '%-.192s'"

# ER_DUP_KEYNAME 42000 S1009
source: "Duplicate key name '%-.192s'"
ukr: "Дублююче ім'я ключа '%-.192s'"

# ER_DUP_ENTRY 23000 S1009
source: "Duplicate entry '%-.192T' for key %d"
ukr: "Дублюючий запис '%-.192T' для ключа %d"

# ER_WRONG_FIELD_SPEC 42000 S1009
source: "Incorrect column specifier for column '%-.192s'"
ukr: "Невірний специфікатор стовбця '%-.192s'"

# ER_PARSE_ERROR 42000 s1009
source: "%s near '%-.80T' at line %d"
ukr: "%s біля '%-.80T' в строці %d"

# ER_EMPTY_QUERY 42000
source: "Query was empty"
ukr: "Пустий запит"

# ER_NONUNIQ_TABLE 42000 S1009
source: "Not unique table/alias: '%-.192s'"
ukr: "Неунікальна таблиця/псевдонім: '%-.192s'"

# ER_INVALID_DEFAULT 42000 S1009
source: "Invalid default value for '%-.192s'"
ukr: "Невірне значення по замовчуванню для '%-.192s'"

# ER_MULTIPLE_PRI_KEY 42000 S1009
source: "Multiple primary key defined"
ukr: "Первинного ключа визначено неодноразово"

# ER_TOO_MANY_KEYS 42000 S1009
source: "Too many keys specified; max %d keys allowed"
ukr: "Забагато ключів зазначено. Дозволено не більше %d ключів"

# ER_TOO_MANY_KEY_PARTS 42000 S1009
source: "Too many key parts specified; max %d parts allowed"
ukr: "Забагато частин ключа зазначено. Дозволено не більше %d частин"

# ER_TOO_LONG_KEY 42000 S1009
source: "Specified key was too long; max key length is %d bytes"
ukr: "Зазначений ключ задовгий. Найбільша довжина ключа %d байтів"

# ER_KEY_COLUMN_DOES_NOT_EXIST 42000 S1009
source: "Key column '%-.192s' doesn't exist in table"
ukr: "Ключовий стовбець '%-.192s' не існує у таблиці"

# ER_BLOB_USED_AS_KEY 42000 S1009
source: "BLOB column %`s can't be used in key specification in the %s table"
ukr: "BLOB стовбець %`s не може бути використаний у визначенні ключа в %s таблиці"

# ER_TOO_BIG_FIELDLENGTH 42000 S1009
source: "Column length too big for column '%-.192s' (max = %lu); use BLOB or TEXT instead"
ukr: "Задовга довжина стовбця '%-.192s' (max = %lu). Використайте тип BLOB"

# ER_WRONG_AUTO_KEY 42000 S1009
source: "Incorrect table definition; there can be only one auto column and it must be defined as a key"
ukr: "Хибне визначення таблиці; Може бути лише один автоматичний стовбець, що повинен бути визначений як ключ"

# ER_BINLOG_CANT_DELETE_GTID_DOMAIN
source: "Could not delete gtid domain. Reason: %s."
ukr: "Не можу видалити домен gtid. Причина: %s."

# ER_NORMAL_SHUTDOWN
source: "%s (initiated by: %s): Normal shutdown"
ukr: "%s (%s): Нормальне завершення"

# ER_GOT_SIGNAL
source: "%s: Got signal %d. Aborting!\n"
ukr: "%s: Отримано сигнал %d. Перериваюсь!\n"

# ER_SHUTDOWN_COMPLETE
source: "%s: Shutdown complete\n"
ukr: "%s: Роботу завершено\n"

# ER_FORCING_CLOSE 08S01
source: "%s: Forcing close of thread %ld user: '%-.48s'\n"
ukr: "%s: Прискорюю закриття гілки %ld користувача: '%-.48s'\n"

# ER_IPSOCK_ERROR 08S01
source: "Can't create IP socket"
ukr: "Не можу створити IP роз'єм"

# ER_NO_SUCH_INDEX 42S12 S1009
source: "Table '%-.192s' has no index like the one used in CREATE INDEX; recreate the table"
ukr: "Таблиця '%-.192s' має індекс, що не співпадає з вказанним у CREATE INDEX. Створіть таблицю знову"

# ER_WRONG_FIELD_TERMINATORS 42000 S1009
source: "Field separator argument is not what is expected; check the manual"
ukr: "Хибний розділювач полів. Почитайте документацію"

# ER_BLOBS_AND_NO_TERMINATED 42000 S1009
source: "You can't use fixed rowlength with BLOBs; please use 'fields terminated by'"
ukr: "Не можна використовувати сталу довжину строки з BLOB. Зкористайтеся 'fields terminated by'"

# ER_TEXTFILE_NOT_READABLE
source: "The file '%-.128s' must be in the database directory or be readable by all"
ukr: "Файл '%-.128s' повинен бути у теці бази данних або мати встановлене право на читання для усіх"

# ER_FILE_EXISTS_ERROR
source: "File '%-.200s' already exists"
ukr: "Файл '%-.200s' вже існує"

# ER_LOAD_INFO
source: "Records: %ld Deleted: %ld Skipped: %ld Warnings: %ld"
ukr: "Записів: %ld Видалено: %ld Пропущено: %ld Застережень: %ld"

# ER_ALTER_INFO
source: "Records: %ld Duplicates: %ld"
ukr: "Записів: %ld Дублікатів: %ld"

# ER_WRONG_SUB_KEY
source: "Incorrect prefix key; the used key part isn't a string, the used length is longer than the key part, or the storage engine doesn't support unique prefix keys"
ukr: "Невірна частина ключа. Використана частина ключа не є строкою, задовга або вказівник таблиці не підтримує унікальних частин ключей"

# ER_CANT_REMOVE_ALL_FIELDS 42000
source: "You can't delete all columns with ALTER TABLE; use DROP TABLE instead"
ukr: "Не можливо видалити всі стовбці за допомогою ALTER TABLE. Для цього скористайтеся DROP TABLE"

# ER_CANT_DROP_FIELD_OR_KEY 42000
source: "Can't DROP %s %`-.192s; check that it exists"
ukr: "Не можу DROP %s %`-.192s. Перевірте, чи він існує"

# ER_INSERT_INFO
source: "Records: %ld Duplicates: %ld Warnings: %ld"
ukr: "Записів: %ld Дублікатів: %ld Застережень: %ld"

# ER_UPDATE_TABLE_USED
source: "Table '%-.192s' is specified twice, both as a target for '%s' and as a separate source for data"
ukr: "Таблиця '%-.192s' вказується двічі, як цільова для '%s', так і як окреме джерело даних"

# ER_NO_SUCH_THREAD
source: "Unknown thread id: %lu"
ukr: "Невідомий ідентифікатор гілки: %lu"

# ER_KILL_DENIED_ERROR
source: "You are not owner of thread %lld"
ukr: "Ви не володар гілки %lld"

# ER_NO_TABLES_USED
source: "No tables used"
ukr: "Не використано таблиць"

# ER_TOO_BIG_SET
source: "Too many strings for column %-.192s and SET"
ukr: "Забагато строк для стовбця %-.192s та SET"

# ER_NO_UNIQUE_LOGFILE
source: "Can't generate a unique log-filename %-.200s.(1-999)\n"
ukr: "Не можу згенерувати унікальне ім'я log-файлу %-.200s.(1-999)\n"

# ER_TABLE_NOT_LOCKED_FOR_WRITE
source: "Table '%-.192s' was locked with a READ lock and can't be updated"
ukr: "Таблицю '%-.192s' заблоковано тільки для читання, тому її не можна оновити"

# ER_TABLE_NOT_LOCKED
source: "Table '%-.192s' was not locked with LOCK TABLES"
ukr: "Таблицю '%-.192s' не було блоковано з LOCK TABLES"

# ER_WRONG_DB_NAME 42000
source: "Incorrect database name '%-.100T'"
ukr: "Невірне ім'я бази данних '%-.100T'"

# ER_WRONG_TABLE_NAME 42000
source: "Incorrect table name '%-.100s'"
ukr: "Невірне ім'я таблиці '%-.100s'"

# ER_TOO_BIG_SELECT 42000
source: "The SELECT would examine more than MAX_JOIN_SIZE rows; check your WHERE and use SET SQL_BIG_SELECTS=1 or SET MAX_JOIN_SIZE=# if the SELECT is okay"
ukr: "Запиту SELECT потрібно обробити багато записів, що, певне, займе дуже багато часу. Перевірте ваше WHERE та використовуйте SET SQL_BIG_SELECTS=1, якщо цей запит SELECT є вірним"

# ER_UNKNOWN_ERROR
source: "Unknown error"
ukr: "Невідома помилка"

# ER_UNKNOWN_PROCEDURE 42000
source: "Unknown procedure '%-.192s'"
ukr: "Невідома процедура '%-.192s'"

# ER_WRONG_PARAMCOUNT_TO_PROCEDURE 42000
source: "Incorrect parameter count to procedure '%-.192s'"
ukr: "Хибна кількість параметрів процедури '%-.192s'"

# ER_WRONG_PARAMETERS_TO_PROCEDURE
source: "Incorrect parameters to procedure '%-.192s'"
ukr: "Хибний параметер процедури '%-.192s'"

# ER_UNKNOWN_TABLE 42S02
source: "Unknown table '%-.192s' in %-.32s"
ukr: "Невідома таблиця '%-.192s' у %-.32s"

# ER_FIELD_SPECIFIED_TWICE 42000
source: "Column '%-.192s' specified twice"
ukr: "Стовбець '%-.192s' зазначено двічі"

# ER_INVALID_GROUP_FUNC_USE
source: "Invalid use of group function"
ukr: "Хибне використання функції групування"

# ER_UNSUPPORTED_EXTENSION 42000
source: "Table '%-.192s' uses an extension that doesn't exist in this MariaDB version"
ukr: "Таблиця '%-.192s' використовує розширення, що не існує у цій версії MariaDB"

# ER_TABLE_MUST_HAVE_COLUMNS 42000
source: "A table must have at least 1 column"
ukr: "Таблиця повинна мати хочаб один стовбець"

# ER_RECORD_FILE_FULL
source: "The table '%-.192s' is full"
ukr: "Таблиця '%-.192s' заповнена"

# ER_UNKNOWN_CHARACTER_SET 42000
source: "Unknown character set: '%-.64s'"
ukr: "Невідома кодова таблиця: '%-.64s'"

# ER_TOO_MANY_TABLES
source: "Too many tables; MariaDB can only use %d tables in a join"
ukr: "Забагато таблиць. MariaDB може використовувати лише %d таблиць у об'єднанні"

# ER_TOO_MANY_FIELDS
source: "Too many columns"
ukr: "Забагато стовбців"

# ER_TOO_BIG_ROWSIZE 42000
source: "Row size too large. The maximum row size for the used table type, not counting BLOBs, is %ld. This includes storage overhead, check the manual. You have to change some columns to TEXT or BLOBs"
ukr: "Задовга строка. Найбільшою довжиною строки, не рахуючи BLOB, є %ld. Вам потрібно привести деякі стовбці до типу BLOB"

# ER_STACK_OVERRUN
source: "Thread stack overrun: Used: %ld of a %ld stack. Use 'mariadbd --thread_stack=#' to specify a bigger stack if needed"
ukr: "Стек гілок переповнено: Використано: %ld з %ld. Використовуйте 'mariadbd --thread_stack=#' аби зазначити більший стек, якщо необхідно"

# ER_WRONG_OUTER_JOIN 42000
source: "Cross dependency found in OUTER JOIN; examine your ON conditions"
ukr: "Перехресна залежність у OUTER JOIN. Перевірте умову ON"

# ER_NULL_COLUMN_IN_INDEX 42000
source: "Table handler doesn't support NULL in given index. Please change column '%-.192s' to be NOT NULL or use another handler"
ukr: "Вказівник таблиці не підтримує NULL у зазначенному індексі. Будь ласка, зменіть стовпчик '%-.192s' на NOT NULL або використайте інший вказівник таблиці."

# ER_CANT_FIND_UDF
source: "Can't load function '%-.192s'"
ukr: "Не можу завантажити функцію '%-.192s'"

# ER_CANT_INITIALIZE_UDF
source: "Can't initialize function '%-.192s'; %-.80s"
ukr: "Не можу ініціалізувати функцію '%-.192s'; %-.80s"

# ER_UDF_NO_PATHS
source: "No paths allowed for shared library"
ukr: "Не дозволено використовувати путі для розділюваних бібліотек"

# ER_UDF_EXISTS
source: "Function '%-.192s' already exists"
ukr: "Функція '%-.192s' вже існує"

# ER_CANT_OPEN_LIBRARY
source: "Can't open shared library '%-.192s' (errno: %d, %-.128s)"
ukr: "Не можу відкрити розділювану бібліотеку '%-.192s' (помилка: %d, %-.128s)"

# ER_CANT_FIND_DL_ENTRY
source: "Can't find symbol '%-.128s' in library"
ukr: "Не можу знайти функцію '%-.128s' у бібліотеці"

# ER_FUNCTION_NOT_DEFINED
source: "Function '%-.192s' is not defined"
ukr: "Функцію '%-.192s' не визначено"

# ER_HOST_IS_BLOCKED
source: "Host '%-.64s' is blocked because of many connection errors; unblock with 'mariadb-admin flush-hosts'"
ukr: "Хост '%-.64s' заблоковано з причини великої кількості помилок з'єднання. Для розблокування використовуйте 'mariadb-admin flush-hosts'"

# ER_HOST_NOT_PRIVILEGED
source: "Host '%-.64s' is not allowed to connect to this MariaDB server"
ukr: "Хосту '%-.64s' не доволено зв'язуватись з цим сервером MariaDB"

# ER_PASSWORD_ANONYMOUS_USER 42000
source: "You are using MariaDB as an anonymous user and anonymous users are not allowed to modify user settings"
ukr: "Ви використовуєте MariaDB як анонімний користувач, тому вам не дозволено змінювати паролі"

# ER_PASSWORD_NOT_ALLOWED 42000
source: "You must have privileges to update tables in the mysql database to be able to change passwords for others"
ukr: "Ви повині мати право на оновлення таблиць у базі данних mysql, аби мати можливість змінювати пароль іншим"

# ER_PASSWORD_NO_MATCH 28000
source: "Can't find any matching row in the user table"
ukr: "Не можу знайти відповідних записів у таблиці користувача"

# ER_UPDATE_INFO
source: "Rows matched: %ld Changed: %ld Warnings: %ld"
ukr: "Записів відповідає: %ld Змінено: %ld Застережень: %ld"

# ER_CANT_CREATE_THREAD
source: "Can't create a new thread (errno %M); if you are not out of available memory, you can consult the manual for a possible OS-dependent bug"
ukr: "Не можу створити нову гілку (помилка %M). Якщо ви не використали усю пам'ять, то прочитайте документацію до вашої ОС - можливо це помилка ОС"

# ER_WRONG_VALUE_COUNT_ON_ROW 21S01
source: "Column count doesn't match value count at row %lu"
ukr: "Кількість стовбців не співпадає з кількістю значень у строці %lu"

# ER_CANT_REOPEN_TABLE
source: "Can't reopen table: '%-.192s'"
ukr: "Не можу перевідкрити таблицю: '%-.192s'"

# ER_INVALID_USE_OF_NULL 22004
source: "Invalid use of NULL value"
ukr: "Хибне використання значення NULL"

# ER_REGEXP_ERROR 42000
source: "Regex error '%s'"
ukr: "Помилка регулярного виразу: %s"

# ER_MIX_OF_GROUP_FUNC_AND_FIELDS 42000
source: "Mixing of GROUP columns (MIN(),MAX(),COUNT(),...) with no GROUP columns is illegal if there is no GROUP BY clause"
ukr: "Змішування GROUP стовбців (MIN(),MAX(),COUNT()...) з не GROUP стовбцями є забороненим, якщо не має GROUP BY"

# ER_NONEXISTING_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s'"
ukr: "Повноважень не визначено для користувача '%-.48s' з хосту '%-.64s'"

# ER_TABLEACCESS_DENIED_ERROR 42000
source: "%-.100T command denied to user '%s'@'%s' for table '%-.192s'"
ukr: "%-.100T команда заборонена користувачу: '%s'@'%s' у таблиці '%-.192s'"

# ER_COLUMNACCESS_DENIED_ERROR 42000
source: "%-.32s command denied to user '%s'@'%s' for column '%-.192s' in table '%-.192s'"
ukr: "%-.32s команда заборонена користувачу: '%s'@'%s' для стовбця '%-.192s' у таблиці '%-.192s'"

# ER_ILLEGAL_GRANT_FOR_TABLE 42000
source: "Illegal GRANT/REVOKE command; please consult the manual to see which privileges can be used"
ukr: "Хибна GRANT/REVOKE команда; прочитайте документацію стосовно того, які права можна використовувати"

# ER_GRANT_WRONG_HOST_OR_USER 42000
source: "The host or user argument to GRANT is too long"
ukr: "Аргумент host або user для GRANT задовгий"

# ER_NO_SUCH_TABLE 42S02
source: "Table '%-.192s.%-.192s' doesn't exist"
ukr: "Таблиця '%-.192s.%-.192s' не існує"

# ER_NONEXISTING_TABLE_GRANT 42000
source: "There is no such grant defined for user '%-.48s' on host '%-.64s' on table '%-.192s'"
ukr: "Повноважень не визначено для користувача '%-.48s' з хосту '%-.64s' для таблиці '%-.192s'"

# ER_NOT_ALLOWED_COMMAND 42000
source: "The used command is not allowed with this MariaDB version"
ukr: "Використовувана команда не дозволена у цій версії MariaDB"

# ER_SYNTAX_ERROR 42000
source: "You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use"
ukr: "У вас помилка у синтаксисі SQL"

# ER_DELAYED_CANT_CHANGE_LOCK
source: "Delayed insert thread couldn't get requested lock for table %-.192s"
ukr: "Гілка для INSERT DELAYED не може отримати блокування для таблиці %-.192s"

# ER_TOO_MANY_DELAYED_THREADS
source: "Too many delayed threads in use"
ukr: "Забагато затриманих гілок використовується"

# ER_ABORTING_CONNECTION 08S01
source: "Aborted connection %ld to db: '%-.192s' user: '%-.48s' (%-.64s)"
ukr: "Перервано з'єднання %ld до бази данних: '%-.192s' користувача: '%-.48s' (%-.64s)"

# ER_NET_PACKET_TOO_LARGE 08S01
source: "Got a packet bigger than 'max_allowed_packet' bytes"
ukr: "Отримано пакет більший ніж max_allowed_packet"

# ER_NET_READ_ERROR_FROM_PIPE 08S01
source: "Got a read error from the connection pipe"
ukr: "Отримано помилку читання з комунікаційного каналу"

# ER_NET_FCNTL_ERROR 08S01
source: "Got an error from fcntl()"
ukr: "Отримано помилкку від fcntl()"

# ER_NET_PACKETS_OUT_OF_ORDER 08S01
source: "Got packets out of order"
ukr: "Отримано пакети у неналежному порядку"

# ER_NET_UNCOMPRESS_ERROR 08S01
source: "Couldn't uncompress communication packet"
ukr: "Не можу декомпресувати комунікаційний пакет"

# ER_NET_READ_ERROR 08S01
source: "Got an error reading communication packets"
ukr: "Отримано помилку читання комунікаційних пакетів"

# ER_NET_READ_INTERRUPTED 08S01
source: "Got timeout reading communication packets"
ukr: "Отримано затримку читання комунікаційних пакетів"

# ER_NET_ERROR_ON_WRITE 08S01
source: "Got an error writing communication packets"
ukr: "Отримано помилку запису комунікаційних пакетів"

# ER_NET_WRITE_INTERRUPTED 08S01
source: "Got timeout writing communication packets"
ukr: "Отримано затримку запису комунікаційних пакетів"

# ER_TOO_LONG_STRING 42000
source: "Result string is longer than 'max_allowed_packet' bytes"
ukr: "Строка результату довша ніж max_allowed_packet"

# ER_TABLE_CANT_HANDLE_BLOB 42000
source: "Storage engine %s doesn't support BLOB/TEXT columns"
ukr: "%s таблиці не підтримують BLOB/TEXT стовбці"

# ER_TABLE_CANT_HANDLE_AUTO_INCREMENT 42000
source: "Storage engine %s doesn't support AUTO_INCREMENT columns"
ukr: "%s таблиці не підтримують AUTO_INCREMENT стовбці"

# ER_DELAYED_INSERT_TABLE_LOCKED
source: "INSERT DELAYED can't be used with table '%-.192s' because it is locked with LOCK TABLES"
ukr: "INSERT DELAYED не може бути використано з таблицею '%-.192s', тому що її заблоковано з LOCK TABLES"
